{
   "main-desc": "RetroArch merupakan proyek sumber-terbuka yang menggunakan antarmuka pengembangan kuat bernama Libretro. Libretro adalah antarmuka yang dapat membuat aplikasi lintas pelantar menggunakan fitur hebat seperti OpenGL, dukungan kamera lintas pelantar, dukungan lokasi, dan masih banyak lagi ke depannya.\n\nSekaligus hadir dengan kumpulan aplikasi bawaan tersendiri untuk memberikan Anda hiburan rasa 'serbaada'.\n\nLibretro dan RetroArch sangat cocok untuk membuat permainan, emulator dan program multimedia. Jika ingin tahu lebih lanjut, silakan kunjungi situs web kami (tertera di bawah).\nPENTING!!!\n\nRetroArch merupakan program emulator permainan serbaguna, dan untuk menjalankannya perlu ada program modular yang kami sebut \"Core\". Core ini TIDAK DISEDIAKAN SEKEMAS. Anda harus masuk ke \"Pembaruan Daring -> Pembaruan Inti\" pada aplikasi untuk mengunduhnya.\n\nFITUR:\n* Tampilan antarmuka cantik yang dapat dipilih sesuka hati!\n* Memindai berkas permainan Anda dan menambahkannya ke daftar koleksi sistem!\n* Dapat melihat informasi tentang permainan yang telah dipindai!\n* Unduh program ('core') secara daring\n* Perbarui segalanya!\n* Unduh permainan-permainan Game & Watch dan mainkan dengan emulator Game & Watch eksklusif kami!\n* Dilengkapi Input Mapping bawaan\n* Kemampuan memetakan ulang kendali\n* Kemampuan memuat dan menerapkan cheat\n* Dukungan banyak bahasa!\n* Tersedia lebih dari 80 program ('core') dan terus bertambah!\n* Bermain dengan pemain lain lewat NetPlay!\n* Menangkap layar, menyimpan save state, dan masih banyak lagi!\n\n* Bebas dari DRM\n* Tidak ada batasan dalam penggunaan\n* Sumber-terbuka\n* Bebas iklan\n* Bebas dari pengintai dan mata-mata\n* Bebas jeda iklan\n\nBergabung lah dengan kami di discord untuk dukungan dan bermain jamak dengan pemain lain\nhttps://discord.gg/C4amCeV\n\nKunjungi kanal Youtube kami untuk tutorial, gameplay, berita, dan perkembangan pengembangan terbaru\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nUntuk informasi lebih lanjut terkait panduan dan dokumentasi, kunjungi\nhttps://docs.libretro.com/\n\nKunjungi situs kami\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Game Retro dan emulator dalam satu perangkat!"
}
