{
   "main-desc": "Mae RetroArch yn brosiect ffynhonnell agored sy'n defnyddio rhyngwyneb datblygu pwerus o'r enw Libretro. Mae Libretro yn rhyngwyneb sy'n eich galluogi i wneud cymwysiadau traws-blatfform a all ddefnyddio nodweddion cyfoethog fel OpenGL, cefnogaeth camerâu traws-blatfform, cymorth lleoliad, a mwy yn y dyfodol.\n\nMae'n dod gyda'i gasgliad adeiledig ei hun o gymwysiadau i ddarparu 'siop un stop' ar gyfer adloniant.\n\nMae Libretro a RetroArch yn berffaith addas ar gyfer creu gemau, efelychwyr a rhaglenni amlgyfrwng. Os ydych chi eisiau dysgu mwy, ewch i'n gwefan (a restrir isod).\nPWYSIG!!!\n\nMae RetroArch yn rhaglen amlbwrpas, sy'n golygu er mwyn iddi wneud unrhyw beth, mae angen rhaglenni modiwlaidd yr ydym yn eu galw'n 'greiddiau'. NID YW'R CREDDIAU YN CYNWYSIEDIG. Mae angen i chi fynd i \"Online Updater -> Core Updater\" o'r tu mewn i'r app i'w lawrlwytho.\n\nNODWEDDION:\n* Dewislenni candy-llygad i ddewis ymhlith!\n* Sganiwch ffeiliau / cyfeiriaduron a'u hychwanegu at gasgliadau system gemau!\n* Edrychwch ar wybodaeth gronfa ddata am bob gêm ar ôl ei hychwanegu at gasgliad!\n* Lawrlwythwch raglenni ('creiddiau') ar-lein\n* Diweddarwch bopeth!\n* Dadlwythwch gemau Gêm a Gwylio a'u chwarae gyda'n efelychydd Game & Watch unigryw!\n* Ail-fapio mewnbwn\n* Y gallu i ail-osod rheolaethau\n* Y gallu i osod a llwytho twyllwyr\n* Cefnogaeth aml-iaith!\n* Dros 80+ o raglenni ('creiddiau') nawr ac yn cyfri!\n* Chwarae multiplayer gyda NetPlay!\n* Cymerwch sgrinluniau, arbed cyflwr a mwy!\n\n* Dim DRM\n* Dim cyfyngiadau ar ddefnydd\n* Cod-agored\n* Dim hysbysebion gwthio\n* Dim ysbïo\n* Dim cyfnod hysbysebion\n\nYmunwch â ni ar discord i gael cefnogaeth a paru netplay \nhttps://discord.gg/C4amCeV\n\nEwch i'n sianel Youtube yma i gael sesiynau tiwtorial, chwaraeiadau, newyddion a'r cynnydd a'r datblygiad!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nAm wybodaeth a chymorth, gweler ein gwefan ddogfennaeth -\nhttps://docs.libretro.com/\n\nEwch i'n gwefan!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Gemau retro ac efelychwyr ar eich dyfais!"
}
