{
   "main-desc": "RetroArch je open-source projekt, ktorý využíva výkonné vývojové rozhranie Libretro. Libretro je rozhranie, ktoré umožňuje vytvárať multiplatformové aplikácie, ktoré môžu využívať bohaté funkcie, ako je OpenGL, multiplatformová podpora kamery, podpora polohy a v budúcnosti aj mnohé ďalšie.\n\nDodáva sa s vlastnou vstavanou zbierkou aplikácií, ktoré vám poskytnú \"komplexnú\" zábavu.\n\nLibretro a RetroArch sa dokonale hodia na vytváranie hier, emulátorov a multimediálnych programov. Ak sa chcete dozvedieť viac, prejdite na našu webovú stránku (uvedenú nižšie).\nDÔLEŽITÉ!!!\n\nRetroArch je viacúčelový program, to znamená, že na to, aby mohol niečo robiť, potrebujete modulárne programy, ktoré nazývame \"jadrá\". Tieto jadrá NIE SÚ SÚČASŤOU BALÍKA. Ak si ich chcete stiahnuť, musíte z aplikácie prejsť na \"Online aktualizácie -> Aktualizácia jadier\".\n\nFUNKCIE:\n* Graficky príťažlivé ponuky, z ktorých si môžete vyberať!\n* Skenovanie súborov/adresárov a ich pridávanie do zbierok herného systému!\n* Zobrazenie informácií z databázy o každej hre po pridaní do kolekcie!\n* Stiahnite si jednotlivé jadrá online\n* Aktualizujte všetko!\n* Stiahnite si hry Game & Watch a hrajte ich pomocou nášho exkluzívneho emulátora Game & Watch!\n* Vstavané nastavenie ovládačov\n* Možnosť premapovať ovládacie prvky\n* Možnosť zadávať a načítavať cheaty\n* Podpora viacerých jazykov!\n* Viac ako 80+ jadier a stále pribúdajú ďalšie!\n* Hrajte hry pre viacerých hráčov pomocou funkcie NetPlay!\n* Snímanie obrazovky, ukladanie stavov a ďalšie funkcie!\n\n* Žiadne DRM\n* Žiadne obmedzenia pri používaní\n* Otvorený zdrojový kód\n* Žiadne vyskakovacie reklamy\n* Žiadne špehovanie\n* Vždy bez reklám\n\nPridajte sa k nám na discorde pre podporu a online hranie na \nhttps://discord.gg/C4amCeV\n\nNavštívte náš Youtube kanál tu pre návody, ukážky hrania, novinky a pokrok vo vývoji!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nInformácie a pomoc nájdete na našej dokumentačnej stránke -\nhttps://docs.libretro.com/\n\nNavštívte našu webovú stránku!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Retro hry a emulátory na tvojom zariadení!"
}
