{
   "main-desc": "Is tionscadal foinse oscailte é RetroArch a bhaineann úsáid as comhéadan forbartha cumhachtach ar a dtugtar Libretro. Is comhéadan é Libretro a ligeann duit feidhmchláir tras-ardáin a chruthú ar féidir leo gnéithe saibhre ar nós OpenGL, tacaíocht ceamara tras-ardáin, tacaíocht suímh, agus níos mó a úsáid sa todhchaí.\n\nTagann sé lena bhailiúchán feidhmchlár féin chun 'ionad aon stad' a sholáthar duit le haghaidh siamsaíochta.\n\nTá Libretro agus RetroArch oiriúnach go foirfe chun cluichí, aithriseoirí agus cláir ilmheán a chruthú. Más mian leat tuilleadh eolais a fháil, téigh chuig ár suíomh Gréasáin (liostaithe thíos).\nTÁBHACHTACH!!!\n\nIs clár ilúsáideach é RetroArch, rud a chiallaíonn, chun go ndéanfaidh sé aon rud, go bhfuil cláir mhodúlacha ar a dtugaimid 'croíleacáin' de dhíth ort. NÍ THAGANN na croíleacáin seo AS AN mBOSCA. Ní mór duit dul chuig \"Nuashonraitheoir Ar Líne -> Nuashonraitheoir Croíleacáin\" ón aip chun iad a íoslódáil.\n\nGNÉITHE:\n* Biachláir iontacha le roghnú astu!\n* Scan comhaid / eolairí agus cuir iad le bailiúcháin córais cluichí!\n* Féach ar fhaisnéis bhunachar sonraí faoi gach cluiche a luaithe a chuirtear le bailiúchán é!\n* Íoslódáil cláir ('croíleacáin') ar líne\n* Nuashonraigh gach rud!\n* Íoslódáil cluichí Game & Watch agus imir iad lenár n-aithriseoir Game & Watch eisiach!\n* Athmhapáil ionchuir ionsuite\n* Cumas rialuithe a athmhapáil\n* Cumas cleasanna a iontráil agus a luchtú\n* Tacaíocht ilteangach!\n* Os cionn 80+ clár ('croíleacáin') anois agus ag comhaireamh!\n* Imir il-imreora le NetPlay!\n* Glac scáileáin, sábháil stáit agus tuilleadh!\n\n* Gan DRM\n* Gan srianta ar úsáid\n* Foinse Oscailte\n* Gan fógraí brú\n* Gan spiaireacht\n* Gan tréimhse fógraí\n\nBí linn ar discord le haghaidh tacaíochta agus meaitseáil netplay\nhttps://discord.gg/C4amCeV\n\nTabhair cuairt ar ár gcainéal Youtube anseo le haghaidh ranganna teagaisc, cluichí, nuacht agus dul chun cinn forbartha!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nLe haghaidh eolais agus cabhrach, féach ar ár suíomh doiciméadachta -\nhttps://docs.libretro.com/\n\nTabhair cuairt ar ár suíomh Gréasáin!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Cluichí agus aithriseoirí seanré ar do ghléas!"
}
