{
   "main-desc": "RetroArch é un proxecto de código aberto que utiliza unha potente interfaz de desenvolvemento chamada Libretro. Libretro permite crear aplicacións multiplataforma capaces de utilizar características como OpenGL, cámaras multiplataforma, localización, e moito máis no futuro.\n\nRetroArch inclúe unha colección integrada de aplicacións para ofrecerche un centro único de entretemento.\n\nLibretro e RetroArch son aptos para crear xogos, emuladores e aplicacións multimedia. Se queres saber máis, visita a nosa páxina web (máis abaixo).\nIMPORTANTE!!!\n\nRetroArch é un programa multiversátil, o que significa que para poder facer algo, precisa programas modulares aos que chamamos «núcleos». Estes núcleos NON VEÑEN INCLUÍDOS DE SERIE. Debes ir a Actualizador en liña -> Actualizador de núcleos dentro da aplicación para descargalos.\n\nCARACTERÍSTICAS:\n* Varios menús elegantes a elixir!\n* Busca arquivos ou cartafoles e agrégaos por coleccións de sistemas de videoxogos!\n* Accede á información de cada xogo na base de datos cando o engadiches a unha colección!\n* Descarga os programas («núcleos») a través de Internet\n* Mantén todo actualizado!\n* Descarga xogos de Game & Watch e goza deles co noso emulador exclusivo de Game & Watch!\n* Reasignación de entrada integrada\n* Reconfiguración de controis\n* Uso de trucos\n* Soporte multiidioma!\n* Actualmente hai máis de 80 programas («núcleos»), e cada vez son máis!\n* Partidas multixogador na rede!\n* Feixe capturas de pantalla, usa gardados rápidos, e moito máis!\n\n* Sen DRM\n* Sen restricións de uso\n* Código aberto\n* Sen anuncios forzados\n* Sen espionaxe algún\n* Sen anuncios. Punto.\n\nÚnete ao noso discord para recibir soporte técnico e organizar partidas na rede\nhttps://discord.gg/C4amCeV\n\nVisita a nosa canle de YouTube para ver titoriais, gameplays, novas e os avances do desenvolvemento!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPara información e axuda, bótalle unha ollada á nosa documentación (só en inglés):\nhttps://docs.libretro.com/\n\nVisita a nosa páxina web!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Xogos retro e emuladores no teu dispositivo!"
}
