{
   "main-desc": "O RetroArch é um projeto de código aberto que utiliza uma poderosa interface de desenvolvimento chamada Libretro. O Libretro é uma interface que permite criar aplicativos de plataforma cruzada que podem usar recursos avançados, como OpenGL, suporte a câmera com plataforma cruzada, suporte a localização e muito mais no futuro.\n\nEle vem com sua própria coleção interna de aplicativos para lhe fornecer um 'balcão único' de entretenimento.\n\nO Libretro e o RetroArch são perfeitamente adequados para criar jogos, emuladores e programas multimídia. Caso queira saber mais, acesse o nosso site (listado abaixo).\nIMPORTANTE!!!\n\nO RetroArch é um programa multi-versátil, o que significa que, para fazer qualquer coisa, você precisa de programas modulares que chamamos de 'núcleos'. Esses núcleos NÃO ESTÃO INCLUSOS. É preciso ir em \"Atualizador on-line -> Atualizador\" no aplicativo para fazer o download deles.\n\nRECURSOS:\n* Menus agradáveis ​​para escolher!\n* Digitalize arquivos / diretórios e adicione-os às coleções do sistema de jogos!\n* Ver informações do banco de dados sobre cada jogo, uma vez que for adicionado em uma coleção!\n* Baixe programas ('núcleos') on-line\n* Atualize tudo!\n* Baixe jogos Game & Watch e jogue-os com o nosso emulador de Game & Watch exclusivo!\n* Remapeamento da entrada embutido\n* Capacidade de remapear os controles\n* Capacidade de entrar e carregar trapaças\n* Suporte a vários idiomas!\n* Agora mais de 80 + programas ('núcleos') e contando!\n* Jogue online com o NetPlay!\n* Faça capturas de tela, salve as condições e muito mais!\n\n* Sem DRM\n* Sem restrições de uso\n* Código aberto\n* Sem anúncios na tela\n* Sem espionagem\n* Sem anúncios e ponto final\n\nJunte-se a nós no discord para suporte e jogatina online\nhttps://discord.gg/C4amCeV\n\nVisite o nosso canal aqui do Youtube para tutoriais, jogatina, notícias e para acompanhar o progresso do desenvolvimento!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPara mais informações e ajuda, consulte a documentação do site -\nhttps://docs.libretro.com/\n\nVisite o nosso site!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Jogos retrô e emuladores no seu dispositivo!"
}
