{
   "main-desc": "RetroArch est un projet open-source qui utilise une interface de développement puissante appelée Libretro. Libretro est une interface qui vous permet de créer des applications multi-plateformes qui peuvent utiliser des fonctionnalités riches comme OpenGL, la prise en charge multiplateforme de caméras, le support de la localisation, et plus encore à l'avenir.\n\nIl est livré avec sa propre collection d'applications intégrées pour vous fournir un 'guichet unique' pour le divertissement.\n\nLibretro et RetroArch sont parfaitement adaptés à la création de jeux, d'émulateurs et de programmes multimédia. Si vous voulez en savoir plus, rendez-vous sur notre site Web (listé ci-dessous).\nIMPORTANT!!!\n\nRetroArch est un programme polyvalent, ce qui signifie que pour qu'il fasse quoi que ce soit, vous avez besoin de programmes modulaires que nous appelons 'cœurs'. Ces cœurs NE SONT PAS INCLUS. Vous devez aller à \"Mise à jour en ligne -> Téléchargement de cœurs\" depuis l'application pour les télécharger.\n\nFONCTIONNALITÉS :\n* Des menus attractifs parmi lesquels choisir !\n* Analysez des fichiers/dossiers et ajoutez-les à des collections de systèmes de jeu !\n* Visualisez les informations de la base de données pour chaque jeu une fois ajouté à une collection !\n* Téléchargez des programmes ('cœurs') en ligne\n* Mettez tout à jour !\n* Téléchargez des jeux Game & Watch et jouez-y avec notre émulateur exclusif de Game & Watch !\n* Remappage de touches intégré\n* Possibilité de remapper les contrôles\n* Possibilité d'entrer et de charger des cheats\n* Support multilingue !\n* Plus de 80 programmes ('cœurs') pour l'instant et ça continue !\n* Jouez en multijoueur avec le jeu en réseau !\n* Prenez des captures d'écran, enregistrez des sauvegardes instantanées et plus encore !\n\n* Pas de DRM\n* Pas de restrictions d'utilisation\n* Open-source\n* Pas de publicités push\n* Pas d'espionnage\n* Pas de publicité, point\n\nRejoignez-nous sur discord pour le support et la recherche de joueurs en réseau\nhttps://discord.gg/C4amCeV\n\nVisitez notre chaîne Youtube ici pour des tutoriels, du gameplay, des nouvelles et la progression du développement !\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPour plus d'infos et d'aide, consultez notre site de documentation -\nhttps://docs.libretro.com/\n\nVisitez notre site web !\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Jeux rétro et émulateurs sur votre appareil !"
}
