{
   "main-desc": "A RetroArch egy nyílt forráskódú projekt, amely egy Libretro nevű, sokoldalú interface-t használ. A Libretro interface-szel többplatformos alkalmazások készíthetők, amelyek fejlett technológiákat használhatnak. mint az OpenGL, többplatformos kamera támogatás, helyzetmeghatározás, és még továbbiak.\n\nA RetroArch-hoz számos alkalmazás tartozik, amelyekkel egy helyről szerezhető be minden a szórakozáshoz.\n\nA Libretro és a RetroArch tökéletesen alkalmas játékok, emulátorok, és multimédia programok készítéséhez. Több információért látogasson el a lentebb található weboldalunkra.\n\nFIGYELEM!\n\nA RetroArch sokoldalú program, de ahhoz, hogy bármit is csináljon, további, \"mag\"-nak nevezett programmodulok szükségesek. Ezek nincsenek benne az eredeti letöltésben, hanem az alkalmazáson belül tölthetőek le, az Online Frissítő alatt, a Mag letöltése funkcióval.\n\nTULAJDONSÁGOK:\n* Többfajta szemrevaló menü\n* Játékkollekciók beolvasása a fájlrendszerből\n* Adatbázis információ minden, a kollekcióhoz hozzáadott játékról\n* Programok (magok) online letöltése\n* Minden komponens frissíthető\n* Exkluzív Game & Watch (kvarcjáték) emulátor és a hozzávaló játékok\n* Átállítható irányítás-kiosztás\n* Csalások beírása vagy betöltése\n* Számos nyelv támogatása\n* Több mint 80 és folyamatosan bővülő mag\n* Többjátékosos NetPlay mód\n* Képernyőképek, játékállás mentések, és a többi\n\n* Nincs DRM\n* Nincs megkötés a használatra\n* Nyílt forráskód\n* Nincsenek kéretlen reklámok\n* Nincs kémkedés\n* Nincs időközönkénti reklám\n\nCsatlakozz a Discord-on segítségért és netplay partnerekért:\nhttps://discord.gg/C4amCeV\n\nYoutube csatornáink, oktatóvideókkal, játékbemutatókkal, hírekkel, és fejlesztési fejleményekkel:\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nInformáció és segítség a dokumentációs oldalon:\nhttps://docs.libretro.com/\n\nWeboldalaink:\nhttps://www.retroarch.com/\nhttps://www.libretro.com/",
   "short-desc": "Retro játékok és emulátorok a készülékeden!"
}
