{
   "main-desc": "Το retroarch είναι ένα πρότζεκτ ανοιχτού κώδικα, το οποίο χρησιμοποιεί μια ισχυρή διεπαφή (interface) που ονομάζεται libretro. Το libretro είναι μια διεπαφή που σας επιτρέπει να φτιάξετε διαπλατφορμικες εφαρμογές (cross-platform applications), που μπορούν να χρησιμοποιήσουν χαρακτηριστικά όπως OpenGL, διαπλατφορμικη κάμερα (cross platform camera), υποστήριξη τοποθεσίας, και ακόμη περισσότερα στο μέλλον.\n\nΈρχεται με την δική του προκατασκευασμένη συλλογή εφαρμογών, έτσι ώστε να παρέχει ένα \"one-stop-shop\" για διασκέδαση.\n\nΤο Libretro και το Retroarch ταιριάζουν πλήρως για την δημιουργία παιχνιδιών, εξομοιωτών και προγραμμάτων πολυμέσων. Αν θέλετε να μάθετε περισσότερα επισκεφθείτε την ιστοσελίδα μας (βρίσκεται παρακάτω).\nΣΗΜΑΝΤΙΚΌ!\n\nΤο Retroarch είναι ένα πολυδιάστατο πρόγραμμα, πράγμα το οποίο σημαίνει πως για να κάνετε το οτιδήποτε, χρειάζεστε υποπρογράμματα που ονομάζονται \"πυρήνες\". Αυτοί οι πυρήνες δεν είναι έτοιμοι για χρήση. Πρέπει να μεταβειτε στον \"Διαδικτυακό Ενημερωτή->Ενημέρωση Πύρινα\" εντός της εφαρμογής για να τους κατεβάσετε.\n\nΧΑΡΑΚΤΗΡΙΣΤΙΚΆ\n*Μενού οπτικά ωραία για να επιλέξετε\n*Σκαναρισμα αρχείων/καταλόγων και προσθήκη τους σε συλλογές βιντεοκονσολων\n*Δείτε τις πληροφορίες της βάσης δεδομένων, για κάθε παιχνίδι που προσθέτετε στην συλλογή σας\n*Κατεβάστε προγράμματα (πυρήνες) διαδικτυακά\n*Ενημερώστε τα πάντα!\n*Κατεβάστε Game & Watch παιχνίδια και παίξτε τα με τον αποκλειστικό Game & Watch εξομοιωτή μας\n*Ενσωματωμένος επαναπρογραμματισμός πλήκτρων\n*Δυνατότητα επαναπρογραματισμου χειριστηρίων\n*Δυνατότητα προσθήκης και φόρτωσης κωδικών\n*Υποστήριξη πόλλων γλωσσών\n*Πάνω από 80+ πυρήνες, και ακόμα μετράμε\n*Παιχνίδι εναντίον άλλων παιχτών μέσω του NetPlay\n*Τραβήξτε φωτογραφίες και αποθηκευστε states και άλλα\n\n*Χωρίς DRM\n*Χωρίς περιορισμό χρήσης\n*Λογισμικό ανοιχτού κώδικα\n*Χωρίς προωθηση διαφημίσεων\n*Χωρίς κατασκοπεία\n*Χωρίς διαφημίσεις\n\nΕλάτε στο discord μας και υποστηριξτε το netplay\nhttps://discord.gg/C4amCeV\n\nΕπισκεφθείτε το κανάλι μας στο YouTube για εκπαιδευτικά βίντεο, gameplay βίντεο, νέα\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nΓια περισσότερες πληροφορίες δείτε την ιστοσελίδα με τα έγραφα μας\nhttps://docs.libretro.com/\n\nΕπισκεφθείτε την ιστοσελίδα μας\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Κλασικά παιχνίδια και εξομοιωτές στη συσκευή σου!"
}
