{
   "main-desc": "RetroArch je projekt s otvoreným zdrojovým kódom (OpenSource), ktorý využíva výkonné vývojové rozhranie s názvom Libretro. Libretro je rozhranie, ktoré umožňuje vytvárať aplikácie na viacerých platformách, ktoré môžu využívať bohaté funkcie, ako napríklad OpenGL, podporu kamier medzi rôznymi platformami, podporu určovania polohy a ďalšie.\n\nSoftvér prichádza s vlastnou vstavanou zbierkou aplikácií, aby vám poskytol všetko pre vašu zábavu.\n\nLibretro a RetroArch sa dokonale hodia na vytváranie hier, emulátorov a multimediálnych programov. Ak sa chcete dozvedieť viac, navštívte našu webovú stránku (uvedená nižšie).\nDÔLEŽITÉ!!!\n\nRetroArch je mnohoúčelový program, čo znamená, že na to, aby urobil čokoľvek, potrebujete modulové programy, ktoré nazývame 'jadrá', anglicky 'cores'. Tieto jadrá NIESU SÚČASŤOU BALÍČKU. V aplikácii musíte prejsť do ponuky 'Online Aktualizácie -> Aktualizácia Jadier', kde si ich môžete stiahnuť.\n\nVLASTNOSTI:\n* Vyberte si z rôznych nádherné štýlov užívateľského prostredia!\n* Skenujte súbory / adresáre a pridajte ich do kolekcií herných systémov!\n* Pozrite si informácie z databázy o každej hre po pridaní do kolekcie!\n* Sťahujte si programov ('jadier') online\n* Aktualizujte všetko!\n* Stiahnite si 'Game & Watch' hry a hrajte ich s naším exkluzívnym emulátorom 'Game & Watch'!\n* Zabudované mapovanie vstupu\n* Možnosť mapovania prvkov ovládania\n* Možnosť vložiť a načítať cheaty\n* Podpora rôznych jazykov!\n* Viac ako 80 programov ('jadier'), ktorých počet stále rastie!\n* Hrajte hry pre viacerých hráčov pomocou funkcie NetPlay!\n* Robte snímky obrazovky, uložte stavy a ďalšie!\n\n* Žiadne DRM\n* Žiadne obmedzenia používania\n* Open-source\n* Žiadne vyskakovacie reklamy\n* Žiadne sledovanie\n* Vždy bez reklám\n\nPridajte sa k nám na discorde, kde nájdete komunitnú podporu a hráčov pre online hranie cez funkciu 'NetPlay'\nhttps://discord.gg/C4amCeV\n\nNavštívte náš Youtube kanál, kde nájdete návody, ukážky, novinky a pokrok vo vývoji!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPre pomoc a viac informácií navštívte našu dokumentáciu -\nhttps://docs.libretro.com/\n\nNavštívte našu stránku!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Retro hry a emulátory na tvojom zariadení!"
}
