{
   "main-desc": "Retroarch ye un proyeutu de códigu abiertu qu'usa la interfaz de desendolcu Libretro. Libretro ye una interfaz potente que te permite crear aplicaciones multiplataforma que puen usar funciones arriquecíes como OpenGL, la compatibilidá de cámara multiplataforma y munches más nel futuru.\n\nVien cola so coleición integrada d'aplicaciones pa fornite un centru únicu d'entretenimientu.\n\nLibretro y RetroArch son afayadizos pa crear xuegos, emuladores y programes multimedia. Si quies saber más, vete al nuesu sitiu web (indícase abaxo).\n¡¡¡IMPORTANTE!!!\n\nRetroArch ye un programa polivalente, ye dicir, que pa que faiga daqué, precises módulos que llamaos «nucleos». Estos nucleos NUN S'INCLÚIN DE SERIE, tienes de dir a «Anovador -> Anovador de Nucleos» dientro de l'aplicación pa baxalos.\n\nFUNCIONES:\n* Una seleición de menús guapos\n* Busca de ficheros/direutorios p'amestalos a les coleiciones de los sistemes de xuegu\n* Visualización de la información de les bases de datos de cada xuegu namás que los amiestes a una coleición\n* Descarga de programes (nucleos) en llinia\n* Anovamientu de tol conteníu\n* Descarga de xuegos Game & Watch pa que los xuegues nel nuesu emulador de Game & Watch esclusivu\n* Remapéu de la entrada integráu\n* Capacidá pa remapiar los controles\n* Capacidá d'introducir y cargar trampes\n* Compatibilidá con munches llingües\n* Más de 80 programes, ¡y caldía más!\n* Partíes multixugador col xuegu en llinia\n* Puntos de guardáu\n* Y muncho más\n\n* Ensin DRM\n* Ensin restricciones d'usu\n* De códigu abiertu\n* Ensin anuncios\n* Ensin spyware\n\nXúnite al sirvidor de Discord pa consiguir sofitu y empareyamientos pal xuegu en llinia (n'inglés)\nhttps://discord.gg/C4amCeV\n\nVisita la nuesa canal de Youtube pa ver tutoriales, partíes, noticies y cómo progresa'l desendolcu (n'inglés)\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPa consiguir más información y ayuda, consulta'l sitiu de la documentación (n'inglés)\nhttps://docs.libretro.com/\n\n¡Visita'l sitiu web! (n'inglés)\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "¡Xuegos retro y emuladores nel to preséu!"
}
