{
   "main-desc": "O RetroArch é um projeto de código aberto que utiliza uma poderosa interface de desenvolvimento chamada Libretro. A Libretro é uma interface que permite criar aplicações multiplataforma que podem utilizar funcionalidades avançadas como o OpenGL, suporte de câmara multiplataforma, suporte de localização e muito mais no futuro.\n\nInclui a sua própria coleção de aplicações para lhe proporcionar um 'one-stop-shop' de entretenimento.\n\nO Libretro e o RetroArch são perfeitamente adequados para a criação de jogos, emuladores e programas multimédia. Se quiser saber mais, vá ao nosso site (listado abaixo).\nIMPORTANTE!!!\n\nO RetroArch é um programa multi-versátil, o que significa que para que ele faça qualquer coisa, é necessário programas modulares que chamamos de 'núcleos'. Estes núcleos NÃO SAEM DA CAIXA. É necessário ir a \"Atualizador online -> Atualizador do núcleo\" a partir da aplicação para os transferir.\n\nCARACTERÍSTICAS:\n* Menus atraentes para escolher!\n* Digitalize ficheiros/pastas e adicione-os a coleções de sistemas de jogos!\n* Ver informações da base de dados sobre cada jogo adicionado a uma coleção!\n* Transferir programas ('núcleos') online\n* Atualizar tudo!\n* Transferir jogos Game & Watch e jogá-los com o nosso emulador Game & Watch exclusivo!\n* Remapeamento de entradas integrado\n* Capacidade de remapear controlos\n* Capacidade de introduzir e carregar batotas (cheats)\n* Suporte a vários idiomas!\n* Mais de 80+ programas ('núcleos') agora e contando!\n* Jogue com vários jogadores com o NetPlay!\n* Tirar capturas de ecrã, guardar estados e muito mais!\n\n* Sem DRM\n* Sem restrições de utilização\n* Código aberto\n* Sem anúncios push\n* Sem espionagem\n* Sem anúncios durante o período\n\nJunte-se a nós no discord para obter suporte e criar partidas de netplay\nhttps://discord. g/C4amCeV\n\nVisite nosso canal no Youtube aqui para tutoriais, jogos, notícias e progresso do desenvolvimento!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOficial\n\nPara informações e ajuda, consulte o nosso site de documentação -https://docs.libretro.com/\n\nVisite o nosso site!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Jogos e emuladores Retro no seu dispositivo!"
}
