{
   "main-desc": "RetroArch je open-source projekt, který využívá výkonné vývojové rozhraní Libretro. Libretro je rozhraní, které umožňuje vytvářet multiplatformní aplikace, které mohou využívat bohaté funkce, jako je OpenGL, multiplatformní podpora kamer, podpora polohy a v budoucnu i další.\n\nJe vybaveno vlastní vestavěnou sbírkou aplikací, která vám poskytne \"komplexní služby\" pro zábavu.\n\nLibretro a RetroArch se dokonale hodí k vytváření her, emulátorů a multimediálních programů. Pokud se chcete dozvědět více, přejděte na naše webové stránky (uvedené níže).\nDŮLEŽITÉ!!!\n\nRetroArch je víceúčelový program, to znamená, že k tomu, aby mohl něco dělat, potřebujete modulární programy, kterým říkáme \"jádra\". Tato jádra NEJSOU VYLOŽENA Z OBALU. Abyste si je mohli stáhnout, musíte v aplikaci přejít na \"Online Updater -> Core Updater\".\n\nFUNKCE:\n* Nabídky pro oči, ze kterých si můžete vybírat!\n* Skenování souborů / adresářů a jejich přidávání do sbírek herního systému!\n* Zobrazení informací z databáze o každé hře po přidání do kolekce!\n* Stahování programů (\"jader\") online\n* Aktualizace všeho!\n* Stahujte hry Game & Watch a hrajte je pomocí našeho exkluzivního emulátoru Game & Watch!\n* Vestavěné přemapování vstupů\n* Možnost přemapování ovládacích prvků\n* Možnost zadávat a načítat cheaty\n* Podpora více jazyků!\n* Více než 80+ programů (\"jader\") nyní a stále přibývají!\n* Hrajte ve více hráčích pomocí NetPlay!\n* Pořizování snímků obrazovky, ukládání stavů a další!\n\n* Žádné DRM\n* Žádná omezení používání\n* Open-source\n* Žádné reklamy\n* Žádné špehování\n* Žádné reklamy\n\nPřipojte se k nám na discordu pro podporu a netplay matchmaking\nhttps://discord.gg/C4amCeV\n\nNavštivte náš Youtube kanál zde pro návody, gameplaye, novinky a pokrok ve vývoji!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nInformace a nápovědu najdete na našich stránkách s dokumentací -\nhttps://docs.libretro.com/\n\nNavštivte naše webové stránky!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Retro hry a emulátory na vašem zařízení!"
}
