{
   "main-desc": "RetroArch - це проєкт з відкритим кодом, який використовує потужний інтерфейс розробки Libretro. Libretro — це інтерфейс, який дозволяє робити кросплатформні застосунки з різними особливостями, такими як OpenGL, кросплатформна підтримка камери, підтримка розташування і багато інших у майбутньому.\n\nRetroArch одразу містить певний набір власних застосунків, щоб ви могли почати розважатися без додаткових зусиль.\n\nLibretro та RetroArch ідеально підходить для створення ігор, емуляторів та мультимедійних програм. Якщо ви хочете дізнатися більше, перейдіть на наш сайт (подано нижче).\nВАЖЛИВО!!!\n\nRetroArch — це гнучка програма, тобто для того щоб робити що-небудь, вам потрібні модульні програми, які ми називаємо ядрами. Ці ядра НЕ ПОСТАЧАЮТЬСЯ З КОРОБКИ. Вам необхідно перейти в меню \"Online Updater -> Core Updater\" («Оновлення з мережі -> Завантажити ядро») у програмі, щоб завантажити їх.\n\nОСОБЛИВОСТІ:\n* Оковирні меню на вибір!\n* Сканування файлів / каталогів для створення колекцій до ігрових систем!\n* Перегляд інформації про кожну гру після додавання до колекції!\n* Завантаження програм (ядер) з мережі\n* Можливість оновлення всіх компонентів!\n* Завантаження ігор Game & Watch для гри на нашому ексклюзивному емуляторі Game & Watch!\n* Вбудоване перепризначення керування\n* Можливість перепризначати керування\n* Можливість введення та завантаження кодів\n* Підтримка багатьох мов!\n* Більше 80 програм (ядер) і їхня кількість збільшується!\n* Гра з друзями за допомогою мережевої гри (NetPlay)!\n* Можливість робити знімки екрана, зберігайте стан гри та багато іншого!\n\n* Без DRM\n* Жодних обмежень на використання\n* Відкритий код\n* Без реклами\n* Без шпигунства\n* Без рекламного періоду\n\nПриєднуйтеся до нас у Discord для підтримки або організації мережевих ігор.\nhttps://discord.gg/C4amCeV\n\nВідвідайте наш канал на Youtube, щоб переглянути навчальні посібники, ігроладні відео, новини та оновлення розробки!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nІнформацію та допомогу дивіться на нашому сайті документації.\nhttps://docs.libretro.com/\n\nВідвідайте наш сайт!\nhttps://www.retroarch.com/\n\nwww.libretrotro.com",
   "short-desc": "Ретро-ігри та емулятори на вашому пристрої!"
}
