{
   "main-desc": "RetroArch, Libretro adlı güçlü bir geliştirme arayüzünü kullanan açık kaynaklı bir projedir. Libretro, gelecekte OpenGL, platformlar arası kamera desteği, konum desteği ve daha fazlası gibi zengin özellikleri kullanabilen platformlar arası uygulamalar yapmanızı sağlayan bir arabirimidir.\n\nEğlence için 'herşeyi-tek-yerden-alma' sağlamak için kendi yerleşik uygulama koleksiyonu ile birlikte gelir.\n\nLibretro ve RetroArch, oyunlar, emülatörler ve multimedya programları oluşturmak için mükemmel bir şekilde uygundur. Daha fazla bilgi edinmek istiyorsanız, web sitemizi ziyaret edin (bağlantılar aşağıda listelenmiştir).\nÖNEMLİ!!!\n\nRetroArch çok yönlü bir programdır, yani herhangi bir şey yapabilmesi için 'çekirdek' dediğimiz modüler programlara ihtiyacınız vardır. Bu çekirdekler ilk etapta DAHİL DEĞİLDİR. İndirmek için uygulama içinden \"Çevrimiçi Güncelleyici -> Çekirdek Güncelleyici\" ye gitmeniz gerekir.\n\nÖZELLİKLERİ:\n* Kendinizin seçebileceği göze hitap eden menüler!\n* Dosyaları / dizinleri taratın ve oyun sistemi koleksiyonlarına ekletin!\n* Bir koleksiyona eklendiğinde her oyun hakkında veritabanı bilgilerini görüntüleyin!\n* Programları ('çekirdekler') çevrimiçi indirin\n* Her şeyi güncelleyin!\n* Game & Watch oyunlarını indirin ve özel Game & Watch emülatörümüzle oynayın!\n* Oyun kolu düğmeleri yeniden eşleştirme\n* Kontrolleri yeniden eşleme özelliği\n* Hileleri girme ve yükleme özelliği\n* Çoklu dil desteği!\n* Şu an 80'den fazla program ('çekirdek') mevcut ve her geçen gün yenisi ekleniyor!\n* NetPlay (ağ üzerinden oyna) ile çok oyunculu oyna!\n* Ekran görüntüleri alın, oyun anlarını ve daha fazlasını kaydedin!\n\n* DRM yok\n* Kullanım kısıtlaması yok\n* Açık kaynak\n* Reklam yok\n* Casusluk yok\n* Reklam bölümleri yok\n\nDestek ve ağ üzerinden oyun eşleştirme için Discord sunucumuzda bize katılın\nhttps://discord.gg/C4amCeV\n\nKılavuzlar, oynanışlar, haberler ve yazılım ilerlemesi için Youtube kanalımızı ziyaret edin!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nBilgi ve yardım için dokümantasyon sitemize bakın -\nhttps://docs.libretro.com/\n\nİnternet sitemizi ziyaret edin!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Cihazınızdaki retro oyunlar ve emülatörler!"
}
