{
   "main-desc": "RetroArch é um projeto de código aberto que faz uso de uma poderosa interface de desenvolvimento chamada Libretro. O Libretro é uma interface que permite que você faça aplicativos multiplataforma que podem usar recursos ricos como OpenGL, Suporte a câmeras multiplataformas, suporte a localização e muito mais no futuro.\n\nEle vem com sua própria coleção de aplicativos para fornecer a você uma 'one-stop-shop' para entretenimento.\n\nLibretro e RetroArch são perfeitamente adequados para criar jogos, emuladores e programas multimídia. Se você quiser saber mais, acesse nosso site (listado abaixo).\nIMPORTANTE!!!\n\nRetroArch é um programa multiversátil, isso significa que, para que ele faça qualquer coisa, você precisa de programas modulares que chamamos de \"núcleos\". Esses núcleos não vêm com o app. Você precisa ir para \"Atualizador online -> Atualizador de núcleos\" de dentro do aplicativo para baixá-los.\n\nCARACTERÍSTICAS:\n* Menus Doces para escolher!\n* Escaneie arquivos / diretórios e adicione-os às coleções do sistema do jogo!\n* Ver informações do banco de dados sobre cada jogo adicionado a uma coleção!\n* Baixar programas ('núcleos') online\n* Atualizar tudo!\n* Baixe jogos 'Game & Watch' e jogue-os com o nosso emulador exclusivo para jogos Game & Watch!\n* remapear controlos de entrada integrada na app\n* Capacidade de remapear controles\n* Capacidade de entrar e carregar cheats\n* Suporte a Multi-Idioma!\n* mais de 80 programas ('núcleos') agora e contando!\n* Jogue multiplayer com NetPlay!\n* Faça capturas de tela, salve estados e muito mais!\n\n* Sem DRM\n* Sem restrições no uso\n* de código aberto\n* Sem anúncios\n* Sem anúncios de espionagem\n* Sem período de anúncios\n\nJunte-se a nós no Discord para suporte e correspondência netplay\nhttps://discord. g/C4amCeV\n\nVisite nosso canal do Youtube aqui para ver tutoriais, jogos, notícias e progresso de desenvolvimento!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOficial\n\nPara obter informações e ajuda, consulte nosso site de documentação -\nhttps://docs.libretro.com/\n\nVisite nosso site!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Jogos e emuladores Retro no seu dispositivo!"
}
