{
   "main-desc": "RetroArch is een open-source project dat gebruik maakt van een krachtige ontwikkelingsinterface genaamd Libretro. Libretro is een interface waarmee u cross-platform applicaties kunt maken die rijke functies kunnen gebruiken zoals OpenGL, ondersteuning van platformoverschrijdende camera's, locatieondersteuning en in de toekomst meer.\n\nHet komt met zijn eigen ingebouwde collectie van toepassingen om je een 'one-stop-shop' voor entertainment te bieden.\n\nLibretro en RetroArch zijn perfect geschikt voor het maken van spellen, emulators en multimedia programma's. Als je meer wilt weten, ga dan naar onze website (hieronder opgenomen).\nBELANGRIJK!!!\n\nRetroArch is een veelzijdig programma, dat betekent dat om alles te kunnen doen, modulaire programma's nodig zijn die we 'cores' noemen. Deze cores KOMEN NIET OVEREEN VAN DE BOX. U moet naar \"Online Updater -> Core Updater\" gaan vanuit de app om ze te downloaden.\n\nFUNCTIE:\n* Oog-zoete menu's om uit te kiezen!\n* Scan bestanden / mappen en voeg ze toe aan spel systeem collecties!\n* Bekijk de database informatie over elk spel dat is toegevoegd aan een collectie!\n* Download programma's ('cores') online\n* Werk alles bij!\n* Download Game & Watch games en speel ze met onze exclusieve Game & Watch emulator!\n* Ingebouwde invoer remapping\n* Mogelijkheid om opnieuw toe te wijzen\n* Mogelijkheid om cheats te openen\n* meertalige ondersteuning!\n* Meer dan 80+ programma's ('cores') nu en tellen!\n* Speel multiplayer met NetPlay!\n* Neem screenshots, sla staten en meer!\n\n* Geen DRM\n* Geen beperkingen voor gebruik\n* Open-source\n* Geen push-advertenties\n* Geen spionage\n* Geen advertentieperiode\n\nJoin ons op discord voor ondersteuning en net-play matchmaking\nhttps://discord.gg/C4amCeV\n\nBezoek ons Youtube kanaal hier voor tutorials, gameplays, nieuws en ontwikkeling voortgang!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nVoor info en hulp, zie onze documentatiesite -\nhttps://docs.libretro.com/\n\nBezoek onze website!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Retro spellen en emulators op uw apparaat!"
}
