{
   "main-desc": "RetroArch és un projecte de codi obert que fa servir una potent interfície de desenvolupament anomenada Libretro. Libretro és una interfície que permet crear aplicacions per diferents sistemes i pot fer ús de funcionalitats com OpenGL, suport per a càmera, localització i més funcionalitats en el futur.\n\nEs proveeix amb una col·lecció d'aplicacions integrada per oferir un centre d'entreteniment únic.\n\nLibretro i RetroArch son aptes per crear jocs, emuladors i aplicacions multimèdia. Si vols més informació, visita la nostra pàgina web (més avall). IMPORTANT!!!\n\nRetroArch és un programa modular, això significa que per poder fer qualsevol cosa, necessita programes modulars anomenats nuclis. Aquests nuclis no venen inclosos amb RetroArch. Has de clicar a Actulitzador en línie -> Actualitzador dels nuclis dins de l'aplicació per a descarregar-los.\n\nCARACTERÍSTIQUES:\n* Menús elegants on escollir!\n* Cerca fitxers o carpetes i afegeix-los per coleccions de sistemes de videojcs!\n* Accedeix a la informació de cada joc a la base de dades quan l'hagis afegit a una col·lecció!\n* Descarrega els nuclis a travès d'Internet.\n* Manten-te sempre actualitzat!\n* Descarrega jocs de Game & Watch i disfruta'ls en l'emulador exclusiu de Game & Watch!\n* Reassignació de botons integrada\n* Reconfiguració dels controladors\n* Ús de trucs\n* Suport per varis idiomes\n* Actualment hi ha més de 80 nuclis i estant augmentant!\n* Partides multijugador en xarxa!\n* Captures de pantalla, desats ràpids i molt més!\n\n* Sense DRM\n* Sense restriccions d'ús\n* Software lliure\n* Sense anuncis forçats\n* Sense espionatge\n* Sense anuncis!\n\nUneix-te a nosaltres en el canal de Discord per rebre suport tècnic i per trobar partides de joc en xarxa: https://discord.gg/C4amCeV\n\nVisita el nostre canal de YouTube per veure tutorials, captures de joc, notícies i assoliments en el desenvolupament! https://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPer més informació, visita la nostra pàgina web de documentació (només en anglès) https://docs.libretro.com/\n\nVista la nostra pàgina web! https://www.retroarch.com/\nwww.libretro.com",
   "short-desc": "Videojocs retro i emuladors al teu dispositiu!"
}
