{
   "main-desc": "RetroArch adalah proyek sumber terbuka yang memanfaatkan antarmuka pengembangan kuat yaitu Libretro. Libretro adalah antarmuka yang dapat membuat aplikasi lintas pelantar menggunakan fitur apik seperti OpenGL, kamera lintas pelantar, dukungan lokasi, dan masih banyak lagi ke depannya.\n\nSekaligus hadir dengan kumpulan aplikasi tertanam sebagai hiburan rasa 'serba ada' untuk Anda.\n\nLibretro dan RetroArch sangat cocok untuk membuat permainan, emulator, dan program multimedia. Untuk info lebih lanjut, kunjungi situs kami (tertera di bawah).\nPENTING!!!\n\nRetroArch adalah program emulator permainan serba guna, maka dari itu perlu program modular yang kami sebut 'core'. 'Core' ini TIDAK DISEDIAKAN SEKEMAS. Harus masuk dulu ke \"Pembaruan Daring -> Pembaruan Core\" pada aplikasi untuk mengunduhnya.\n\nFITUR:\n* Tampilan antarmuka cantik yang dapat dipilih sesuka hati!\n* Memindai berkas permaina dan menambahkannya ke koleksi sistem!\n* Dapat melihat informasi tentang permainan yang telah dipindai!\n* Unduh program ('core') secara daring\n* Perbarui segalanya!\n* Unduh permainan Game & Watch dan mainkan dengan emulator Game & Watch eksklusif kami!\n* Pemetaan Masukan tertanam\n* Pemetaan ulang kendali\n* Memuat dan menerapkan cheat\n* Dukungan banyak bahasa!\n* Lebih dari 80 program ('core') dan terus bertambah!\n* Bermain dengan pemain lain melalui NetPlay!\n* Menangkap layar, 'save state', dan masih banyak lagi!\n\n* Bebas dari DRM\n* Tidak ada batasan penggunaan\n* Sumber terbuka\n* Bebas iklan\n* Bebas dari pengintai\n* Bebas jeda iklan\n\nBergabung dengan kami di Discord untuk dukungan dan netplay\nhttps://discord.gg/C4amCeV\n\nKunjungi saluran Youtube kami untuk tutorial, jalan main, berita, dan progres pengembangan\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nUntuk informasi dan bantuan, rujuk ke situs dokumentasi\nhttps://docs.libretro.com/\n\nKunjungi situs kami\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Permainan retro dan emulator dalam satu perangkat!"
}
