{
   "main-desc": "RetroArch là một dự án mã nguồn mở sử dụng một giao diện phát triển mạnh mẽ được gọi là Libretro. Libretro là một giao diện cho phép bạn sử dụng các ứng dụng đa nền tảng với các tính năng phong phú như OpenGL, hỗ trợ camera đa nền tảng, hỗ trợ vị trí, và nhiều hơn nữa trong tương lai.\n\nNó đi kèm với các công cụ tích hợp trong bộ sưu tập của các ứng dụng, cung cấp cho bạn một 'ứng dụng đa năng' để giải trí.\n\nLibretro và RetroArch hoàn toàn phù hợp để chơi trò chơi, giả lập và phát các chương trình đa phương tiện. Nếu bạn muốn tìm hiểu thêm, hãy vào trang web của chúng tôi (được liệt kê dưới đây).\nQUAN TRỌNG!!!\n\nRetroArch là một chương trình đa năng, điều đó có nghĩa rằng để cho nó để làm bất cứ điều gì, bạn cần chương trình mô-đun mà chúng ta gọi là 'core'. Những core KHÔNG CÓ SẴN. Bạn cần phải đến \"Online Updater -> Core Updater\" bên trong ứng dụng để tải chúng.\n\nTÍNH NĂNG, ĐẶC ĐIỂM:\n* Nhiều loại menu để lựa chọn!\n* Quét các File / thư mục và thêm chúng vào bộ sưu tập hệ thống!\n* Xem thông tin cơ sở dữ liệu về mỗi trò chơi một khi chúng được thêm vào bộ sưu tập!\n* Tải chương trình ( 'core') trực tuyến\n* Cập nhật tất cả mọi thứ!\n* Tải Game & Watch và chơi chúng với giả lập Game & Watch độc quyền của chúng tôi!\n* Thay đổi cài đặt đầu vào\n* Khả năng kiểm soát các thay đổi.\n* Khả năng dùng và tải cheats\n* Hỗ trợ đa ngôn ngữ!\n* Hơn 80 + chương trình ( 'core') bây giờ và thêm nữa!\n* Chơi với nhiều người chơi khác ở NetPlay!\n* Chụp ảnh màn hình, lưu trạng thái và nhiều hơn nữa!\n\n* Không có DRM\n* Không hạn chế sử dụng\n* Mã nguồn mở\n* Không quảng cáo\n* Không theo dõi\n\nTham gia với chúng tôi trên discord để ủng hộ và kiếm đồng đội chơi chung\nhttps://discord.gg/C4amCeV\n\nGhé thăm kênh Youtube của chúng tôi để xem hướng dẫn, gameplays, tin tức và tiến trình phát triển!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nĐể biết thêm thông tin và sự giúp đỡ, hãy xem trang tài liệu của chúng tôi -\nhttps://docs.libretro.com/\n\nTruy cập trang web của chúng tôi!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Các trò chơi retro và giả lập trên thiết bị của bạn!"
}
