{
   "main-desc": "RetroArch merupakan proyek sumber-terbuka yang menggunakan antarmuka pengembangan kuat bernama Libretro. Libretro adalah antarmuka di mana Anda dapat membuat aplikasi lintas platform yang dapat menggunakan fitur terbaik seperti OpenGL, dukungan kamera lintas platform, dukungan lokasi, dan masih banyak lagi di masa mendatang.\n\nAplikasi ini hadir dengan kumpulan aplikasi bawaan tersendiri untuk memberikan Anda hiburan 'satu-tempat-toserba'.\n\nLibretro dan RetroArch sanggatlah cocok untuk membuat gim, emulator dan program multimedia. Jika Anda ingin mengetahui lebih lanjut, silakan kunjungi situs web kami (tertera di bawah).\nPENTING!!!\n\nRetroArch merupakan program emulator gim serbaguna, dan untuk menjalankannya diperlukan program modular yang kami sebut \"inti\". Inti-inti ini TIDAK DISEDIAKAN SECARA TERPISAH. Anda harus memasangnya di \"Pembaruan Daring -> Pembaruan Inti\" dari aplikasi untuk mengunduhnya.\n\nFITUR\n* Tampilan antarmuka yang cantik yang dapat dipilih sesuka hati!\n* Memindai koleksi gim Anda dan menambahkannya ke daftar koleksi sistem!\n* Dapat melihat informasi tentang suatu gim yang telah dipindai!\n* Unduh program ('inti') secara daring\n* Perbarui segalanya!\n* Unduh permainan Game & Watch dan mainkan gim tersebut dengan emulator Game & Watch eksklusif kami!\n* Dilengkapi Mapping Input bawaan\n* Kemampuan untuk mapping ulang kontroler\n* Kemampuan untuk memuat dan menerapkan cheat\n* Dukungan multi bahasa!\n* Lebih dari 80 program ('inti') tersedia dan terus bertambah!\n* Bermain dengan pemain lain lewat fitur NetPlay!\n* Screenshot, menyimpan save state, dan masih banyak lagi!\n\n* Bebas dari DRM\n* Tidak ada batasan dalam penggunaan\n* Sumber-terbuka\n* Bebas iklan\n* Bebas dari pengintai dan mata-mata\n* Bebas jeda iklan\n\nBergabunglah dengan kami di kanal discord untuk dukungan dan bermain dengan pemain lain\nhttps://discord.gg/C4amCeV\n\nKunjungi kanal Youtube kami untuk lebih tahu tentang tutorial, gameplay, berita, dan perkembangan pengembangan terbaru kami\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nUntuk informasi lebih lanjut mengenai panduan dan dokumentasi, kunjungi\nhttps://docs.libretro.com/\n\nKunjungi situs kami\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Game Retro dan emulator dalam satu perangkat!"
}
