{
   "main-desc": "RetroArch è un progetto open-source che si avvale di una potente interfaccia di sviluppo chiamata Libretro. Libretro è un'interfaccia che consente di realizzare applicazioni multi-piattaforma che possono utilizzare funzioni ricche come OpenGL, supporto multipiattaforma alla telecamera, supporto alla posizione e molto altro in futuro.\n\nViene fornito con una raccolta di applicazioni integrate, così da poter essere un 'punto d'accesso unico' per l'intrattenimento.\n\nLibretro e RetroArch sono perfettamente adatti per la creazione di giochi, emulatori e programmi multimediali. Se vuoi saperne di più, vai al nostro sito web (riportato di seguito).\nIMPORTANTE!!!\n\nRetroArch è un programma multi-versatile, il che significa che per fare qualsiasi cosa, hai bisogno di programmi modulari che chiamiamo 'core'. Questi core NON SONO INCLUSI APPENA INSTALLATE L'APP. È necessario andare su \"Aggiorna online -> Aggiorna Core\" dall'interno dell'app per scaricarli.\n\nCARATTERISTICHE:\n* Vari e gradevoli menu tra cui scegliere!\n* Scansiona file / cartelle e aggiungile alle collezioni per ciascuna console o sistema di gioco!\n* Visualizza le informazioni del database su ogni gioco una volta aggiunto ad una collezione!\n* Scarica programmi ('core') online\n* Aggiorna tutto!\n* Scarica giochi Game & Watch e gioca con il nostro esclusivo emulatore Game & Watch!\n* Rimappatura input integrata\n* Possibilità di rimappare i controlli\n* Possibilità di immettere e caricare trucchi\n* Supporto multi-lingua!\n* Oltre 80 programmi ('core') e molti altri!\n* Gioca in multigiocatore con NetPlay!\n* Fai screenshot, salva lo stato di gioco e altro ancora!\n\n* Nessun DRM\n* Nessuna restrizione di utilizzo\n* Open-source\n* Nessuna pubblicità invadente\n* Nessuno spionaggio\n* Nessuna pubblicità, punto e basta\n\nUnisciti a noi su Discord per supporto tecnico e per giocare insieme in netplay\nhttps://discord.gg/C4amCeV\n\nVisita i nostri canali Youtube qui di seguito per tutorial, gameplay, news e progressi sullo sviluppo!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPer informazioni e aiuto, consulta la nostra documentazione sul sito:\nhttps://docs.libretro.com/\n\nVisita il nostro sito web!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Giochi retrò ed emulatori sul tuo dispositivo!"
}
