{
   "main-desc": "RetroArch es un proyecto de código abierto que utiliza una potente interfaz de desarrollo llamada Libretro. Libretro permite crear aplicaciones multiplataforma capaces de utilizar características como OpenGL, cámaras multiplataforma, ubicación, y mucho más en el futuro.\n\nRetroArch incluye una colección integrada de aplicaciones para ofrecerte un centro único de entretenimiento.\n\nLibretro y RetroArch son aptos para crear juegos, emuladores y aplicaciones multimedia. Si quieres saber más, visita nuestra página web (más abajo).\n¡¡¡IMPORTANTE!!!\n\nRetroArch es un programa multiversátil, lo que significa que para poder hacer algo, necesita programas modulares a los que llamamos «núcleos». Estos núcleos NO VIENEN INCLUIDOS DE SERIE. Debes ir a Actualizador en línea -> Actualizador de núcleos dentro de la aplicación para descargarlos.\n\nCARACTERÍSTICAS:\n* ¡Varios menús elegantes a elegir!\n* ¡Busca archivos o carpetas y agrégalos por colecciones de sistemas de videojuegos!\n* ¡Accede a la información de cada juego en la base de datos cuando lo hayas añadido a una colección!\n* Descarga los programas («núcleos») a través de Internet\n* ¡Mantén todo actualizado!\n* ¡Descarga juegos de Game & Watch y disfruta de ellos con nuestro emulador exclusivo de Game & Watch!\n* Reasignación de entrada integrada\n* Reconfiguración de controles\n* Uso de trucos\n* ¡Soporte multiidioma!\n* ¡Actualmente hay más de 80 programas («núcleos»), y cada vez son más!\n* ¡Partidas multijugador en red!\n* ¡Haz capturas de pantalla, usa guardados rápidos, y mucho más!\n\n* Sin DRM\n* Sin restricciones de uso\n* Código abierto\n* Sin anuncios forzados\n* Sin espionaje alguno\n* Sin anuncios. Punto.\n\nÚnete a nosotros en Discord para recibir soporte técnico y para encontrar partidas de juego en red:\nhttps://discord.gg/C4amCeV\n\n¡Visita nuestro canal de YouTube para ver tutoriales, gameplays, noticias y los avances del desarrollo!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPara más información, visita nuestra web de documentación (solo en inglés):\nhttps://docs.libretro.com/\n\n¡Visita nuestra página web!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "¡Juegos retrunos y emuladores en tu dispositivo!"
}
