{
   "main-desc": "RetroArch je projekt s otvoreným zdrojom (OpenSource), ktorý využíva výkonné vývojové rozhranie s názvom Libretro. Libretro je rozhranie, ktoré vám umožňuje vytvárať aplikácie na viacerých platformách, ktoré môžu v budúcnosti využívať bohaté funkcie, ako napríklad OpenGL, podporu medzi rôznymi platformami kamier, podporu určovania polohy a ďalšie.\n\nSoftvér prichádza s vlastnou vstavanou zbierkou aplikácií, aby vám poskytol 'one-stop-shop', kde nájdete všetko pre vašu zábavu.\n\nLibretro a RetroArch sa dokonale hodia na vytváranie hier, emulátorov a multimediálnych programov. Ak sa chcete dozvedieť viac, navštívte našu webovú stránku (uvedená nižšie).\nDÔLEŽITÉ!!!\n\nRetroArch je 'multi-versatile' program, čo znamená, že na to, aby urobil čokoľvek, potrebujete modulové programy, ktoré nazývame 'jadrá', anglicky 'cores'. Tieto jadrá NIESU SÚČASŤOU BALÍČKU. Ak ich chcete stiahnuť, musíte prejsť do aplikácie 'Online Aktualizácie -> Aktualizácia Jadier' ktoré následne stiahnete do aplikácie.\n\nVLASTNOSTI:\n* Plno rozmanitých tém z ktorých si možete vyberať!\n* Skenujte súbory / adresáre a pridajte ich do kolekcií herných systémov!\n* Zobraziť informácie z databáze o každej hre po pridaní do kolekcie!\n* Sťahovanie si programov ('jadier') online\n* Aktualizujte všetko!\n* Stiahnite si 'Game & Watch' hry a hrajte ich s naším exkluzívnym emulátorom 'Game & Watch emulator'!\n *Zabudované premapovanie vstupu\n* Možnosť remapovania ovládacích prvkov\n* Možnosť vložiť a načítať cheaty\n* Multi jazyčná podpora\n* Viac ako 80 programov ('jadier') a stále pribúda!\n* Hrajte multiplayer s NetPlay!\n* Robte snímky obrazovky, uložte stavy a ďalšie!\n\n* Žiadne DRM\n* Žiadne obmedzenia pri používaní\n* Open-source\n* Žiadne vyskakovacie reklamy\n* Žiadne sledovanie\n* Vždy bez reklám\n\nPridajte sa k nám na discorde kde nájdete komunitnú podporu a hráčov online hrania prostrednítvom 'netplay'\nhttps://discord.gg/C4amCeV\n\nNavštívte náš Youtube kanál kde nájdete návody, gameplaye, novinky a pokrok v rozvoji!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nPre pomoc a info, navštívte našu dokumentačnú stránku -\nhttps://docs.libretro.com/\n\nVisit our website!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Retro hry a emulátory na tvojom zariadení!"
}
