{
   "main-desc": "RetroArch - це проєкт з відкритим вихідним кодом, який використовує потужний інтерфейс розробки Libretro. Libretro - це інтерфейс, який дозволяє робити крос-платформові додатки з різними функціями, наприклад OpenGL, рос-платформенна підтримка камери, підтримки визначення місцезнаходження і багато іншого в майбутньому.\n\nRetroArch постачається зі своєю власною вбудованою колекцією додатків для розваг за допомогою 'one-stop-shop'.\n\nLibretro та RetroArch ідеально підходить для створення ігор, емуляторів та мультимедійних програм. Якщо ви хочете дізнатися більше, перейдіть на наш сайт (перераховано нижче).\nВАЖЛИВО!!!\n\nRetroArch - це гнучка програма, тобто для того щоб робити що-небудь, вам потрібні модульні програми, які ми називаємо ядрами. Ці ядра НЕ ПОСТАЧАЮТЬСЯ З КОРОБКИ. Вам необхідно перейти в меню до \"Online Updater -> Core Updater\" (\"Онлайн оновлення -> Оновлювач ядер\") з програми, щоб завантажити їх.\n\nФУНКЦІ:\n* Гарні меню, щоб вибрати!\n* Скануйте файли/каталоги і додавайте їх до ігрових колекцій системи!\n* Переглядайте інформацію про кожну гру після додавання до колекції!\n* Завантажуйте програми (ядра) онлайн\n* Оновлюйте все!\n* Завантажуйте ігри Game & Watch та грайте в них в нашому ексклюзивному емуляторі Game & Watch!\n* Вбудоване перепризначення вводу\n* Можливість перепризначати управління\n* Можливість введення та завантаження чітів\n* Підтримка багатьох мов!\n* Більше 80 програм (ядер) зараз і їх кількість збільшується!\n* Грайте з друзями за допомогою мережевої гри (NetPlay)!\n* Робіть знімки екрана, зберігайте стан гри та багато іншого!\n\n* Немає DRM\n* Жодних обмежень на використання\n* Вікдритий код\n* Відсутня реклама\n* Без шпигунства\n* Немає рекламного періоду\n\nПриєднуйтеся до нас через дискорд для підтримки та організації матчів\nhttps://discord.gg/C4amCeV\n\nВідвідайте наш канал Youtube тут, щоб ознайомитись з навчальними посібниками, ігровими програмами, новинами та прогресом розвитку!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nІнформацію та допомогу див. на сайті нашої документації -\nhttps://docs.libretro.com/\n\nВідвідайте наш сайт!\nhttps://www.retroarch.com/\n\nwww.libretrotro.com",
   "short-desc": "Ретро ігри та емулятори на вашому пристрої!"
}
