{
   "main-desc": "RetroArch är ett open source-projekt som använder ett kraftfullt utvecklingsgränssnitt som heter Libretro. Libretro är ett gränssnitt som gör att du kan skapa kross-plattformsapplikationer som kan använda många funktioner som OpenGL, stöd för kross-plattformskamera, platsstöd och mer i framtiden.\n\nDet kommer med dess egena inbyggda samling applikationer för att ge dig en \"one-stop-shop\" för underhållning.\n\nLibretro och RetroArch passar perfekt för att skapa spel, emulatorer och multimediaprogram. Om du vill lära dig mer, gå till vår webbplats (listad nedan).\nVIKTIGT!!!\n\nRetroArch är ett mångsidigt program, vilket betyder att du behöver modulära program som vi kallar \"kärnor\" för att det ska kunna göra någonting. Dessa kärnor FÖLJER INTE MED. Du måste gå till \"Online Uppdateraren -> Kärnuppdateraren\" inifrån appen för att ladda ner dem.\n\nFUNKTIONER:\n* Ögon-godismenyer att välja mellan!\n* Skanna filer / kataloger och lägg till dem i spelsystemsamlingar!\n* Visa databasinformation om varje spel när de är tillagda i en samling!\n* Ladda ner program (\"kärnor\") online\n* Uppdatera allt!\n* Ladda ner Game & Watch spel och spela dem med vår exklusiva Game & Watch-emulator!\n* Inbyggd mappning av kontroller\n* Möjlighet att mappa om kontroller\n* Möjlighet att skriva in och ladda fusk\n* Flerspråkigt stöd!\n* Över 80+ program (\"kärnor\") nu och det ökar!\n* Spela multiplayer med NetPlay!\n* Ta skärmdumpar, spara ögonblicksbilder och mer!\n\n* Ingen DRM\n* Inga begränsningar för användning\n* Öppen källkod\n* Inga push-annonser\n* Ingen spionering\n* Inga annonser alls\n\nGå med oss på discord för support och matchmaking via netplay\nhttps://discord.gg/C4amCeV\n\nBesök vår Youtube-kanal här för handledning, spel, nyheter och utvecklingsframsteg!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nFör information och hjälp, se vår dokumentationssida -\nhttps://docs.libretro.com/\n\nBesök vår hemsida!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Retrospel och emulatorer på din enhet!"
}
