{
   "main-desc": "RetroArch ist ein Open-Source-Projekt, welches eine leistungsstarke Entwicklungsoberfläche namens Libretro nutzt. Libretro ist eine Schnittstelle, die es dir erlaubt plattformübergreifende Anwendungen zu erstellen, die reiche Funktionen wie OpenGL nutzen können plattformübergreifende Kameraunterstützung, Standortunterstützung und vieles mehr in der Zukunft.\n\nEs verfügt über eine eigene integrierte Sammlung von Anwendungen, um dir einen \"One-Stop-Shop\" für Unterhaltung zu bieten.\n\nLibretro und RetroArch eignen sich perfekt für die Erstellung von Spielen, Emulatoren und Multimediaprogrammen. Wenn Sie mehr erfahren möchten, gehen Sie auf unsere Website (unten aufgeführt).\nWICHTIG!!!\n\nRetroArch ist ein vielseitiges Programm, das bedeutet, dass Sie modulare Programme benötigen, die wir Kerne/Cores nennen. Diese Kerne/Cores KOMMEN NICHT MIT DIESER ANWENDUNG. Du musst in der App zu \"Online Updater -> Core Updater\" gehen, um sie herunterzuladen.\n\nFEATURES:\n* Eye-Candy-Menüs zum auswählen!\n* Scanne Dateien / Verzeichnisse und füge sie zu Spiele-System-Sammlungen hinzu!\n* Zeige Datenbankinformationen über jedes Spiel, wenn es einmal zu einer Sammlung hinzugefügt wurde!\n* Lade Programme herunter ('cores') online\n* Aktualisiere alles!\n* Lade Game & Watch herunter und spiele sie mit unserem exklusiven Game & Watch Emulator!\n* Integriertes Input-Remapping\n* Möglichkeit zur Remapping der Steuerung\n* Möglichkeit zur Eingabe und zum Laden von Cheats\n* Mehrsprachige Unterstützung!\n* Über 80+ Programme ('cores') jetzt und bald mehr!\n* Spiele Multiplayer mit NetPlay!\n* Erstelle Screenshots, Save States und mehr!\n\n* Keine DRM\n* Keine Einschränkungen bei der Nutzung\n* Open-Source\n* Keine Push-Anzeigen\n* Keine Spionage\n* Keine Werbung.\n\nSchließen Sie sich uns bei Discord für Support und Netplay-Matchmaking\nhttps://discord an. g/C4amCeV\n\nBesuchen Sie unseren YouTube-Kanal für Tutorials, Gameplays, News und Entwicklungsfortschritte!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube. om/RetroArchOfficial\n\nFür Informationen und Hilfe besuchen Sie unsere Dokumentationsseite -\nhttps://docs.libretro.com/\n\nBesuchen Sie unsere Website!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Retrospiele und Emulatoren auf deinem Gerät!"
}
