{
   "main-desc": "RetroArch jest projektem open-source, który wykorzystuje potężny interfejs programistyczny o nazwie Libretro. Libretro to interfejs umożliwiający tworzenie aplikacji międzyplatformowych, które w przyszłości mogą korzystać z bogatych funkcji, takich jak OpenGL, Wsparcie kamery, obsługa lokalizacji i wiele innych.\n\nPosiada własną, wbudowaną kolekcję aplikacji, które zapewniają rozrywkę.\n\nLibretro i RetroArch doskonale nadają się do tworzenia gier, emulatorów i programów multimedialnych. Jeśli chcesz dowiedzieć się więcej, wejdź na naszą stronę internetową (wymienioną poniżej).\nWAŻNE!!!\n\nRetroArch jest programem uniwersalnym, co oznacza, że aby móc robić wszystko, potrzebne są programy modułowe, które nazywamy \"rdzeniami\". Rdzenie nie będą od razu zainstalowane. Aby je pobrać, należy przejść do \"Online Updater -> Core Updater\" z poziomu aplikacji.\n\nFUNKCJE:\n* Wiele przyjemnych dla oka menu. Do wyboru do koloru!\n* Skanuj pliki / katalogi i dodaj je do kolekcji systemu gier!\n* Przeglądaj informacje z bazy danych o każdej grze po dodaniu jej do kolekcji!\n* Pobierz programy (\"rdzenie\") online\n* Zaktualizuj wszystko!\n* Pobierz grę i graj w nie za pomocą naszego emulatora!\n* Wbudowany remapping danych wejściowych\n* Możliwość zmiany ustawień sterowania\n* Zdolność do wprowadzania i ładowania cheatów\n* Wielojęzyczne wsparcie!\n* Ponad 80+ programów('rdzeni') obecnie i będzie więcej!\n* Graj w trybie wieloosobowym z NetPlay!\n* Rób zrzuty ekranu, zapisz stany i więcej!\n\n* Bez DRM\n* Brak ograniczeń w użytkowaniu\n* Open-source\n* Brak reklam\n* Nie szpiegujemy\n\nDołącz do naszego discorda jeśli potrzebujesz wsparcia\nhttps://discord.gg/C4amCeV\n\nOdwiedź nasz kanał na Youtube, aby zapoznać się z samouczkami, grami, nowościami i postępami w rozwoju!\nhttps://www.youtube.com/user/libretro\nhttps://www.youtube.com/RetroArchOfficial\n\nAby uzyskać informacje i pomoc, odwiedź naszą stronę z dokumentacją -\nhttps://docs.libretro.com/\n\nOdwiedź naszą stronę internetową!\nhttps://www.retroarch.com/\n\nwww.libretro.com",
   "short-desc": "Gry i emulatory Retro na twoim urządzeniu!"
}
