{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, run-ahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and run-ahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos je moderní odnož emulátoru UoYabause, který je sám odnoží uznávaného emulátoru Yabause. Toto DLC poskytuje jádro Kronos-libretro pro použití s herním a multimediálním rozhraním RetroArch, které uživatelům umožňuje načítat software kompatibilní s emulátorem Kronos.\n\nKronos využívá moderní možnosti OpenGL, které poskytují řadu dalších grafických funkcí, jako je například zvýšené vnitřní rozlišení, takže je doporučen aktuální a přiměřeně výkonný grafický procesor.\n\nKronos podporuje načítání her z mnoha různých formátů, včetně ISO, BIN/CUE a komprimovaného formátu CHD, a pro správnou funkci vyžaduje externí soubory BIOS (saturn_bios.bin a stvbios.zip) umístěné buď v \"systémové\" složce aplikace RetroArch, nebo vedle cílového softwaru.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen je velmi přesný a funkcemi nabitý emulátor s podporou spousty mapovačů kazet (dokonce i těch, které se používají pro podivné, neautorizované kazety), vlastních barevných palet a balíčků HD aktiv. Jako jádro libretro podporuje Mesen mnoho pokročilých funkcí, například softpatching a achievementy (prostřednictvím služby RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S je velmi přesný a funkcemi nabitý emulátor 16bitových konzolí. Vyznačuje se vysokou kompatibilitou s podporou přídavných čipů používaných v mnoha hrách té doby a zároveň si zachovává vysoký výkon. Jako jádro libretro podporuje Mesen S mnoho pokročilých funkcí, například softpatching a achievementy (prostřednictvím služby RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA je rychlý a přesný emulátor jedné z nejoblíbenějších a nejoblíbenějších kapesních konzolí, který je kompatibilní s obrovskou knihovnou oblíbených 8 a 16bitových her. Kromě snahy o rychlost a věrnou reprodukci má mGBA také spoustu skvělých funkcí pro vylepšení, včetně podpory vlastních palet pro hry, které byly původně ve stupních šedi, a zobrazování okrajů u her, které je obsahují.\n\nToto DLC umožňuje spustit mGBA prostřednictvím aplikace RetroArch, která přidává všechna její vylepšení a funkce, včetně přetáčení v reálném čase, rozsáhlého postprocessingu shaderů a vstupu s nízkou latencí, aby poskytla moderní herní zážitek i u klasických titulů.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed je součástí dlouhé řady emulátorů, která zahrnuje PCSX-Reloaded, PCSX-df a samozřejmě původní PCSX. Tento konkrétní fork byl původně silně optimalizován pro zařízení s procesory ARM, odtud název, ale přidali jsme zpět poměrně dost věcí, aby dobře fungoval i na typickém hardwaru PC.\n\nJako jádro libretro vyžaduje toto DLC rozhraní RetroArch, kde může být načteno jako jádro pro spouštění her a softwaru, které jsou kompatibilní s emulátorem PCSX ReARMed. Toto jádro vyžaduje, aby byl obraz BIOSu (není součástí dodávky) pro každou oblast softwaru umístěn do adresáře \"system\" aplikace RetroArch, aby správně fungoval.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\n\nSameBoy je velmi přesný emulátor, který je známý tím, že úspěšně spouští několik her, které ostatním emulátorům způsobují potíže. Kromě této vysoké přesnosti má SameBoy také několik příjemných funkcí, jako je možnost vybrat si model zařízení, který se má emulovat, bez ohledu na to, pro jaký model je hra určena, palety barev, které si může zvolit uživatel, vestavěný HLE BIOS a možnost načítat okraje u her, které je podporují.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella je bezplatný emulátor s otevřeným zdrojovým kódem pro jednu z nejoblíbenějších a nejvlivnějších domácích herních konzolí 70. a 80. let. Tento emulátor byl původně vyvinut pro použití v operačním systému GNU/Linux, ale postupem času byl portován na mnoho různých platforem, včetně libretro, které umožňuje přehrávání prostřednictvím herního a multimediálního systému RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nBěhem posledních několika let udělal vývojový tým Stelly velký pokrok v napodobování mnoha zvláštností cílové konzole Stella, díky čemuž je kompatibilní s mnoha obtížně emulovatelnými hrami, homebrew softwarem a demoverzemi.\n\nProstřednictvím aplikace RetroArch můžete do tohoto klasického emulátoru vnést moderní nádech, a to díky podpoře přetáčení v reálném čase a RetroAchievements, stejně jako díky ve své třídě nejlepším shaderům RetroArch pro emulaci CRT displeje a dalším funkcím.",
   "requirements": "CPU: Intel Pentium 4 a vyšší (vyžadován procesor s instrukcemi SSE2) \nDoporučený procesor: Intel Core series nebo ekvivalentní procesor AMD \n Grafický procesor: libovolný kompatibilní s OpenGL 2.x nebo Direct3D11. Pro správnou funkci shaderů by měla podporovat alespoň Shader Model 2.0. \nDoporučené grafické rozhraní: 1: Intel: Pro OpenGL je vyžadován alespoň Intel HD 4K, pro Direct3D 11 jakýkoli GPU kompatibilní s D3D11. Měla by podporovat alespoň Shader Model 3.0 a/nebo 4.0. \nDalší poznámky: Pro OpenGL: Grafické procesory Intel HD 2K/3K v systému Windows 10 se budou muset vrátit k ovladači OpenGL 1.1.",
   "legal-limits": "RetroArch je svobodný/otevřený software, který je k dispozici pod licencí GNU GPL 3.0. \nNeobsahuje žádný materiál chráněný autorskými právy třetích stran. RetroArch v žádném případě neschvaluje pirátství."
}
