{
   "main-desc": "RetroArch je open source a multiplatformový doplnok pre emulátory, herné systémy, videohry, prehrávače médií a iné aplikácie.\n\nHoci okrem toho dokáže mnoho ďalších vecí, najznámejší je tým, že umožňuje spúšťať klasické hry na širokom spektre počítačov a konzol prostredníctvom prehľadného grafického rozhrania. Nastavenia sú tiež zjednotené, takže konfigurácia sa vykonáva raz a navždy.\n\nOkrem toho budete môcť čoskoro z RetroArchu spúšťať aj originálne disky s hrami (CD). Zachovanie videohier berieme vážne a chceme zabezpečiť, aby ste mohli spustiť pôvodne zakúpený obsah na moderných počítačoch.\n\nRetroArch má pokročilé funkcie, ako sú shadery, hra po sieti, pretáčanie, čas reakcie na ďalší snímok, run-ahead a ďalšie!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (alias FBNeo) je nová oficiálna odnož emulátora Final Burn Alpha, ktorá je kompatibilná so stovkami arkádových a konzolových hier. Jadro libretro FBNeo prináša svoju knižnicu kompatibilných titulov do aplikácie RetroArch, kde úzka integrácia jadra s API libretro umožňuje pracovať s pokročilými funkciami RetroArch na úpravu času, ako je sieťové hranie založené na spätnom prehrávaní a redukcia latencie pri spúšťaní. Obsahuje vstupné predvoľby na automatické mapovanie tlačidiel pre rôzne hry vrátane rozloženia bojových hier pre moderné aj staré arkádové ovládanie (tzv. fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX začal ako domáca verzia emulátora Genesis Plus pre hacknutú konzolu predtým, ako bol portovaný na libretro. Vďaka zameraniu na rýchlosť, presnosť a prenosnosť sa Genesis Plus GX teraz objavuje na rôznych platformách a rozhraniach a je známy ako jeden z najschopnejších a najkompatibilnejších emulátorov pre konzoly, ktoré podporuje hranie z kaziet aj CD-ROM. Dobre spolupracuje aj s mnohými pokročilými funkciami programu RetroArch, ako je pretáčanie v reálnom čase, zníženie latencie pri behu, cheaty a RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos je moderný fork emulátora UoYabause, ktorý je sám forkom uznávaného emulátora Yabause. Toto DLC poskytuje jadro Kronos-libretro na použitie s herným a multimediálnym rozhraním RetroArch, ktoré umožňuje používateľom načítať softvér kompatibilný s emulátorom Kronos.\n\nKronos využíva moderné možnosti OpenGL na poskytovanie rôznych dodatočných grafických funkcií, ako je napríklad zvýšené vnútorné rozlíšenie, takže sa odporúča aktuálny a primerane výkonný grafický procesor.\n\nKronos podporuje načítavanie hier z mnohých rôznych formátov vrátane ISO, BIN/CUE a komprimovaného formátu CHD a na správne fungovanie vyžaduje externé súbory BIOS (saturn_bios.bin a stvbios.zip) umiestnené buď v priečinku RetroArch s náyvom \"system\", alebo vedľa cieľového softvéru.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen je veľmi presný a funkciami nabitý emulátor s podporou množstva mapovačov kartridží (dokonca aj tých, ktoré sa používajú pre cudzie, neautorizované kartridže), vlastných paliet farieb a balíkov HD prostriedkov. Mesen podporuje mnoho pokročilých funkcií, ako napríklad softpatching a dosiahnuté úspechy (prostredníctvom služby RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S je veľmi presný a funkciami nabitý emulátor 16-bitových konzol. Vyznačuje sa vysokou kompatibilitou s podporou prídavných čipov používaných v mnohých hrách tejto éry, pričom si zachováva aj vysoký výkon. Mesen S podporuje ako jadro Libretro mnoho pokročilých funkcií, ako napríklad softpatching a dosiahnuté úspechy (prostredníctvom služby RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA je rýchly a presný emulátor jednej z najpopulárnejších a najobľúbenejších vreckových konzol, ktorý je kompatibilný s obrovskou knižnicou obľúbených hier v 8 a 16-bitovom režime. Okrem snahy o rýchlosť a vernú reprodukciu má mGBA aj množstvo skvelých funkcií vylepšenia vrátane podpory vlastných paliet pre hry, ktoré boli pôvodne v odtieňoch sivej, a zobrazovania okrajov pre hry, ktoré ich obsahujú.\n\nToto DLC umožňuje mGBA spustiť cez RetroArch, ktorý pridáva všetky jeho vylepšenia a funkcie vrátane pretáčania v reálnom čase, rozsiahlych shaderov na následné spracovanie a vstupu s nízkou latenciou, aby poskytol moderný herný zážitok aj pri klasických tituloch.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed je súčasťou dlhého radu emulátorov, ktorý zahŕňa PCSX-Reloaded, PCSX-df a, samozrejme, pôvodný PCSX. Tento konkrétny fork bol pôvodne silne optimalizovaný pre zariadenia s procesormi ARM, z čoho vyplýva aj jeho názov, ale pridali sme späť pomerne veľa vecí, aby dobre fungoval aj na typickom PC hardvéri.\n\nAko jadro Libretro si toto DLC vyžaduje rozhranie RetroArch, kde ho možno načítať ako jadro na spúšťanie hier a softvéru, ktoré sú kompatibilné s emulátorom PCSX ReARMed. Toto jadro vyžaduje, aby bol obraz BIOS ( ktorý nie je súčasťou balenia) umiestnený v adresári \"system\" aplikácie RetroArch, aby mohol správne fungovať, a to pre každú oblasť softvéru.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\n\nSameBoy je veľmi presný emulátor, ktorý je známy tým, že úspešne spúšťa niekoľko hier, pri ktorých majú iné emulátory problémy. Okrem tejto vysokej presnosti má SameBoy aj niekoľko príjemných funkcií, ako napríklad možnosť vybrať si model zariadenia, ktoré sa má emulovať, bez ohľadu na to, pre aký model je hra určená, palety farieb, ktoré si môže vybrať používateľ, zabudovaný HLE BIOS a možnosť načítania okrajov v hrách, ktoré ich podporujú.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella je bezplatný emulátor s otvoreným zdrojovým kódom pre jednu z najpopulárnejších a najvplyvnejších domácich herných konzol 70. a 80. rokov. Tento emulátor bol pôvodne vyvinutý na použitie v operačnom systéme GNU/Linux, ale časom bol portovaný na mnoho rôznych platforiem vrátane libretro, ktoré umožňuje hranie prostredníctvom herného a multimediálneho systému RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nZa posledných niekoľko rokov urobil vývojový tím Stella veľký pokrok v napodobňovaní mnohých zvláštností cieľovej konzoly Stella, vďaka čomu je kompatibilná s mnohými ťažko emulovateľnými hrami, homebrew softvérom a demami.\n\nProstredníctvom aplikácie RetroArch môžete do tohto klasického emulátora vniesť moderný nádych vďaka podpore prevíjania v reálnom čase a RetroAchievements, ako aj vďaka najlepším shaderom vo svojej triede pre emuláciu CRT displeja a ďalších funkcií.",
   "requirements": "CPU: Intel Pentium 4 a vyššie (vyžaduje sa procesor s inštrukciami SSE2) \nOdporúčaný procesor: Rad Intel Core alebo ekvivalentný procesor AMD \n Akýkoľvek kompatibilný OpenGL 2.x alebo Direct3D11 Grafický procesor. Aby shadery fungovali správne, mali by podporovať aspoň Shader Model 2.0. \nOdporúčaná grafika: Intel: Pre OpenGL sa vyžaduje aspoň Intel HD 4K, pre Direct3D 11 akýkoľvek GPU kompatibilný s D3D11. Mala by podporovať aspoň Shader Model 3.0 a/alebo 4.0. \nĎalšie poznámky: Pre OpenGL: Grafické procesory Intel HD 2K/3K v systéme Windows 10 budú musieť prejsť na ovládač OpenGL 1.1.",
   "legal-limits": "RetroArch je softvér so slobodným/otvoreným zdrojovým kódom, dostupný pod licenciou GNU GPL 3.0. \nNeobsahuje žiadny materiál chránený autorskými právami tretích strán. RetroArch v žiadnom prípade neschvaľuje pirátstvo."
}
