{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, run-ahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and run-ahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos是UoYabause模拟器的现代分支，它本身就是古老的Yabause模拟器的分支。该DLC提供了与RetroArch游戏和多媒体接口一起使用的Kronos-libretro核心，允许用户加载与Kronos模拟器兼容的软件。\n\nKronos利用OpenGL的强大能力提供各种额外的图形功能，例如提高内部分辨率，因此建议使用最新且功能相当强大的 GPU。\n\nKronos支持以不同的格式加载游戏，包括ISO、BIN/CUE和压缩的CHD格式，它需要外部BIOS文件（saturn_bios.bin和stvbios.zip）放置在RetroArch的“system”文件夹中或与目标软件放在一起才能正常运行。",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen是一个高度精准且功能丰富的模拟器，支持大量盒式磁带映射器（甚至用于奇怪的、未经授权的购物车）、自定义调色板和高清资源。作为libretro核心，Mesen支持许多高级功能，例如软补丁和成就（通过RetroAchievements服务获得）。",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S是一款高度准确且功能丰富的16位主机模拟器。 它具有高兼容性，不仅支持当时很多游戏使用的附加芯片，同时保持高性能。 作为libretro核心，Mesen S支持许多高级功能，例如软补丁和成就（通过RetroAchievements服务获得）。",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA是一款快速、准确的模拟器，适用于其中一款最受欢迎的掌上主机，它兼容大量深受喜爱的8位和16位风格游戏。 除了对速度和完整移植的承诺之外，mGBA还具有大量出色的增强功能，包括自定义调色板以及显示边框。\n\n此DLC允许mGBA通过RetroArch运行，RetroArch增加了其所有增强功能，包括实时读档、丰富的后处理着色器和低延迟输入，即使是经典游戏也能提供现代游戏体验。",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed是包括PCSX-Reloaded、PCSX-df以及原始PCSX在内的众多模拟器产品线的一部分。 这个特殊的分支最初为配备ARM CPU的设备进行了大量优化，也因此得名。但我们给它添加了很多东西，使其在传统的PC硬件上也能很好地运行。\n\n作为一个libretro核心，这个DLC需要RetroArch接口，它可以作为核心加载来运行与PCSX ReARMed模拟器兼容的游戏和软件。 该内核需要一个BIOS镜像（未导入的）放置在RetroArch的“system”目录中，以便将软件的每个区域进行替换，才能正常运行。",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy是一个高精准的模拟器，因成功运行其他模拟器无法运行的游戏而闻名。 除此之外，SameBoy还具有一些不错的功能，例如：可以随意选择要模拟的设备类型而忽略该游戏最初设计的设备类型、用户可选择的调色板、内置HLE BIOS以及在支持的游戏中加载边框的能力。",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella是一款免费的开源模拟器，适用于一款二十世纪70年代和80年代最流行和最有影响力的家用视频游戏主机。 这个模拟器最初是为在GNU/Linux操作系统上使用而开发的，但随着时间的推移，它被移植到许多不同的平台，包括libretro，允许其通过RetroArch游戏和多媒体系统运行。\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\n在过去的几年里，Stella开发团队在模仿Stella目标主机的许多特征方面取得了长足的进步，得以兼容难以模拟的游戏、自制软件和demo。\n\nRetroArch可以为这款经典模拟器带来现代化的体验，支持实时读档和 RetroAchievements，以及RetroArch的一流CRT显示模拟着色器等。",
   "requirements": "CPU：Intel Pentium 4 及更高版本（需要包含SSE2指令的CPU）\nCPU推荐：Intel Core系列或AMD同等产品\n显卡：任何兼容的OpenGL 2.x或Direct3D11 GPU。 要使着色器正常工作，至少要支持Shader Model 2.0。\n显卡推荐：英特尔：OpenGL至少需要Intel HD 4K，任何兼容Direct3D 11的D3D11 GPU。应至少支持Shader Model 3.0或4.0。\n附加说明：对于 OpenGL：Windows 10上的Intel HD 2K/3K GPU将不得不退回到OpenGL 1.1驱动。",
   "legal-limits": "RetroArch是一款免费且开源的软件，可在GNU GPL 3.0许可下使用。\n它不包含任何受第三方版权保护的内容。RetroArch不会以任何方式、形式纵容盗版行为。"
}
