{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, run-ahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and run-ahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos는 권위있는 Yabause 에뮬레이터의 포크인 UoYabause 에뮬레이터의 포크 에뮬레이터입니다. 이 DLC는 RetroArch에서 활용할 수 있는 Kronos libretro 코어를 제공하여 Kronos 에뮬레이터와 호환되는 소프트웨어를 구동할 수 있게 합니다.\n\nKronos는 최신 OpenGL 기능을 활용하여 내부 해상도 업스케일링 등 다양한 그래픽 기능을 제공하므로 강력한 최신 GPU와 함께 사용하는 것이 권장됩니다.\n\nKronos는 ISO, BIN/CUE, 압축된 CHD 등 다양한 포맷의 게임을 불러올 수 있고, 외부 BIOS 파일(saturn_bios.bin, stvbios.zip)을 필요로 하기 때문에 RetroArch의 \"system\" 폴더 또는 실행할 소프트웨어와 함께 BIOS 파일이 제공되어야 합니다.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen은 높은 정확도와 함께 엄청나게 많은 매퍼(이상한 해적판 게임에 사용된 것들 포함) 지원과 커스텀 색상 팔레트, HD 애셋 팩 등 다양한 기능을 제공하는 에뮬레이터입니다. libretro 코어로서 Mesen은 소프트패칭과 RetroAchievements를 통한 도전 과제 등 다양한 고급 기능을 지원합니다.",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S는 높은 정확도와 다양한 기능을 제공하는 16비트 콘솔 에뮬레이터입니다. 빠른 속도와 함께 당시 게임들이 활용한 다양한 추가 칩들을 지원하는 등 높은 호환성을 제공합니다. libretro 코어로서 Mesen S는 소프트패칭과 RetroAchievements를 통한 도전 과제 등 다양한 고급 기능을 제공합니다.",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA는 세상에서 가장 유명한 휴대용 게임기 중 하나를 구현하는 빠르고 정확한 에뮬레이터로, 많은 사랑을 받은 다양한 8비트 및 16비트 스타일의 게임들과 호환됩니다. 빠른 속도와 정확한 구현에 더해, mGBA는 흑백 게임을 위한 커스텀 팔레트와 지원하는 게임의 보더 표시 등 다양한 추가 기능을 지원합니다.\n\n이 DLC는 mGBA를 RetroArch에서 구동하여 실시간 뒤로 감기, 후처리 셰이더, 빠른 반응속도 등 고전 게임을 현대적으로 즐길 수 있는 고급 기능들을 활용할 수 있게 합니다.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed는 PCSX-Reloaded와 PCSX-df, 그리고 원조 PCSX의 긴 계보를 잇는 에뮬레이터입니다. 이 포크는 이름에서 보시다시피 ARM CPU에 맞춰 최적화된 버전으로, 일반적인 PC에서도 잘 실행될 수 있도록 몇 가지 기능이 다시 추가되었습니다.\n\nlibretro 코어로서 이 DLC는 코어를 불러오고 PCSX ReARMed와 호환되는 게임과 소프트웨어를 실행할 수 있는 RetroArch 인터페이스를 필요로 합니다. 이 코어는 지역별 BIOS 이미지(포함 안 됨)를 필요로 하므로 코어의 정상 작동을 위해 RetroArch의 \"system\" 폴더에 별도로 제공되어야 합니다.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy는 다른 에뮬레이터는 제대로 실행하지 못하는 일부 게임을 올바르게 실행하는 것으로 유명한 높은 정확도를 제공하는 에뮬레이터입니다. 높은 정확도에 더해, SameBoy는 게임의 의도와 관계없이 특정 디바이스에서 실행하기, 사용자 선택 가능한 색상화 팔레트, 내장 HLE 바이오스, 지원하는 게임의 보더 표시 등 다양한 추가 기능을 제공합니다.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella는 1970년대부터 80년대까지 가장 유명하고 영향력 있었던 게임 콘솔 중 하나의 자유 오픈 소스 에뮬레이터입니다. 이 에뮬레이터는 원래 GNU/Linux 운영체제 상에서 구동되는 것을 목표로 개발되었으나, 시간이 흐르며 다양한 플랫폼으로 이식되었고, libretro로도 이식되어 RetroArch를 통해 구동할 수 있게 되었습니다.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\n지난 몇 년간 Stella 개발 팀은 Stella의 타겟 콘솔의 특이한 요소들을 구현하는 데 큰 진보를 이뤄내, 기존에 에뮬레이트하기 힘들었던 다양한 게임과 홈브루, 그리고 데모들과의 호환성을 갖췄습니다.\n\nRetroArch를 통해 이 고전 에뮬레이터에도 실시간 뒤로 감기, RetroAchievements, RetroArch의 최상급 CRT 디스플레이 구현 셰이더 등 다양한 현대적 요소를 가미할 수 있습니다.",
   "requirements": "CPU: Intel Pentium 4 또는 그 이상 (SSE2 지원 CPU 필요) \nCPU 권장사항:Intel Core 시리즈 또는 동급 AMD \n그래픽: OpenGL 2.x 또는 Direct3D11 지원 GPU. 셰이더를 사용하려면 최소 Shader Model 2.0 을 지원해야함.\n그래픽 권장사항: Intel: OpenGL을 위해 최소 Intel HD 4000 이상 또는 동급 Direct3D 11지원 D3D11 GPU. 최소한 Shader Model 3.0 또는 4.0 지원 필요. \n추가 정보: OpenGL: Windows 10 상에서 Intel HD 2000/3000대 GPU는 OpenGL 1.1 드라이버를 사용해야 합니다.",
   "legal-limits": "RetroArch는 GNU GPL 3.0 라이센스로 제공되는 무료/오픈 소스 소프트웨어 입니다.\nRetroArch는 서드파티의 저작권이 있는 어떠한 자료도 포함되지 않으며 어떤 형태로든 불법 행위를 용납하지 않습니다."
}
