{
   "main-desc": "RetroArch és programa de codi obert disponible per diferents sistemes operatius que permet executar emuladors, motors de jocs, reproductors multimèdia i altres aplicacions.\n\nEncara que pot fer moltes altres coses, és més conegut per executar jocs clàssics en molts ordinadors i consoles mitjançant una interfície gràfica elegant. La configuració també està unificada, així que només cal configurar RetroArch una sola vegada.\n\nTambé es poden executar jocs en discs de joc originals (CDs). Ens prenem la preservació dels videojocs seriosament i volem garantir que es pugui seguir executant continguts originals i comprats en dispositius moderns.\n\nRetroArch té moltes característiques avançades com shaders, joc en xarxa, rebobinat, temps de resposta per fotograma baix, reducció predictiva de latència i molt més!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (aka FBNeo) és la nova branca oficial de l'emulador Final Burn Alpha, el qual és compatible amb centenars de jocs arcade i de consola. El nucli Libretro de FBNeo porta la seva biblioteca de jocs compatibles a RetroArch, on l'integració del nucli amb la llibreria API Libretro permet fer servir les característiques avançades de RetroArch com l'alteració temporal, el joc en xarxa o la reducció predictiva de la latència. També inclou configuracions d'entrada per assignar botons de manera automàtica per diferents jocs, per exemple, controlar jocs de lluita amb dispositius tipus arcade, tant moderns com clàssics (és a dir, controladors específics de jocs de lluita).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX començà com un port amateur de l'emulador Genesis Plus per a consoles modificades abans de ser convertit a Libretro. Pensat per aconseguir velocitat, precisió i portabilitat, Genesis Plus GX es troba en moltes plataformes i emuladors i és conegut per la quantitat de consoles que suporta i que és compatible amb jocs en format cartutx i en format CD-ROM. També funciona bé amb una de les principals característiques de RetroArch, com el rebobinat en temps real, la reducció predictiva de latència, els trucs i els assoliments amb RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos és un fork modern de l'emulador UoYabause, el qual és un fork del venerable emulador original Yabause. Aquest contingut descarregable proveeix del nucli libretro de Kronos per fer-lo servir dins de RetroArch i permet executar videojocs i una interfície multimèdia, permentent carregar programari que és compatible amb l'emulador Kronos.\n\nKronos utilitza les capacitats de la llibreria OpenGL i permet una varietat de funcionalitats gràfiques extres, com l'augment de resolució interna, així que es recomana una GPU moderna i potent.\n\nKronos pot carregar videojocs des de diferents formats, incloent fitxers ISO, BIN/CUE i fitxers comprimits en format CHD. Es requereix un fitxer BIOS extern (saturn_bios.bin i stvbios.zip) desats a la carpeta 'system' de RetroArch per poder funcionar correctament.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen és un emulador precís i complet que és compatible amb tot tipus de cartutxos (inclosos els cartutxos més estranys i sense autorització), paletes de color personalitzades i paquets amb contingut HD. Com a nucli libretro, Mesen és compatible amb moltes característiques avançades, com la modificació en temps real i els assoliments (amb el servei RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S és un emulador de consoles de 16 bits precís i complet. Té un nivell alt de compatibilitat i rendiment, i és compatible amb xips addicionals que es feien servir anteriorment en molt jocs. Com a nucli libretro, Mesen S és compatible amb moltes característiques avançades, com la modificació en temps real i els assoliments (amb el servei RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA és un emulador ràpid i precís per una de les consoles portàtils més populars i estimades, i té una gran compatibilitat amb jocs de 8 i 16 bits. A més de ser ràpid i precís, mGBA té moltes altres característiques, com el suport per paletes personalitzades per jocs que son en escala de grisos i compatibilitat per mostrar vores que inclouen alguns jocs.\n\nAquest contingut descarregable permet executar mGBA mitjançant RetroArch, i afegeix totes les característiques i millores de RetroArch, com el rebobinat en temps real, efectes de postprocessat i una latència baixa per donar una experiència moderna als jocs més clàssics.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed forma part d'una llarga llista d'emuladors que inclou PCSX-Reloaded, PCSX-df i, per suposat, el PCSX original. PCSX ReARMed va ser originalment concebut per dispositius amb xips ARM, d'aquí ve el nom, però s'han afegit algunes característiques que el fan funcionar molt bé en maquinari PC.\n\nCom a nucli libretro, aquest contingut descarregable necessita l'interfície RetroArch, on es pot carregar com a nucli i executar jocs i programari compatible amb l'emulador PCSX ReARMed. Aquest nucli requereix una imatges BIOS (no inclosa) per cada regió del programari per funcionar i s'ha de trobar a la carpeta \"system\" de RetroArch.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy és un emulador precís conegut per emular correctament alguns jocs que no poden ser emulats en altres emuladors. Afegit a la precisió, SameBoy també té altres característiques interessants, com la possibilitat d'escollir el model de sistema en emular sense tenir en compte el model pel qual estigui destinat el joc, paletes de color personalitzades, una BIOS HLE integrada i la capacitat de mostrar les vores en jocs compatibles.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella és un emulador lliure i de codi oberts de les consoles més populars i influents dels anys 70 i 80. Aquest emulador va ser desenvolupat inicialment en el sistema operatiu Linux, però amb el temps va ser portat a altres sistemes operatius, incloent libretro, el que permet executar-lo dins de RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nEls últims dos anys, l'equip de desenvolupament de Stella ha aconseguit grans avenços per emular moltes peculiaritats de les consoles, fent que sigui compatible amb molts jocs, aplicacions amateur i demos que eren difícils d'emular.\n\nA través de RetroArch, podràs donar un toc modern a aquest emulador amb el suport per a rebobinat de la imatge, assoliments amb RetroAchievements, els millors shaders de RetroArch per emular monitors CRT, i molt més.",
   "requirements": "CPU: Intel Pentium 4 o superior (Es requereix CPU amb instruccions SSE2) \nCPU recomanada: Intel Core series o AMD equivalent \nGràfics: Qualsevol GPU compatible amb OpenGL 2.x o Direct3D11. Per tenir sombrejadors fucionant correctament, cal suport per Shader Model 2.0. \nGràfics recomanats: Intel: Es requereix almenys Intel HD 4K per OpenGL, qualsevol compatible amb D3D11 GPU per Direct3D 11. Ha de suportar almenys Shader Model 3.0 i/o 4.0. \nInformació addicional: Per OpenGL: Intel HD 2K/3K GPUs a Windows 10 hauran d'instal·lar el controlador OpenGL 1.1.",
   "legal-limits": "RetroArch és software lliure i obert, disponible sota una llicència GNU GPL 3.0.\nNo conté material protegit per drets d'autor. RetroArch no fomenta la pirateria de cap manera o forma."
}
