{
   "main-desc": "Is creatlach/tosaigh foinse oscailte agus tras-ardáin é RetroArch d'aithriseoirí, innill cluichí, físchluichí, seinnteoirí meán agus feidhmchláir eile.\n\nCé gur féidir leis go leor rudaí a dhéanamh seachas seo, is fearr aithne air as a chumasú duit cluichí clasaiceacha a rith ar raon leathan ríomhairí agus consól trí chomhéadan grafach snasta. Tá na socruithe aontaithe freisin ionas go ndéantar an chumraíocht uair amháin agus go deo.\n\nChomh maith leis seo, beidh tú in ann dioscaí cluiche bunaidh (CDanna) ó RetroArch a rith go luath. Glacaimid caomhnú físchluichí dáiríre agus ba mhaith linn a chinntiú gur féidir leat an t-ábhar a cheannaigh tú ar dtús a rith ar ríomhairí pearsanta nua-aimseartha.\n\nTá gnéithe ardleibhéil ag RetroArch cosúil le scáthaitheoirí, súgradh líonra, athchasadh, amanna freagartha an chéad fhráma eile, rith chun tosaigh, agus níos mó!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nIs é Final Burn Neo (ar a dtugtar FBNeo freisin) an brainse oifigiúil nua den aithriseoir Final Burn Alpha, atá comhoiriúnach le na céadta cluichí stuara agus consól. Tugann croí libretro FBNeo a leabharlann de theidil chomhoiriúnacha chuig RetroArch, áit a gceadaíonn comhtháthú dlúth an chroí leis an API libretro dó oibriú le gnéithe ardleibhéil lúbadh ama RetroArch cosúil le súgradh líonra bunaithe ar rolladh siar agus laghdú latency rith chun tosaigh. Cuimsíonn sé réamhshocruithe ionchuir le haghaidh mapáil uathoibríoch cnaipí do chluichí éagsúla, lena n-áirítear leagan amach cluichí troda do rialuithe stuara nua-aimseartha agus sean-scoile (ar a dtugtar bataí troda freisin).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nThosaigh Genesis Plus GX mar phort baile den aithriseoir Genesis Plus do chonsól hackáilte sular aistríodh chuig libretro é. Le fócas ar luas, cruinneas agus iniomparthacht, feictear Genesis Plus GX anois ar réimse ardán agus tosaigh, agus tá cáil air mar cheann de na haithriseoirí is cumasaí agus is comhoiriúnaí do na consóil a chlúdaíonn sé, le tacaíocht do chluichí cartúis agus CD-ROM araon. Oibríonn sé go maith freisin le go leor de ghnéithe chun cinn RetroArch, amhail athchasadh fíor-ama, laghdú ar mhoill rith chun tosaigh, cleasanna agus RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nIs forc nua-aimseartha é Kronos den aithriseoir UoYabause, ar forc é féin den aithriseoir Yabause clúiteach. Soláthraíonn an DLC seo croílár Kronos-libretro le húsáid leis an gcomhéadan cearrbhachais agus ilmheán RetroArch, rud a ligeann d'úsáideoirí bogearraí atá comhoiriúnach leis an aithriseoir Kronos a luchtú.\n\nÚsáideann Kronos cumais OpenGL nua-aimseartha chun réimse gnéithe grafacha breise a sholáthar, amhail taifeach inmheánach méadaithe, mar sin moltar GPU cothrom le dáta agus réasúnta cumhachtach.\n\nTacaíonn Kronos le cluichí a luchtú ó go leor formáidí éagsúla, lena n-áirítear ISO, BIN/CUE agus an fhormáid CHD comhbhrúite, agus teastaíonn comhaid BIOS seachtracha (saturn_bios.bin agus stvbios.zip) atá curtha i bhfillteán \"córais\" RetroArch nó taobh leis na bogearraí sprice chun feidhmiú i gceart.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nIs aithriseoir an-chruinn agus lán de ghnéithe é Mesen a thacaíonn le tonna mapálaithe cartúis (fiú cinn a úsáidtear le haghaidh cairteacha aisteacha, neamhúdaraithe), pailéid dathanna saincheaptha agus pacáistí sócmhainní HD. Mar chroílár libretro, tacaíonn Mesen le go leor gnéithe ardleibhéil, cosúil le paiste bog agus éachtaí (tríd an tseirbhís RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nIs aithriseoir consól 16 giotán atá an-chruinn agus lán de ghnéithe é Mesen S. Tá comhoiriúnacht ard aige, le tacaíocht do na sceallóga breise a úsáideadh i go leor cluichí den ré, agus ardfheidhmíocht á cothabháil aige ag an am céanna. Mar chroílár libretro, tacaíonn Mesen S le go leor gnéithe ardleibhéil, cosúil le paiste bog agus éachtaí (tríd an tseirbhís RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nIs aithriseoir gasta, cruinn é mGBA do cheann de na consóil láimhe is mó tóir agus is mó a bhfuil gean orthu, agus tá comhoiriúnacht aige le leabharlann ollmhór cluichí stíl 8- agus 16-giotán a bhfuil an-tóir orthu. Chomh maith leis an tiomantas do luas agus atáirgeadh dílis, tá neart gnéithe feabhsúcháin iontacha ag mGBA freisin, lena n-áirítear tacaíocht do phailéid saincheaptha do chluichí a bhí liathscála ar dtús agus teorainneacha a thaispeáint do chluichí ina bhfuil siad.\n\nLigeann an DLC seo do mGBA rith trí RetroArch, a chuireann a fheabhsuithe agus a ghnéithe go léir leis, lena n-áirítear athchasadh fíor-ama, scáthaithe iarphróiseála fairsinge agus ionchur íseal-latency chun eispéireas cearrbhachais nua-aimseartha a sholáthar fiú le teidil chlasaiceacha.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nIs cuid de shraith fhada aithriseoirí é PCSX ReARMed lena n-áirítear PCSX-Reloaded, PCSX-df agus, ar ndóigh, an PCSX bunaidh. Bhí an forc seo optamaithe go mór ar dtús do ghléasanna le LAPanna ARM, dá bhrí sin an t-ainm, ach chuireamar roinnt rudaí leis arís chun go n-oibreoidh sé go maith ar chrua-earraí tipiciúla ríomhaire chomh maith.\n\nMar chroílár libretro, éilíonn an DLC seo comhéadan RetroArch, áit ar féidir é a luchtú mar chroílár chun cluichí agus bogearraí a rith atá comhoiriúnach leis an aithriseoir PCSX ReARMed. Éilíonn an croílár seo íomhá BIOS (nach bhfuil san áireamh) do gach réigiún den bhogearra le cur in eolaire \"córais\" RetroArch chun feidhmiú i gceart.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nIs aithriseoir an-chruinn é SameBoy atá aitheanta as roinnt cluichí a rith go rathúil a chuireann bac ar aithriseoirí eile. Chomh maith leis an gcruinneas ard seo, tá roinnt gnéithe deasa ag SameBoy freisin mar an cumas chun samhail gléis a roghnú le haithris beag beann ar an tsamhail a bhfuil an cluiche deartha dó, pailéid dathanna is féidir a roghnú ag an úsáideoir, BIOS HLE ionsuite agus an cumas teorainneacha a luchtú ar na cluichí a thacaíonn leo.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nIs aithriseoir foinse oscailte saor in aisce é Stella do cheann de na consóil cluichí físeáin baile is mó tóir agus is mó tionchar sna 1970idí agus sna 1980idí. Forbraíodh an aithriseoir seo ar dtús lena úsáid ar an gcóras oibriúcháin GNU/Linux ach, le himeacht ama, tá sé curtha ar aghaidh chuig go leor ardán éagsúla, lena n-áirítear libretro, rud a ligeann dó imirt tríd an gcóras cearrbhachais agus ilmheán RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nLe cúpla bliain anuas, tá dul chun cinn mór déanta ag foireann forbartha Stella maidir le haithris a dhéanamh ar na cleasanna iomadúla de chonsól sprice Stella, rud a fhágann go bhfuil sé comhoiriúnach le go leor cluichí, bogearraí baile agus taispeántais atá deacair a aithris.\n\nTrí RetroArch, is féidir leat teagmháil nua-aimseartha a thabhairt don aithriseoir clasaiceach seo, le tacaíocht d'athchasadh fíor-ama agus RetroAchievements, chomh maith le scáthaitheoirí is fearr dá leithéid RetroArch le haghaidh aithrise taispeána CRT agus níos mó.",
   "requirements": "LAP: Intel Pentium 4 agus níos airde (LAP le treoracha SSE2 ag teastáil)\nMolta ag LAP: Sraith Intel Core nó a chomhionann le AMD\nGrafaicí: Aon GPU OpenGL 2.x nó Direct3D11 comhlíontach. Chun go n-oibreoidh scáthóirí i gceart, ba chóir go dtacódh siad le Shader Model 2.0 ar a laghad.\nMolta ag Grafaicí: Intel: Teastaíonn Intel HD 4K ar a laghad le haghaidh OpenGL, aon GPU D3D11 comhlíontach le haghaidh Direct3D 11. Ba chóir go dtacódh siad le Shader Model 3.0 agus/nó 4.0 ar a laghad.\nNótaí breise: Maidir le OpenGL: Beidh ar GPUanna Intel HD 2K/3K ar Windows 10 brath ar thiománaí OpenGL 1.1.",
   "legal-limits": "Is bogearraí foinse oscailte/saor in aisce é RetroArch, atá ar fáil faoin gceadúnas GNU GPL 3.0. Níl aon ábhar cóipchirt ó thríú páirtithe ann. Ní cheadaíonn RetroArch píoráideacht ar aon bhealach, cruth ná foirm."
}
