{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, runahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and runahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, runahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos ye una biforcación moderna del emulador UoYabause qu'al empar ye otra biforcación del venerable Yabause. Esti DLC apurre'l nucleu Kronos-libretro pa usalu na interfaz multimedia y de xuegos RetroArch, permitiendo a los usuarios cargar software que seya compatible col emulador.\n\nEsti nucleu usa les funciones modernes d'OpenGL pa fornir una variedá de carauterístiques gráfiques adicionales como una resolución interna mayor, polo que s'aconseya una GPU moderna y potente.\n\nTamién sofita la carga de xuegos dende milenta formatos estremaos, incluyendo ISO, BIN/CUE y el formatu comprimíu CHD. Amás, ríquese que los ficheros de BIOS (saturn_bios.bin y stvbios.zip) se pongan na carpeta «system» de RetroArch o xunto al software que se cargue pa que too funcione correutamente.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\r\n\r\nMesen is a highly accurate and feature-filled emulator with support for tons of cartridge mappers (even ones used for weird, unauthorized carts), custom color palettes and HD asset packs. As a libretro core, Mesen supports many advanced features, like softpatching and achievements (through the RetroAchievements service).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S ye un emulador perprecisu y enllenu de carauterístiques d'una consola de 16-bits. Tien una compatibilidá alta, con sofitu pa los chips complementarios que s'usaben en munchos xuegos d'esa dómina mentanto mantién un rindimientu altu. Como nucleu de libretro, Mesen S sofita munches carauterístiques avanzaes como'l parchéu dixital y los llogros (pente'l serviciu de RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA ye un emulador rápidu y precisu d'una de les consoles portátiles más populares y queríes, y ye compatible con una biblioteca escomanada de xuegos en 8 y 16 bits. Amás del compromisu d'ufrir una reproducción fiel, mGBA tamién tien munches ameyores, incluyendo'l sofitu pa paletes personalizaes en xuegos qu'orixinalmente s'amosaben n'escala de buxos, y berbesos pa xuegos que los incluyíen.\n\nEsti DLC permite que mGBA s'execute pente Retroarch lo que va permitir amestar toles sos ameyores y carauterístiques qu'ínclúin: rebobináu en tiempu real, asolombradores de posprocesamientu y entrada de llatencia baxa p'apurrir una esperiencia de xuegu moderna nos títulos clásicos.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\r\n\r\nPCSX ReARMed is part of a long line of emulators that includes PCSX-Reloaded, PCSX-df and, of course, the original PCSX. This particular fork was originally heavily optimized for devices with ARM CPUs, hence the name, but we've added back in quite a few things to make it work well on typical PC hardware, as well.\r\n\r\nAs a libretro core, this DLC requires the RetroArch interface, where it can be loaded as a core to run games and software that are compatible with the PCSX ReARMed emulator. This core requires a BIOS image (not included) for each region of the software to be placed in RetroArch's \"system\" directory in order to function properly.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy ye un emulador perprecisu conocíu por executar dalgunos xuegos qu'otros emuladores nun son a facer bien. Amás d'esta precisión alta, SameBoy tamién sofita otres carauterístiques interesantes como la capacidá d'escoyer el modelu del preséu a emular independientemente del modelu pal que'l xuegu tuviere diseñáu, paletes de colores esbillables pol usuariu, BIOS HLE integrada y la posibilidá de cargar berbesos nos xuegos que lo sofiten.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella ye un emulador de códigu abiertu y gratuitu d'una de les consoles más influyentes y populares de los 70 y 80. Esti emulador desendolcóse orixinalmente pal sistema operativu GNU/Linux pero col tiempu portóse a munches plataformes estremaes, incluyendo a libretro, que-y permite xugar pente'l sistema multimedia y de xuegos Retroarch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nAlredor de los últimos años, l'equipu de desendolcu de Stella consiguió superar munchos pilancos a la hora d'imitar el hardware qu'emula Stella, faciéndolu compatible con homebrew, demos y munchos xuegos difíciles d'emular.\n\nPente RetroArch vas poder dar un toque modernu a esti emulador clásicu con sofitu pa rebobináu en tiempu real y RetroAchievements, amás de los meyores asolombradores de RetroArch pa la emulación de pantalles CRT, y muncho más.",
   "requirements": "CPU: Intel Pentium 4 y meyor (ríquese una CPU coles instrucciones SSE2) \nCPU aconseyada:Serie Intel Core o l'equivalente n'AMD \nGPU: Cualesquier GPU compatible con OpenGL 2.x o Direct3D11. Pa que funcionen afayadizamente los asolombradores, deberíen sofitar polo menos Shader Model 2.0. \nGPU aconseyada: Intel: Ríquese polo menos Intel HD 4K pa OpenGL, cualesquier GPU compatible con D3D11 pa Direct3D 11. Debería sofitar polo menos Shader Model 3.0 y/o 4.0. \nNotes adicionales: Pa OpenGL: Intel HD 2K/3K GPUs en Windows 10 van usar un controlador pa OpenGL 1.1.",
   "legal-limits": "RetroArch ye software llibre y gratuitu, disponible so la llicencia GNU GPL 3.0. \nNun contién nengún material de terceros que contenga copyright, tamién ta a la escontra de la piratería en toles sos formes"
}
