{
   "main-desc": "O RetroArch é uma interface/estrutura de código aberto e multiplataforma para emuladores, motores de jogos, jogos eletrônicos, reprodutores de mídia e outros aplicativos.\n\nEmbora o programa tenha múltiplas utilidades, é mais conhecido por permitir executar jogos clássicos em diversos computadores e consoles por meio de uma interface gráfica polida. As configurações também são unificadas, então só é preciso configurar uma vez.\n\nAlém disso, poderá executar discos (CD) de jogos originais em breve. A equipe RetroArch valoriza a preservação de jogos eletrônicos e deseja garantir que o programa execute conteúdos comprados legalmente em computadores modernos.\n\nO RetroArch têm recursos avançados como shaders, jogo em rede, rebobinamento, tempo de resposta do próximo quadro, execução antecipada e muito mais!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (FBNeo) é a nova divisão oficial do emulador Final Burn Alpha, que é compatível com centenas de jogos de arcade e de console. O núcleo libretro do FBNeo traz sua biblioteca de títulos compatíveis ao RetroArch, onde a integração do núcleo com a API libretro permite funcionar com os recursos temporais avançados do RetroArch, como jogo em rede baseado em reversão e redução de latência da execução antecipada. Isto inclui predefinições de entrada para mapeamento de botões automático em jogos diferentes, incluindo disposições de jogos de luta para os controles modernos e de arcades clássicos (fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nO Kronos é uma bifurcação moderna do emulador UoYabause, que é uma bifurcação do venerável emulador Yabause. Este conteúdo para download fornece o núcleo Kronos-libretro para a interface de jogos e multimídia RetroArch, permitindo que os usuários carreguem softwares compatíveis com o emulador Kronos.\n\nO Kronos utiliza os recursos mais recentes do OpenGL para fornecer uma infinidade de recursos gráficos adicionais, como maior resolução interna, por isso é recomendável ter uma GPU moderna e poderosa.\n\nO Kronos pode carregar jogos de vários formatos, incluindo ISO, BIN/CUE e o formato CHD compactado, e requer arquivos de BIOS adicionais (saturn_bios.bin e stvbios.zip) na pasta «system» do RetroArch ou ao lado do software de destino para funcionar corretamente.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nO Mesen é um emulador altamente preciso e cheio de recursos, com suporte para muitos mapeadores de cartuchos (mesmo aqueles usados por cartuchos não autorizados), paletas de cores personalizadas e pacotes de textura em HD. Como um núcleo libretro, o Mesen é compatível com muitos recursos avançados, como correções dinâmicas e conquistas (por meio do serviço RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nO Mesen S é um emulador de console 16 bits altamente preciso e cheio de recursos. Possui alta compatibilidade, compatível com os chips adicionais usados em muitos jogos da época, além de manter o alto desempenho. Como um núcleo libretro, o Mesen S suporta muitos recursos avançados, como correções dinâmicas e conquistas (através do serviço RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nO mGBA é um emulador rápido e preciso para um dos consoles portáteis mais populares e amados, e tem compatibilidade com uma enorme biblioteca de jogos adorados no estilo de 8 e 16 bits. Além do compromisso com a velocidade e a reprodução fiel, o mGBA também possui vários recursos de aprimoramento, incluindo suporte para paletas personalizadas para jogos que eram originalmente em escala de cinza e exibindo bordas para jogos que as incluem.\n\nEste conteúdo para download permite executar o mGBA no RetroArch, adicionando todos os seus aprimoramentos e recursos, incluindo rebobinagem em tempo real, shaders de pós-processamento extensivos e entrada de baixa latência para fornecer uma experiência de jogo moderna, mesmo com títulos clássicos.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nO PCSX ReARMed faz parte de uma longa linhagem de emuladores que inclui PCSX-Reloaded, PCSX-df e, é claro, o PCSX original. Essa bifurcação específica foi originalmente otimizada para dispositivos com CPUs ARM, daí o nome, mas recuperamos algumas coisas para que ela também possa ter um bom desempenho em hardware de computador comum.\n\nComo um núcleo libretro, esse conteúdo para download requer a interface RetroArch, onde pode ser carregado como um núcleo capaz de executar jogos e softwares compatíveis com o emulador PCSX ReARMed. Este núcleo requer uma imagem da BIOS (não incluída) para cada região de software na pasta «system» do RetroArch para funcionar.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nO SameBoy é um emulador muito preciso, conhecido por poder executar certos jogos que causam problemas em outros emuladores. Além de ter essa precisão, o SameBoy também apresenta outros recursos interessantes, como a possibilidade de escolher o modelo do sistema a ser emulado, independentemente do modelo para o qual o jogo foi designado, paletas de cores adequadas ao usuário, uma BIOS HLE integrada e o capacidade de exibir bordas em jogos compatíveis com elas.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nO Stella é um emulador gratuito e de código aberto para um dos consoles domésticos mais populares e influentes das décadas de 1970 e 1980. Este emulador foi originalmente projetado para o sistema operacional GNU/Linux, mas com o tempo foi convertido para várias plataformas, incluindo elas a libretro, que permite que você jogue através do sistema de jogos e multimídia RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nNos últimos anos, a equipe de desenvolvimento do Stella fez grandes progressos para replicar as várias peculiaridades do console de destino do Stella, tornando-o compatível com muitos jogos, aplicativos domésticos e demonstrações difíceis de emular.\n\nGraças ao RetroArch, você poderá dar a este emulador clássico um toque moderno com suporte para rebobinar em tempo real, conquistas do RetroAchievements, os melhores shaders do RetroArch para emular os monitores CRT e muito mais.",
   "requirements": "CPU: Intel Pentium 4 e superior (é necessária uma CPU com instruções SSE2)\nCPU recomendada:Série Intel Core ou equivalente AMD\nGráficos: Qualquer GPU compatível com OpenGL 2.x ou Direct3D11. Para que os shaders funcionem corretamente, deve suportar pelo menos o Shader Model 2.0.\nPlaca gráfica recomendada: Intel: Intel HD 4K pelo menos para OpenGL, qualquer GPU compatível com D3D11 para Direct3D 11. Deve suportar pelo menos o Shader Model 3.0 e/ou 4.0.\nNotas adicionais: Para OpenGL: As GPUs Intel HD 2K/3K no Windows 10 precisarão usar para um driver OpenGL 1.1.",
   "legal-limits": "O RetroArch é um software de código aberto/gratuito, disponível na licença GNU GPL 3.0.\nNão contém nenhum material protegido por direitos autorais de terceiros. O RetroArch não tolera pirataria de forma alguma."
}
