{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, run-ahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and run-ahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos — це сучасне відгалуження емулятора UoYabause, який сам є відгалуженням поважного емулятора Yabause. Цей додатковий вміст додає Kronos-libretro ядро до ігрового, мультимедійного інтерфейсу RetroArch, що дає змогу користувачам завантажувати програмне забезпечення, сумісне з емулятором Kronos.\n\nKronos використовує сучасні можливості OpenGL для реалізації додаткових графічних функцій, таких як збільшення внутрішньої роздільної здатності, тому рекомендується використання сучасного і доволі потужного GPU.\n\nKronos підтримує завантаження ігор в багатьох різних форматах, таких як: ISO, BIN/CUE та стислий формат CHD, та вимагає наявності зовнішніх файлів BIOS (saturn_bios.bin та stvbios.zip) в теці \"system\" в RetroArch, або поряд із цільовими іграми, для коректної роботи.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen — це дуже точний емулятор з великим функціоналом, який підтримує цілу прірву зіставників (mappers) картриджів (навіть ті, які використовуються нестандартними, неліцензійними картріджами), користувацьку палітру кольорів та пакунки додатків високої якості. В якості ядра libretro, Mesen підтримує багато сучасних можливостей, як-от м'яке оновлення (softpatching) та досягнення (через сервіс RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S — це високоточний та багатофункціональний 16-бітний консольний емулятор. Він має високу сумісність, підтримує додаткові мікросхеми, що використовувалися у багатьох іграх того часу, зберігаючи водночас високу продуктивність. В якості ядра libretro, Mesen S підтримує багато сучасних можливостей, як-от м'яке оновлення (softpatching) та досягнення (через сервіс RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA — це швидкий, точний емулятор однієї з найпопулярніших і найулюбленіших портативних приставок, та має високу сумісність з величезною бібліотекою улюблених 8 і 16-бітних ігор. На додачу до швидкості та правильного відтворення, mGBA також має низку чудових функцій покращення, таких як підтримку користувацьких палітр для ігор, які початково мали лише палітру відтінків сірого кольору та відображення рамок для ігор, які їх мали.\n\nЦей додаток дозволяє mGBA запускатися через RetroArch, набуваючи таким чином всі його вдосконалення та можливості, такі як перемотування в режимі реального часу, шейдери постобробки та низький рівень затримки, що гарантує сучасні ігрові відчуття навіть із класичними іграми.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed — це частина великого сімейства емуляторів, куди входять PCSX-Reloaded, PCSX-df і, звичайно, оригінальний PCSX. Спочатку ця гілка була добре оптимізована для пристроїв із процесорами ARM. Звідси і назва. Але ми додали ще багато речей, щоб емулятор також добре працював на типовому ПК-залізі.\n\nЯк ядро libretro, цей додаток потребує оболонку RetroArch, де він може бути завантажений і використаний для запуску ігор та програм, які сумісні з емулятором PCSX ReARMed. Для забезпечення належного функціонування цього ядра потрібна наявність образу BIOS (не входить у комплект) у каталозі \"system\" у RetroArch для кожного регiону, для якого була розроблена гра чи програма.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy — це високоточний емулятор, відомий своєю успішно роботою з багатьма іграми, які не працюють на інших емуляторах. На додачу до своєї високої точності, SameBoy також має деякі приємні можливості, такі як вибір моделі пристрою для емуляції незалежно від того, для якої моделі призначена гра, вибір палітри кольорів, вбудований HLE BIOS та можливість використання візуального оформлення для ігор, які це підтримують.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella — це безкоштовний емулятор з відкритим кодом однієї з найпопулярніших і найвпливовіших домашній ігрових приставок 1970-х та 80-х. Початково цей емулятор був розроблений для використання на операційній системі GNU/Linux, але з часом був портований на багато різних платформ, включно з libretro, що дає змогу грати в ігри через RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nЗа останні кілька років команда розробників Stella досягла великих успіхів, відтворюючи багато дивних особливостей приставки, яку емулює Stella, зробивши його сумісним з багатьма складними для емуляції іграми, домашніми програмами та демонстраціями.\n\nЗавдяки RetroArch ви можете додати крихту сучасності до цього класичного емулятора, як-от перемотування в реальному часі та RetroAchievements, а також найкращі RetroArch шейдери для емуляції CRT дисплею та багато іншого.",
   "requirements": "Процесор: Intel Pentium 4 чи кращий (потрібно ЦП з інструкціями SSE2) \nРекомендований процесор: Intel Core або AMD еквівалент \nГрафіка: всі сумісні з OpenGL 2.x або Direct3D11. Для коректної роботи шейдерів, відеокарта повинна мати підтримку принаймні шейдерної моделі 2.0. \nРекомендована графіка: Принаймні Intel HD 4K для OpenGL, будь-яка сумісна з D3D11 для Direct3D 11. Підтримка принаймні шейдерних моделей 3.0 та/або 4.0. \nДодаткові нотатки: Для OpenGL на відеокартах Intel HD 2K/3K на Windows 10 потрібно використовувати драйвер OpenGL 1.1.",
   "legal-limits": "RetroArch — це безкоштовне / відкрите програмне забезпечення, доступне за ліцензією GNU GPL 3.0.\nВоно не містить об'єктів авторського права від третіх осіб. RetroArch в жодному разі не потурає піратству."
}
