{
   "main-desc": "RetroArch ist ein Open Source und plattformübergreifendes Frontend/Framework für Emulatoren, Game-Engines, Videospiele, Mediaplayer und andere Anwendungen.\n\nObwohl RetroArch viele Funktionen hat, ist es am besten dafür bekannt, dass klassische Spiele auf einer Vielzahl von Computern und Konsolen über eine glanzvolle grafische Oberfläche ausgeführt werden können. Die Einstellungen sind ebenfalls vereinheitlicht, so dass die Konfigurationen ein für alle Mal durchgeführt wird.\n\nZusätzlich können Sie in Kürze originale Spiel-Discs (CDs) von RetroArch ausführen. Wir nehmen die Pflege und Bewahrung von Videospielen ernst und möchten sicherstellen, dass Sie Ihre ursprünglich gekauften Inhalte auf modernen PCs ausführen können.\n\nRetroArch hat erweiterte Funktionen wie Shader, Netplay, Rewinding, Next-Frame response times, Runahead und mehr!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2. ng[/img]\n\nFinal Burn Neo (aka FBNeo) ist der neue offizielle Zweig des Final Burn Alpha Emulators, die mit hunderten von Arcade- und Konsolenspielen kompatibel ist. Der libretro Kern von FBNeo bringt seine Bibliothek kompatibler Titel auf RetroArch, wobei die enge Integration des Kerns mit der libretro API es ermöglicht, mit den RetroArch's advanced time-bending von RetroArch wie Rollback-basiertes Netplay und runahead latency Verringerung zu arbeiten. Es enthält Eingabevorgaben für das automatische Mapping von Tasten für verschiedene Spiele. Einschließlich Kampfspiel-Layouts für moderne und alte Arcade-Steuerungen (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Telefon). ng[/img]\n\nGenesis Plus GX begann als Homebrew Port des Genesis Plus Emulators für eine gehackte Konsole bevor sie auf Libretro portiert wurde. Mit dem Fokus auf Geschwindigkeit, Genauigkeit und Übertragbarkeit erscheint Genesis Plus GX jetzt auf einer Vielzahl von Plattformen und Frontends und ist bekannt als einer der leistungsfähigsten und kompatibelsten Emulatoren für die betreffende Konsolen, mit Unterstützung für sowohl Kassetten- als auch für CD-ROM-Spiele. Es funktioniert auch gut mit vielen der fortgeschrittenen Funktionen von RetroArch, wie real-time rewind, runahead latency Verringerung, Cheats und RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main. ng[/img]\n\nKronos ist eine moderne Auskopplung des UoYabauth-Emulators, der selbst aus dem ehrwürdigen Yabauge-Emulators entstanden ist. Dieser DLC bietet den Kronos-libretro Core für den Einsatz das RetroArch Gaming und Multimedia Interface, damit Benutzer Software laden können, die mit dem Kronos-Emulator kompatibel ist.\n\nKronos nutzt moderne OpenGL-Möglichkeiten, um eine Vielzahl von zusätzlichen grafischen Funktionen bereitzustellen. Beispielsweise erhöhte interne Auflösung, wofür eine aktuelle und einigermaßen mächtige GPU empfohlen wird.\n\nKronos unterstützt das Laden von Spielen aus vielen verschiedenen Formaten, einschließlich ISO, BIN/CUE und dem komprimierten CHD-Format, und es erfordert externe BIOS-Dateien (saturn_bios.bin und stvbios.zip) platziert entweder im \"System\"-Ordner von RetroArch, oder neben der Zielsoftware, um korrekt zu funktionieren.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2. ng[/img]\n\nMesen ist ein hochpräziser und mit Funktionen gefüllter Emulator mit Unterstützung für viele Cartridge Mapper (auch für seltsame und nicht autorisierte Cartridges), benutzerdefinierte Farbpaletten und HD-Asset-Packs. Als libretro Core unterstützt Mesen viele erweiterte Funktionen, wie Softpatching und Achievments (durch den RetroAchievements Service).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S ist ein hochgenauer und mit Funktionen gefüllter 16Bit-Konsolen-Emulator. Mit einer hohen Kompatibilität, Unterstützung für die Add-on-Chips, die in vielen Spielen der Zeit verwendet werden, bietet er eine hohe Leistung. Als libretro Core unterstützt Mesen S viele erweiterte Funktionen, wie Softpatching und Achievments (durch den RetroAchievements Service).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba. ng[/img]\n\nmGBA ist ein schneller und genauer Emulator für eine der beliebtesten und erfolgreichsten Handheld-Konsole und bietet Kompatibilität für eine riesige Bibliothek von geliebten 8- und 16-Bit Stil-Spielen.Neben dem Hauptaugenmerk auf Schnelligkeit und einer treuen Wiedergabe verfügt mGBA auch über eine Menge großer Enhancement Features. Einschließlich Unterstützung für benutzerdefinierte Farbpaletten für Spiele, die ursprünglich in Graustufen dargestellt wurden und Ränder für Spiele, wenn sie diese beinhalten.\n\nDieser DLC erlaubt es mGBA mit RetroArch zu nutzen, was all seine Verbesserungen und Funktionen, wie Real-Time Rewind, extensive Post-Processing Shaders und low-latency Eingaben, die für ein modernes Spielerlebnis auch bei klassischen Titeln sorgen.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX. ng[/img]\n\nPCSX ReARMed ist Teil einer langen Reihe von Emulatoren, die PCSX-Reloaded, PCSX-df und natürlich die ursprüngliche PCSX enthalten. Diese spezielle Abkopplung wurde ursprünglich stark optimiert für Geräte mit ARM-CPUs, daher der Name, aber wir haben einige Dinge hinzugefügt, damit es auch auf typischer PC-Hardware gut funktioniert.\n\nAls libretro Core benötigt dieser DLC die RetroArch Schnittstelle, wo es als core geladen werden kann, um Spiele und Software auszuführen, die mit dem PCSX ReARMed Emulator kompatibel sind. Dieser Kern benötigt ein BIOS-Image (nicht enthalten), damit jeder Bereich der Software im \"System\"-Verzeichnis von RetroArc korrekt platziert werden kann.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Telefon). ng[/img]\nSameBoy ist ein hochpräziser Emulator, der dafür bekannt ist, ein paar Spiele erfolgreich laufen zu lassen, die andere Emulatoren zum Stolpern bringen. Zusätzlich zu dieser hohen Genauigkeit bietet SameBoy auch einige nette Features, wie die Möglichkeit, das zu emulierende Gerätemodell auszuwählen, unabhängig von dem Modell, für das das Spiel entwickelt wurde. Sowohl benutzerdefinierbare Farbpaletten, eingebaute HLE BIOS und die Möglichkeit, Ränder an den Spielen zu laden, die sie unterstützen.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla. ng[/img]\n\nStella ist ein freier Open-Source-Emulator für eine der beliebtesten und einflussreichsten Home-Videospielkonsolen der 70er und 80er Jahre. Dieser Emulator wurde ursprünglich für den Einsatz auf dem GNU/Linux-Betriebssystem entwickelt, aber im Laufe der Zeit wurde auf viele verschiedene Plattformen portiert, einschließlich Libretro, die es erlaubt, durch das RetroArch Spiel- und Multimedia-System zu spielen.\n\n[img]{STEAM_APP_IMAGE}/extras/2600. ng[/img]\n\nIn den letzten Jahren hat das Entwicklungsteam von Stella große Fortschritte bei der Nachahmung der viele Macken von Stellas Zielkonsole gemacht, sodass es mit vielen schwer zu emulierenden Spielen, Homebrew Software und Demos kompatibel ist.\n\nDurch RetroArch können Sie diesem klassischen Emulator eine moderne Note verleihen mit Unterstützung von Real-Time Rewind und RetroAchievements, RetroArch's eigenen Shadern für CRT-Display-Emulation und mehr.",
   "requirements": "CPU: Intel Pentium 4 und höher (CPU mit SSE2 Anweisungen erforderlich)\nCPU-empfohlen: Intel Core Serie oder AMD equivalent\nGrafiken: Jede OpenGL 2. oder Direct3D11 GPU. Damit Shader richtig funktionieren, sollten mindestens Shader Model 2.0 unterstützt werden.\nGrafikempfehlung: Intel: Mindestens Intel HD 4K für OpenGL erforderlich, jede D3D11 GPU für Direct3D 11. Sollte mindestens Shader Model 3 unterstützen. und/oder 4.0.\nZusätzliche Notizen: Für OpenGL: Intel HD 2K/3K GPUs unter Windows 10 müssen auf einen OpenGL 1.1 Treiber zurückfallen.",
   "legal-limits": "RetroArch ist eine freie/Open Source Software, verfügbar unter der GNU GPL 3.0 Lizenz.\nEnthält kein urheberrechtlich geschütztes Material durch Dritte. RetroArch duldet Piraterie in keiner Weise."
}
