{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, run-ahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and run-ahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nMae Kronos yn fforc fodern o'r efelychydd UoYabause, sydd ei hun yn fforc o'r efelychydd hybarch Yabause. Mae'r DLC hwn yn darparu'r craidd Kronos-libretro i'w ddefnyddio gyda'r rhyngwyneb hapchwarae ac amlgyfrwng RetroArch, gan ganiatáu i ddefnyddwyr lwytho meddalwedd sy'n gydnaws ag efelychydd Kronos.\n\nMae Kronos yn defnyddio galluoedd OpenGL modern i ddarparu amrywiaeth o nodweddion graffigol ychwanegol, megis mwy o cydraniad mewnol, felly argymhellir GPU cyfoes a rhesymol bwerus.\n\nMae Kronos yn cefnogi llwytho gemau o lawer o wahanol fformatau, gan gynnwys ISO, BIN / CUE a'r fformat CHD cywasgedig, ac mae angen ffeiliau BIOS allanol (saturn_bios.bin a stvbios.zip) wedi'u gosod naill ai yn ffolder \"system\" RetroArch neu ochr yn ochr â'r meddalwedd targed i weithio'n gywir.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMae Mesen yn efelychydd hynod gywir a llawn nodweddion gyda chefnogaeth i dunelli o fapwyr cetris (hyd yn oed y rhai a ddefnyddir ar gyfer troliau rhyfedd, diawdurdod), paletau lliw wedi'u haddasu a phecynnau asedau HD. Fel craidd libretro, mae Mesen yn cefnogi llawer o nodweddion datblygedig, fel meddalcyweirio a chyflawniadau (trwy'r gwasanaeth RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMae Mesen S yn efelychydd consol 16bit hynod gywir a llawn nodwedd. Mae ganddo gydnawsedd uchel, gyda chefnogaeth ar gyfer sglodyn ychwanegu a ddefnyddir mewn llawer o gemau'r oes, tra cynnal perfformiad uchel. Fel craidd libretro, mae Mesen S yn cefnogi llawer o nodweddion datblygedig, fel meddalcyweirio a chyflawniadau (trwy'r gwasanaeth RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nMae mGBA yn efelychydd cyflym, cywir ar gyfer un o'r consolau llaw mwyaf poblogaidd ac annwyl, ac mae ganddo gydnawsedd â llyfrgell enfawr o gemau arddull 8- ac 16-did. Ar ben yr ymrwymiad i gyflymder ac atgenhedlu ffyddlon, mae gan mGBA dunnell o nodweddion gwella gwych hefyd, gan gynnwys cefnogaeth i baletau lliw wedi'i addasu ar gyfer gemau a oedd yn wreiddiol yn raddfa lwyd ac yn arddangos ffiniau ar gyfer gemau sy'n eu cynnwys.\n\nMae'r DLC hwn yn caniatáu i mGBA redeg trwy RetroArch, sy'n ychwanegu ei holl welliannau a nodweddion, gan gynnwys ailddirwyn amser real, shaders ôl-brosesu helaeth a mewnbwn latency isel i ddarparu profiad chwarae modern hyd yn oed gyda theitlau clasurol.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nMae PCSX ReARMed yn rhan o linell hir o efelychwyr sy'n cynnwys PCSX-Reloaded, PCSX-df ac, wrth gwrs, y PCSX gwreiddiol. Yn wreiddiol, optimeiddiwyd y fforc benodol hon yn helaeth ar gyfer dyfeisiau gyda CPUau ARM, megis yr enw, ond rydym wedi ychwanegu cryn dipyn o bethau i wneud iddo weithio'n dda ar galedwedd PC nodweddiadol hefyd.\n\nFel craidd libretro, mae'r DLC hwn yn gofyn am ryngwyneb RetroArch, lle gellir ei lwytho fel craidd i redeg gemau a meddalwedd sy'n gydnaws â'r efelychydd PCSX ReARMed. Mae'r craidd hwn angen ddelwedd BIOS (heb ei chynnwys) ar gyfer pob rhanbarth y feddalwedd gael ei rhoi yng nghyfeiriadur \"system\" RetroArch er mwyn gweithredu'n iawn.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nMae SameBoy yn efelychydd hynod gywir sy'n adnabyddus am redeg ychydig o gemau yn llwyddiannus sy'n achosi i efelychwyr eraill faglu. Yn ychwanegol at y cywirdeb uchel hwn, mae SameBoy hefyd efo nodweddion braf fel y gallu i ddewis pa fodel dyfais i'w efelychu pryn bynnag fodel y mae'r gêm wedi'i gynllunio ar ei gyfer, paletiau lliwio y gellir eu dethol gan ddefnyddwyr, HLE BIOS adeiledig a'r gallu i lwytho ffiniau ar y gemau sy'n eu cefnogi.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nMae Stella yn efelychydd ffynhonnell agored am ddim ar gyfer un o gonsolau gemau fideo cartref mwyaf poblogaidd a dylanwadol y 1970au a'r '80au. Datblygwyd yr efelychydd hwn yn wreiddiol i'w ddefnyddio ar system weithredu GNU / Linux ond, dros amser, mae wedi cael ei borthi i lawer o wahanol lwyfannau, gan gynnwys libretro, sy'n caniatáu iddo chwarae trwy'r system hapchwarae ac amlgyfrwng RetroArch. \n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nYn ystod yr ychydig o flynyddoedd diwethaf, mae tîm datblygu Stella wedi cymryd brasgamau wrth ddynwared y hynodrwyddau niferus o gonsol targed Stella, gan ei gwneud yn gydnaws â llawer o gemau anodd eu hefelychu, meddalwedd homebrew a demos.\n\nTrwy RetroArch, gallwch ddod â golwg modern i'r efelychydd clasurol hwn, gyda chefnogaeth ar gyfer ailddirwyn amser real a RetroAchievements, yn ogystal ag shaders gorau RetroArch ar gyfer efelychu arddangos CRT a mwy.",
   "requirements": "CPU: Intel Pentium 4 ac i fyny (CPU gyda chyfarwyddiadau SSE2 yn ofynnol)\nArgymhellir CPU: Cyfres Intel Core neu gyfwerth AMD\nGraffeg: Unrhyw GPU sy'n cydymffurfio a OpenGL 2.x neu Direct3D11. Ar gyfer Shaders i weithio'n iawn, dylai gefnogi o leiaf Shader Model 2.0.\nGraffeg-argymhellir: Intel: O leiaf Intel HD 4K sy'n ofynnol ar gyfer OpenGL, unrhyw GPU D3D11 sy'n cydymffurfio ar gyfer Direct3D 11. Dylai gefnogi o leiaf Model Shader 3.0 a / neu 4.0.\nNodiadau ychwanegol: Ar gyfer OpenGL: bydd yn rhaid i GPUs Intel HD 2K / 3K ar Windows 10 ddisgyn yn ôl i yrrwr OpenGL 1.1.",
   "legal-limits": "Côd agored/am ddim yw RetroArch, ar gael dan drwydded y GNU GPL 3.0.\nDoes dim deunydd hawlfraint gan drydydd parti. Nid yw RetroArch yn gydoddef torri hawlfraint."
}
