{
   "main-desc": "RetroArch уяўляе сабой адкрытую крос-платформавую абалонку/фрэймворк для эмулятараў, гульнявых рухавічкоў, відэагульняў, медыяпрайгравальнікаў і іншых прыкладанняў.\n\nНягледзячы на ​​багацце магчымасцяў, RetroArch найболей вядомы як сродак з гнуткім графічным інтэрфейсам для запуску класічных гульняў ад мноства кампутараў і кансоляў. Канфігурацыя вырабляецца адзін раз дзякуючы ўніфікаваным наладам.\n\nУ дадатак да гэтага, неўзабаве вы зможаце запускаць у RetroArch арыгінальныя дыскі (CDs) з гульнямі. Мы адказна падыходзім да справы захавання відэагульняў і жадаем, каб вы мелі магчымасць гуляць у набыты вамі арыгінальны кантэнт на сучасных ПК.\n\nRetroArch прапануе пашыраныя магчымасці, уключаючы шэйдары, сеткавую гульню, перамотку, водгук на наступным кадры, забяганне і многае іншае!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (aka FBNeo) – гэта новае афіцыйнае адгалінаванне эмулятара Final Burn Alpha, сумяшчальнае з сотнямі аркадных і кансольных гульняў. Ядро FBNeo для libretro дадае сваю бібліятэку сумяшчальных гульняў у RetroArch, дзе цесная інтэграцыя з libretro API дазваляе ядру выкарыстаць такія магчымасці RetroArch як rollback-мультыплэер і памяншэнне затрымкі ўводу з дапамогай забегання. У ядро ​​ўбудаваны профілі ўводу для аўтаматычнай прывязкі кнопак у розных гульнях, у тым ліку раскладкі файтынгаў для сучасных і класічных аркадных кантролераў (файтстыкаў).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX да партавання пад libretro пачынаў развіццё як homebrew-порт эмулятара Genesis Plus для ўзламанай кансолі. З упорам на хуткасць, дакладнасць і партуймасць, у наш час Genesis Plus GX даступны на мностве платформаў і фронтэндаў і вядомы як адзін з самых функцыянальных і сумяшчальных эмулятараў кансоляў, з падтрымкай гульняў на картрыджах і кампакт-дысках. Ён таксама паспяхова ўзаемадзейнічае з пашыранымі магчымасцямі RetroArch, уключаючы перамотку ў рэальным часе, зніжэнне затрымкі ўводу з дапамогай забегання, Чыты і RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos - гэта сучасны форк эмулятара UoYabause, які, у сваю чаргу, з'яўляецца адгалінаваннем вядомага эмулятара Yabause. Дадзены DLC забяспечвае ўзаемадзеянне ядра Kronos для libretro з мультымедыйна-гульнявым інтэрфейсам RetroArch, дазваляючы карыстачам запускаць сумяшчальнае з Kronos праграмнае забеспячэнне.\n\nKronos выкарыстоўвае патэнцыял OpenGL для рэалізацыі пашыраных графічных магчымасцяў, такіх як павышэнне ўнутранага дазволу, патрабуючы наяўнасці дастаткова магутнага сучаснага GPU.\n\nKronos падтрымлівае загрузку гульняў у розных фарматах, у тым ліку ISO, BIN/CUE і фармат сціску CHD. Для правільнай працы ядра неабходна наяўнасць дадатковых файлаў BIOS (saturn_bios.bin і stvbios.zip) у тэчцы RetroArch \"system\" ці ў адной тэчцы з якой запускаецца праграмнае забеспячэнне.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen - высокадакладны шматфункцыянальны эмулятар з падтрымкай мноства мапераў (уключаючы ад нестандартных неафіцыйных картрыджаў), карыстальніцкіх каляровых палітраў і загрузкай HD-тэкстур. У якасці ядра libretro Mesen падтрымлівае шэраг прасунутых функцый, такіх як софтпатчынг і дасягненні (з дапамогай сэрвісу RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen – высокадакладны шматфункцыянальны эмулятар 16-бітнай прыстаўкі. Мае высокаю сумяшчальнасць з класічнымі гульнямі, у тым ліку эмуляцыю чыпаў пашырэнняў, у той жа час захоўваючы добрую прадукцыйнасць. У якасці ядра libretro Mesen падтрымлівае мноства прасунутых функцый, такіх як софтпатчынг і дасягненні (пасродкам сэрвісу RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA - хуткі і дакладны эмулятар адной з самых папулярных кансоляў, сумяшчальны з мноствам вядомых 8 - і 16-бітных гульняў. Нароўні з высокай дакладнасцю і хуткасцю эмуляцыі, mGBA мае шмат паляпшэнняў, сярод якіх загрузка карыстальніцкіх палітраў для гульняў з арыгінальнай выявай у адценнях шэрага і адлюстраваннем рамак у гульнях з іх падтрымкай.\n\nДадзены DLC дазваляе mGBA працаваць у RetroArch і выкарыстоўваць усе яго магчымасці, уключаючы перамотку ў рэальным часе, шэйдары постапрацоўкі і памяншэнне затрымкі ўводу для надання сучаснага аблічча нават класічным гульняў.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed з'яўляецца часткай шырокай лінейкі эмулятараў, у якую ўваходзяць PCSX-Reloaded, PCSX-df і арыгінальны PCSX. Як паходзіць з назвы, дадзены форк першапачаткова быў аптымізаваны для прылад з працэсарамі ARM, але пазней атрымаў шэраг змен для працы на звычайных ПК.\n\nУ якасці ядра libretro дадзенаму DLC неабходны інтэрфейс RetroArch, які дазваляе загрузіць ядро ​​і выкарыстоўваць яго для запуску гульняў і праграм, сумяшчальных з эмулятарам PCSX ReARMed. Для правільнай працы ядра патрабуюцца выявы BIOS кожнага рэгіёна (не ўключаны ў дадатак), скапіяваныя ў сістэмны каталог RetroArch.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy - гэта высокадакладны эмулятар, які паспяхова запускае нават тыя гульні, перад якімі пасуюць усе іншыя эмулятары. Акрамя высокай дакладнасці, SameBoy мае шэраг прыемных асаблівасцяў, такіх як выбар эмуляванай мадэлі прылады незалежна ад тыпу гульні, каляровыя палітры па выбары карыстальніка, убудаваны HLE BIOS, а таксама магчымасць загрузкі рамак для гульняў з іх падтрымкай.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella – гэта бясплатны open source эмулятар адной з самых папулярных і знакавых гульнявых кансоляў 1970-х і 80-х. Першапачаткова распрацаваны для аперацыйных сістэм GNU/Linux, эмулятар з часам быў партаваны на мноства іншых платформаў, у тым ліку libretro, які запускае яго з дапамогай гульнявой мультымедыйнай сістэмы RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nЗа апошнія гады распрацоўнікі Stella дамагліся значных поспехаў у імітацыі шматлікіх асаблівасцяў падтрымкі Stella кансоляў, забяспечыўшы сумяшчальнасць з масай цяжкаэмуляваных гульняў, homebrew праграм і дэмак.\n\nRetroArch дазволіць надаць гэтаму класічнаму эмулятару сучаснае аблічча з дапамогай перамоткі ў рэальным часе, RetroAchievements, лепшых у сваім класе шэйдараў для эмуляцыі ЭПТ-дысплеяў і іншых магчымасцяў.",
   "requirements": "Працэсар: Intel Pentium 4 ці вышэй (з абавязковай падтрымкай SSE2) \nПрацэсар (рэкамендуецца): Intel Core або эквівалентны AMD \nГрафіка: любы GPU з падтрымкай OpenGL 2.x ці Direct3D11. Падтрымка Shader Model не ніжэй версіі 2.0 для карэктнай працы шэйдараў \nГрафіка (рэкамендуецца): Intel: не ніжэй Intel HD 4K для OpenGL, любы GPU, сумяшчальны з D3D11 для Direct3D 11. Падтрымка Shader Model не ніжэй 3.0 і/або 4.0. \nЗаўвага: для OpenGL: на Windows 10 графічныя чыпы Intel HD 2K/3K будуць выкарыстоўваць драйвер OpenGL 1.1.",
   "legal-limits": "RetroArch з'яўляецца бясплатным праграмным забеспячэннем з адкрытым зыходным кодам, які распаўсюджваецца па ліцэнзіі GNU GPL 3.0.\nНе змяшчае матэрыялы трэціх асоб, абароненыя аўтарскім правам. RetroArch не патурае пірацтву ў любой форме."
}
