{
   "main-desc": "RetroArch ist ein quelloffenes und plattformübergreifendes Frontend/Framework für Emulatoren, Spiel-Engines, Videospiele, Media-Player und andere Anwendungen.\n\nObwohl es viele andere Dinge kann, ist es vor allem dafür bekannt, damit klassische Spiele auf einer breiten Palette von Computern und Konsolen über eine elegante grafische Oberfläche auszuführen. Die Einstellungen sind ebenfalls vereinheitlicht, so dass die Konfiguration ein für alle Mal erledigt ist.\n\nDarüber hinaus können gleich originale Spieldiscs (CDs) mittels RetroArch gespielt werden. Wir nehmen die Bewahrung von Videospielen ernst und möchten sicherstellen, dass die ursprünglich gekauften Inhalte auf modernen PCs ausgeführt werden können.\n\nRetroArch verfügt über fortschrittliche Funktionen wie Shader, Netplay, Rückspulen, Nextframe-Reaktionszeiten, Runahead und vieles mehr!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (auch bekannt als FBNeo) ist der neue offizielle Zweig des Final-Burn-Alpha-Emulators, der mit Hunderten von Arcade- und Konsolenspielen kompatibel ist. Der libretro-Core von FBNeo bringt dessen Bibliothek kompatibler Titel zu RetroArch, wobei die enge Integration des Cores mit der libretro-API es ermöglicht, RetroArch's fortgeschrittene Zeitverschiebungsfunktionen, wie Rollback-basiertes Netzwerkspiel und prädiktive Latenzreduzierung, zu nutzen. Es enthält Eingabevoreinstellungen für die automatische Zuordnung von Tasten für verschiedene Spiele, einschließlich Kampfspiel-Layouts für moderne und alte Arcade-Steuerungen (Fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX begann als Homebrew-Portierung des Genesis-Plus-Emulators für eine gehackte Konsole, bevor es auf libretro portiert wurde. Mit dem Fokus auf Geschwindigkeit, Genauigkeit und Portabilität erscheint Genesis Plus GX nun auf einer Vielzahl von Plattformen und Frontends und ist bekannt als einer der leistungsfähigsten und kompatibelsten Emulatoren für die SEGA-Konsolen, mit Unterstützung sowohl für Modul- als auch für CD-ROM-Spiele. Es funktioniert auch gut mit vielen der fortgeschrittenen Funktionen von RetroArch, wie Echtzeit-Zurückspulen, prädiktive Latenzreduzierung, Cheats und RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos ist ein moderner Zweig des UoYabause-Emulators, der selbst ein Zweig des ehrwürdigen Yabause-Emulators ist. Dieser DLC stellt den Kronos-libretro-Core für die Verwendung mit der RetroArch-Gaming- und Multimedia-Schnittstelle bereit, sodass Benutzer Software laden können, die mit dem Kronos-Emulator kompatibel ist.\n\nKronos nutzt moderne OpenGL-Funktionen, um eine Vielzahl zusätzlicher grafischer Funktionen, wie erhöhte interne Auflösung, zu bieten, weshalb eine aktuelle und einigermaßen leistungsstarke GPU empfohlen wird.\n\nKronos unterstützt das Laden von Spielen aus vielen verschiedenen Formaten, einschließlich ISO, BIN/CUE und dem komprimierten CHD-Format und benötigt externe BIOS-Dateien (saturn_bios.bin und stvbios.zip), welche entweder im \"System\"-Ordner von RetroArch oder neben der Zielsoftware vorhanden sein müssen, um korrekt zu funktionieren.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen ist ein hochpräziser und funktionsreicher Emulator mit Unterstützung für viele Cartridge-Mapper (auch für in seltsamen, nicht autorisierten Modulen verwendeten), benutzerdefinierte Farbpaletten und HD-Asset-Packs. Als libretro-Core, unterstützt Mesen viele erweiterte Funktionen, wie Softpatching und Erfolge (über den RetroAchievements-Dienst).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S ist ein hochpräziser und funktionsreicher 16-Bit-Konsolenemulator. Er hat eine hohe Kompatibilität und unterstützt die Add-On-Chips, die in vielen Spielen dieser Zeit verwendet wurden, und weist gleichzeitig eine hohe Leistung auf. Als libretro-Core unterstützt Mesen S viele erweiterte Funktionen wie Softpatching und Erfolge (über den RetroAchievements-Dienst).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA ist ein schneller und präziser Emulator für eine der beliebtesten und erfolgreichsten Handheld-Konsolen, der mit einer riesigen Bibliothek von vielgeliebten 8- und 16-Bit-Spielen kompatibel ist. Neben der Verpflichtung zu Geschwindigkeit und originalgetreuer Wiedergabe bietet mGBA eine Vielzahl großartiger Erweiterungsfunktionen, darunter die Unterstützung von benutzerdefinierten Paletten für Spiele, die ursprünglich in Graustufen dargestellt wurden, und die Anzeige von Rahmen für Spiele, die diese enthalten.\n\nMit diesem DLC kann mGBA über RetroArch ausgeführt werden, was Verbesserungen und Funktionen ermöglicht, wie Echtzeit-Zurückspulen, umfangreiche Nachbearbeitungs-Shader und Eingaben mit geringer Latenz, um auch bei klassischen Titeln ein modernes Spielerlebnis zu bieten.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed ist Teil einer langen Reihe von Emulatoren, zu denen PCSX-Reloaded, PCSX-df und natürlich das ursprüngliche PCSX gehören. Dieser spezielle Zweig wurde ursprünglich stark für Geräte mit ARM-CPUs optimiert, daher der Name, aber wir haben einige Dinge hinzugefügt, damit er auch auf typischer PC-Hardware gut funktioniert.\n\nAls libretro-Core benötigt dieser DLC die RetroArch-Schnittstelle, über die er geladen werden kann, um Spiele und Software auszuführen, die mit dem PCSX-ReARMed-Emulator kompatibel sind. Dieser Core benötigt ein BIOS-Image (nicht enthalten) für jede Region der Software im \"System\"-Verzeichnis von RetroArch, um ordnungsgemäß zu funktionieren.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Telefon).png[/img]\nSameBoy ist ein hochpräziser Emulator, der dafür bekannt ist, einige Spiele erfolgreich ausführen zu können, die andere Emulatoren zum Stolpern bringen. Zusätzlich zu dieser hohen Genauigkeit bietet SameBoy einige nützliche Funktionen wie die Möglichkeit, das zu emulierende Gerätemodell auszuwählen, unabhängig davon, für welches Modell das Spiel entwickelt wurde, vom Benutzer wählbare Farbpaletten, ein integriertes HLE-BIOS und die Möglichkeit, Rahmen bei den Spielen zu laden, die sie unterstützen.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella ist ein freier, quelloffener Emulator für eine der beliebtesten und einflussreichsten Heimvideospielkonsolen der 1970er- und 1980er-Jahre. Dieser Emulator wurde ursprünglich für die Verwendung unter dem GNU/Linux-Betriebssystem entwickelt, wurde jedoch im Laufe der Zeit auf viele verschiedene Plattformen portiert, einschließlich libretro, mit dem es über das RetroArch Spiel- und Multimedia-System ausgeführt werden kann.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nIn den letzten Jahren hat das Stella-Entwicklungsteam große Fortschritte bei der Nachahmung der vielen Eigenheiten der Zielkonsole von Stella gemacht, sodass es nun mit vielen schwer zu emulierenden Spielen, Homebrew-Software und Demos kompatibel ist.\n\nDurch RetroArch kannst Du diesem klassischen Emulator eine moderne Note verleihen, mit Echtzeit-Zurückspul-Funktion und RetroAchievements sowie RetroArchs erstklassigen Shadern für die Emulation von CRT-Displays und vielem mehr.",
   "requirements": "CPU: Intel Pentium 4 und höher (CPU mit SSE2 Anweisungen erforderlich) \nCPU-recommended: Intel Core Serie oder AMD-Äquivalent \nGraphics: Jede OpenGL 2.x oder Direct3D11 kompatible GPU. Damit Shader richtig funktionieren, sollte mindestens Shader Model 2.0 unterstützt werden. \nGraphics-recommended: Intel: Mindestens Intel HD 4K für OpenGL erforderlich, jede D3D11 kompatible GPU für Direct3D 11. Sollte mindestens Shader Model 3.0 und/oder 4.0 unterstützen. \nAdditional notes: Für OpenGL: Intel HD 2K/3K GPUs unter Windows 10 müssen auf einen OpenGL 1.1 Treiber zurückgreifen.",
   "legal-limits": "RetroArch ist freie/quelloffene Software, die unter der GNU GPL 3.0 Lizenz verfügbar ist. \nSie enthält kein urheberrechtlich geschütztes Material von Dritten. RetroArch duldet Piraterie in keiner Weise."
}
