{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, run-ahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and run-ahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main. ng[/img]\n\nكرونوس هي شوكة حديثة من محاكي أووياباتور الذي هو نفسه شوكة من محاكي يابوسا. يوفر DLC هذا نواة Kronos-libretro للاستخدام مع واجهة ألعاب RetroArch و متعدد الوسائط، السماح للمستخدمين بتحميل برنامج متوافق مع محاكاة كرونوس.\n\nيستخدم كرونوس قدرات OpenGL الحديثة لتوفير مجموعة متنوعة من الميزات البيانية الإضافية، ومن ذلك مثلا زيادة الاستبانة الداخلية، بحيث يوصى بتحديث وحدة البيانات العالمية وتأثيرها بدرجة معقولة.\n\nKronos يدعم ألعاب تحميل من العديد من الصيغ المختلفة، بما في ذلك ISO وBIN/CUE وتنسيق CHD المضغوط، ويتطلب ملفات BIOS الخارجية (saturn_bios. في و stvbios.zip) موضوعة إما في مجلد \"النظام\" الخاص بـ RetroArch، أو إلى جانب البرنامج المستهدف من أجل العمل بشكل صحيح.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2. ng[/img]\n\nMesen هو محاكي شديد الدقة ومليء بالميزات مع دعم أطنان من خرائط الخرطوشات (حتى تلك المستخدمة غريبة، عربات غير مصرح بها) ولوحات ألوان مخصصة وحزم أصول عالية الدقة. وبوصفه نواة ليبريترو، يدعم ميسين العديد من الميزات المتقدمة، مثل الترقية الناعمة والإنجازات (من خلال خدمة الأرصاد الجوية).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S هي محاكاة وحدة تحكم عالية الدقة وممتلئة بالميزة 16bit. وهي تتميز بدرجة عالية من التوافق، مع دعم الرقائق الإضافية المستخدمة في العديد من ألعاب العصر مع الحفاظ على الأداء العالي. وبوصفه نواة ليبريترو، يدعم Mesen S العديد من الميزات المتقدمة، مثل الترقية الناعمة والإنجازات (من خلال خدمة الأرصاد الجوية).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba. ng[/img]\n\nmGBA هو محاكي سريع ودقيق لواحدة من أكثر المحلات المحمولة اليدوية شعبية وأكثرها حببا، ولديها توافق مع المكتبة الضخمة من ألعاب النمط 8 و 16 بت وبالإضافة إلى الالتزام بالسرعة والإنجاب الصادق، فإن لمادة MGBA أيضا الكثير من سمات التعزيز الكبيرة، بما في ذلك دعم اللوحات المخصصة للألعاب التي كانت في الأصل رمادية وعرض الحدود للألعاب التي تشمل تلك الألعاب.\n\nهذا DLC يسمح لـ mGBA بالتشغيل من خلال RetroArch، الذي يضيف جميع تعزيزاته ومميزاته، بما في ذلك إعادة الرياح في الوقت الحقيقي، توسيع نطاق ظلال ما بعد التجهيز ومدخلات الوقت المنخفض لتوفير تجربة حديثة للألعاب حتى مع الألقاب الكلاسيكية.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX. ng[/img]\n\nPCSX ReARMed جزء من سلسلة طويلة من المحاكاة التي تشمل PCSX-Reloade, PCSX-df وبالطبع PCSX. تم في الأصل تحسين هذا الشوك بشكل كبير للأجهزة مع وحدات المعالجة المركزية ARM ، ومن ثم الاسم، لكننا أضيفنا في أشياء قليلة لجعلها تعمل بشكل جيد على أجهزة الكمبيوتر النموذجية، أيضًا.\n\nكنواة ليبريترو، يتطلب هذا DLC واجهة RetroArch، حيث يمكن تحميله كنواة لتشغيل الألعاب والبرمجيات المتوافقة مع محاكي PCSX. يتطلب هذا الأساس وضع صورة BIOS (غير مشمولة) لكل منطقة من البرنامج في دليل \"النظام\" الخاص بـ RetroArch، من أجل العمل بشكل صحيح.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(الهاتف). ng[/img]\nسامي بوي هو محاكي دقيق جدا ومعروف بالنجاح في تشغيل بعض الألعاب التي تتسبب في تعثر المحاكاة الآخرين. وبالإضافة إلى هذه الدقة العالية، يقوم سامي بوي أيضًا بالرياضة على بعض الميزات اللطيفة مثل القدرة على اختيار نموذج الجهاز الذي يحاكي بغض النظر عن النموذج الذي صممته اللعبة، لوحات الألوان الخاصة بالمستخدم, مدمجة في HLE BIOS والقدرة على تحميل الحدود على الألعاب التي تدعمها.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla. ng[/img]\n\nستيلا مجاني، محاكي مفتوح المصدر لواحدة من أكثر وحدات ألعاب الفيديو المنزلية شعبية وتأثيرا في السبعينات والثمانينيات. وقد استحدث هذا المحاكي أصلا لاستخدامه في نظام التشغيل GNU/Linux غير أنه مع مرور الزمن. تم ترحيلها إلى العديد من المنصات المختلفة، بما في ذلك libبكر، الذي يسمح لها باللعب من خلال نظام ألعاب RetroArch ونظام الوسائط المتعددة.\n\n[img]{STEAM_APP_IMAGE}/extras/2600. ng[/img]\n\nخلال السنتين الماضيتين، لقد قطع فريق تطوير ستيلا خطوات كبيرة في محاكاة العديد من وحدات ستيلا المستهدفة، جعله متوافقاً مع العديد من الألعاب التي يصعب محاكاتها، برامج الـ homebrew و التجريبية.\n\nمن خلال RetroArch، يمكنك جلب لمس حديث لهذا المحاكي الكلاسيكي، مع دعم الرحيم والإنجازات التراجعية في الوقت الحقيقي، بالإضافة إلى أفضل ظلال RetroArch، لCRT تعرض المحاكاة والمزيد.",
   "requirements": "وحدة المعالج: Inl Pentium 4 وما فوق (CPU مع تعليمات SSE2 مطلوبة) \nCPU-recommendded:Intel Core أو المكافئ AMD \nGraphics: أي OpenGL 2 متطابقة. أو التوجيه 3D11 GPU. لكي تعمل الظل بشكل صحيح، ينبغي أن تدعم على الأقل نموذج شادر 2.0. \nالرسوم البيانية الموصى بها: Intel: على الأقل Intel HD 4K مطلوبة ل OpenGL، أي D3D11 GPU ممتثلة للتوجيه 3D 11. ينبغي أن يدعم على الأقل نموذج شادر 3. و/أو 4.0. \nملاحظات إضافية: ل OpenGL: Intel HD 2K/3K GPUs على Windows 10 يجب أن تعود إلى سائق OpenGL 1.1.",
   "legal-limits": "ريتروآرتش عبارة عن برنامج مجاني/مفتوح المصدر، متاح بموجب رخصة جنو العمومية 3.0. \nلا يحتوي على أي مواد محفوظة بحقوق الطبع والنشر من قبل أطراف ثالثة. ريتروآرتش لا يتغاضى عن القرصنة بأي طريقة و بأي شكل من الأشكال."
}
