{
   "main-desc": "RetroArch - це відкритий та крос-платформенний фронтенд / фреймворк для емуляторів, ігрових двигунів, відеоігор, медіаплеєрів та інших програм.\n\nНезважаючи на те що крім цього, вiн може робити багато речей, він широко відомий тим, що дозволяє запускати класичні ігри на широкому спектрі комп'ютерів та консолей через графічний інтерфейс. Параметри також уніфіковані, тому конфігурація проводиться раз і назавжди.\n\nКрім цього, незабаром ви зможете запускати оригінальні ігрові диски (CD) від RetroArch. Ми серйозно ставимось до збереження відеоігор та хочемо переконатися, що ви можете запускати придбаний вами вміст на сучасних ПК.\n\nRetroArch має розширені функції, такі як шейдери, мережеве відтворення, перемотування, часи відгуку наступного кадру, пред-відтворення тощо!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (він же FBNeo) - це нова офіційна гілка емулятора Final Burn Alpha, сумісна із сотнями аркадних та консольних ігор. Ядро libretro FBNeo приносить свою бібліотеку сумісних назв до RetroArch, де тісна інтеграція ядра з libretro API дозволяє йому працювати з передовими функціями привязки до часу RetroArch, такими як синхронізований мережева гра та зменшення затримки. Він включає в себе попередні пресети для автоматичного відображення кнопок для різних ігор, включаючи схеми ведення ігор файтiнгiв як для сучасних, так і для олдскульних аркад (також з пiдтримкою ігрових стiкiв).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX почався як домашній порт емулятора Genesis Plus для зламаної консолі, перш ніж переноситися на libretro. Орієнтуючись на швидкість, точність та портативність, Genesis Plus GX тепер з'являється на різноманітних платформах і фронтендах, і відомий як один з найдієвіших і сумісніших емуляторів для консолей, на які вона ставиться, з підтримкою як картриджа, так і компакт-диска ігри. Він також добре працює з багатьма вдосконаленими функціями RetroArch, такими як перемотування в режимі реального часу, зменшення затримки, чіти та RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos - це сучасна вилка емулятора UoYabause, яка сама є вилкою поважного емулятора Yabause. Цей DLC пропонує ядро Kronos-libretro для використання з ігровим та мультимедійним інтерфейсом RetroArch, що дозволяє користувачам завантажувати програмне забезпечення, сумісне з емулятором Kronos.\n\nKronos використовує сучасні можливості OpenGL для надання різноманітних додаткових графічних функцій, таких як збільшення внутрішньої роздільної здатності, тому рекомендується сучасний і досить потужний GPU.\n\nKronos підтримує завантаження ігор із багатьох різних форматів, включаючи ISO, BIN / CUE та стислий формат CHD, і для цього потрібні зовнішні файли BIOS (saturn_bios.bin та stvbios.zip), розміщені або в папці \"system\" системи RetroArch, або поряд із цільовим програмним забезпеченням у щоб правильно функціонувати.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen - це дуже точний та наповнений функціоналом емулятор із підтримкою тонн картриджів картриджів (навіть тих, які використовуються для дивних, несанкціонованих візків), спеціальної палітри кольорів та пакетів HD. Як ядро libretro, Mesen підтримує багато вдосконалених функцій, таких як софтпачинг та досягнення (через сервіс RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S - це високоточний та точний 16-бітовий консольний емулятор. Він має високу сумісність, підтримуючи додаткові мікросхеми, що використовуються у багатьох іграх епохи, а також зберігаючи високу продуктивність. Будучи основним libretro, Mesen S підтримує багато вдосконалених функцій, таких як софтпатчинг та досягнення (через сервіс RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA - це швидкий, точний емулятор однієї з найпопулярніших і найулюбленіших портативних приставок, і він має сумісність з величезною бібліотекою улюблених 8 і 16-бітних ігор. На додаток до прихильності до швидкості та вірного відтворення, mGBA також має низку чудових функцій покращення, включаючи підтримку спеціальної палітри для ігор, які спочатку були відтінками сірого та відображали рамки для ігор, що включають їх.\n\nЦей DLC дозволяє mGBA запускатися через RetroArch, який додає всі його вдосконалення та функції, включаючи перемотування в режимі реального часу, шейдери та низький рівень затримки, щоб забезпечити сучасний ігровий досвід навіть із класичними назвами.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed - це частина довгого ряду емуляторів, що включає PCSX-Reloaded, PCSX-df і, звичайно, оригінальний PCSX. Ця вилка спочатку була сильно оптимізована для пристроїв із процесорами ARM, звідси і назва, але ми додали ще багато речей, щоб вона також добре працювала на типовому апаратному забезпеченні ПК.\n\nЯк ядро libretro, цей DLC вимагає інтерфейсу RetroArch, де він може бути завантажений як ядро для запуску ігор та програмного забезпечення, сумісних з емулятором PCSX ReARMed. Для забезпечення належного функціонування цього ядра потрібне зображення BIOS (не входить у комплект) для кожного регiону програмного забезпечення, щоб розмістити його в системному каталозі \"system\" RetroArch.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy - це дуже точний емулятор, відомий тим, що успішно працює з багатьма іграми, які не працюють на інших емуляторах. На додаток до цієї високої точності, SameBoy також має деякі приємні функції, такі як можливість вибору моделі пристрою для емуляції незалежно від того, для якої моделі призначена гра, вибрані користувачем палітри кольорів, вбудована HLE BIOS та можливість завантаження кордонів на ігри, які їх підтримують.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella - це безкоштовний емулятор з відкритим кодом для однієї з найпопулярніших і найвпливовіших консолей домашніх відеоігор 1970-х та 80-х. Цей емулятор спочатку був розроблений для використання в операційній системі GNU / Linux, але з часом був перенесений на багато різних платформ, включаючи libretro, що дозволяє йому грати через ігрові та мультимедійні системи RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nЗа останні кілька років команда розробників Stella досягла великих успіхів, наслідуючи багато примх цільової консолі Stella, зробивши її сумісною з багатьма складними для емуляції іграми, програмним забезпеченням для домашніх програм та демонстраційними версіями.\n\nЗавдяки RetroArch ви можете додати сучасний штрих до цього класичного емулятора, підтримуючи перемотування в реальному часі та RetroAchievements, а також найкращі шейдери RetroArch для емуляції дисплея CRT та багато іншого.",
   "requirements": "Процесор: Intel Pentium 4 і вище (потрібно ЦП з інструкціями SSE2) \nРекомендований процесор: Intel Core або AMD еквівалент \nГрафіка: всі сумісні з OpenGL 2.x або Direct3D11. Для коректної роботи шейдерів, відеокарта повинна мати підтримку принаймні шейдерної моделі 2.0. \nРекомендована графіка: Intel:Принаймні Intel HD 4K необхідний для OpenGL, будь-якого комп'ютера D3D11 для Direct3D 11. Повинна підтримувати принаймні шейдерна модель 3.0 та/або 4.0. \nДодаткові замітки: Для OpenGL: Intel HD 2K/3K GPUs на Windows 10 доведеться повернутися до драйвера OpenGL 1.1.",
   "legal-limits": "RetroArch - це вільне / відкрите програмне забезпечення, доступне за ліцензією GNU GPL 3.0.\nВін не містить матеріалів, захищених авторським правом, сторонніми особами. RetroArch ні в якому разі не потурає піратству."
}
