{
   "main-desc": "RetroArch on alustasta riippumaton avoimen lähdekoodin liittymä emulaattoreille, pelimoottoreille, videopeleille, mediasoittimille ja muille sovelluksille.\n\nVaikka RetroArchilla voi tehdä paljon muutakin, parhaiten se tunnetaan siitä, että sillä voi pyörittää klassikkopelejä laajalla tietokone- ja konsolivalikoimalla siistin graafisen käyttöliittymän kautta. Asetukset ovat myös yhtenäisiä, eli kokoonpano on kerrasta valmis.\n\nTämän lisäksi voit pian pyörittää pelien alkuperäisiä CD-levyjä RetroArchissa. Otamme videopelien säilytyksen vakavasti ja haluamme varmistaa, että voit pyörittää alun perin ostettua sisältöä moderneilla PC:illä.\n\nRetroArchissa on kehittyneitä ominaisuuksia, kuten varjostimet, verkkopeli, takaisinkelaus, seuraavan kehyksen vasteaika, edelläpyöritys, ynnä muuta!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (eli FBNeo) on Final Burn Alpha -emulaattorin uusi virallinen haara, joka on yhteensopiva satojen pelihalli- ja konsolipelien kanssa. Libretron FBNeo -ydin tuo yhteensopivan pelikirjastonsa RetroArchiin, jossa ytimen tarkka integrointi libretro-sovellusliittymän kanssa sallii sen toimia RetroArchin edistyneiden ajankääntöominaisuuksien kanssa, joita ovat esimerkiksi takaisinkelaus-pohjainen verkkopeli ja ennakoiva viiveen vähentäminen. Se sisältää pelikohtaiset esiasetukset automaattiselle painikkeiden kartoittamiselle, kuten tappelupelien asettelut, niin moderneille kuin vanhan koulukunnan pelihalliohjaimille (eli fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX alkoi homebrew-porttina Genesis Plus -emulaattorista hakkeroiduille konsoleille ennen kuin se siirrettiin libretrolle. Koska Genesis Plus GX keskittyy nopeuteen, tarkkuuteen ja siirrettävyyteen, se esiintyy monilla eri alustoilla ja käyttöliittymissä, ja se tunnetaan yhtenä taitavimmista ja yhteensopivimmista emulaattoreista tukemilleen konsoleille, kuten kaseteille ja CD-ROM -peleille. Se toimii hyvin myös monien RetroArchin edistyneiden ominaisuuksien, kuten reaaliaikainen takaisinkelauksen, ennakoivan viiveen vähentämisen, huijausten ja RetroAchievementsien kanssa.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos on moderni haara UoYabause-emulaattorista, joka itsessään on haara huomattavasta Yabause-emulaattorista. Tämä lisäosa tuo Kronos-libretro -ytimen RetroArchin peli- ja multimedialiittymään siten, että käyttäjät voivat käyttää ohjelmia, jotka ovat yhteensopivia Kronos-emulaattorin kanssa.\n\nKronos käyttää nykyaikaisia OpenGL-ominaisuuksia tarjoamaan erilaisia graafisia lisäominaisuuksia, kuten suurentuneen sisäisen resoluution, joten on suositeltavaa käyttää ajantasaista ja kohtuullisen tehokasta näytönohjainta.\n\nKronos tukee pelien lataamista monissa eri formaateissa, mukaan lukien ISO, BIN/CUE ja pakattu CHD -formaatti. Toimiakseen oikein se tarvitsee ulkoiset BIOS-tiedostot (saturn_bios.bin ja stvbios.zip) siirrettynä joko RetroArchin \"system\"-hakemistoon tai käytettävän ohjelmiston rinnalle.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen on todella tarkka ja ominaisuuksiltaan monipuolinen emulaattori, joka tukee monien pelikasettien kartastoja (jopa niitä, joita käytettiin oudoissa, luvattomissa pelikaseteissa), mukautettuja väripaletteja ja HD-ominaisuuspaketteja. Libretro-ytimenä Mesen tukee monia edistyneitä ominaisuuksia, kuten pehmeää korjausta ja saavutuksia (RetroAchievements-palvelun kautta).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S on erittäin tarkka ja ominaisuuksiltaan monipuolinen 16-bittisten konsolien emulaattori. Se sopii yhteen ja tukee monia peleissä aikanaan käytettyjä lisäosapiirejä säilyttäen silti korkean suorituskykynsä. Libretro-ytimenä Mesen S tukee monia edistyneitä ominaisuuksia, kuten pehmeää korjausta ja saavutuksia (RetroAchievements-palvelun kautta).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA on nopea ja tarkka emulaattori yhdelle suosituimmista ja rakastetuimmista käsikonsoleista, ja se on yhteensopiva suurimman osan 8- ja 16-bittisten pelien kanssa. Nopeuden ja uskollisen jäljentämisen lisäksi mGBA:lla on myös monia hyviä parannusominaisuuksia, kuten mukautetut paletit harmaasävyisille peleille, sekä kehykset peleihin, joissa sellaisia on ollut.\n\nTämän lisäosan avulla mGBA toimii RetroArchin kautta, joka lisää kaikki omat parannuksensa ja ominaisuutensa, mukaan lukien reaaliaikaisen kelauksen, laajat jälkikäsittelyvarjostimet ja alhaisen viiveensyötteen mahdollistaen modernin pelikokemuksen jopa klassikkopelien kanssa.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed on osa pitkän linjan emulaattoreita, johon kuuluvat PCSX-Reloaded, PCSX-df ja tietysti alkuperäinen PCSX. Tämä kyseinen haara oli nimensä mukaisesti optimoitu alkujaan laitteille, joissa on ARM-prosessori, mutta olemme lisäilleet siihen muutamia ominaisuuksia, jotka saavat sen toimimaan tavallisella PC:llä melko hyvin.\n\nLibretro-ytimenä tämä ladattava sisältö tarvitsee RetroArch-käyttöliittymän, jossa se voidaan ladata ytimeksi, jolloin sillä voidaan pyörittää pelejä ja ohjelmia, jotka ovat yhteensopivia PCSX ReARMed -emulaattorin kanssa. Tämä ydin tarvitsee BIOS-kuvakkeen (ei sisälly) jokaisen alueen ohjelmistoa varten, joka tulisi siirtää RetroArchin \"system\"-hakemistoon, jotta kaikki toimisi oikein.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy on erittäin tarkka emulaattori, joka tunnetaan kyvystään pyörittää muutamia pelejä, joissa muut emulaattorit kompuroivat. Suuren tarkkuutensa lisäksi SameBoy tukee myös hienoja ominaisuuksia, kuten ”mitä laitetta emuloida” -valintaa riippumatta siitä, mille laitteelle kyseinen peli on suunniteltu, käyttäjän valittavissa olevia väripaletteja, sisäänrakennettua HLE BIOS:ia ja pelien rajausominaisuutta.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella on ilmainen, avoimen lähdekoodin emulaattori yhdelle kaikista suosituimmista ja vaikuttavimmista 1970- ja 1980-luvun videopelikonsoleista. Tämä emulaattori kehitettiin alkujaan käytettäväksi GNU/Linux -käyttöjärjestelmälle, mutta ajan myötä se on käännetty monille eri alustoille, mukaan lukien libretrolle, jota voi käyttää RetroArch peli- ja multimediajärjestelmän kanssa.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nViime vuosina Stellan kehitystiimi on ottanut suuria harppauksia jäljitelläkseen Stellan kohdekonsolin monia erikoisuuksia, ja se on tehty yhteensopivaksi useiden vaikeasti emuloitavien pelien, homebrew:n ja demojen kanssa.\n\nRetroArch tuo modernin tuulahduksen tähän klassiseen emulaattoriin, kuten tuen reaaliaikaiseen kelaukseen, RetroAchievementsin sekä RetroArchin sarjan parhaita varjostimia kuvaputkitelevision emuloimiseen, ja paljon muuta.",
   "requirements": "Suoritin: Intel Pentium 4 ja uudemmat (Suoritin joka tukee SSE2-käskykantaa) \nSuoritinsuositus: Intelin Core-sarja tai vastaava AMD \nGrafiikka: Kaikki OpenGL 2.x tai Direct3D11 -yhteensopivat näytönhjaimet. Varjostinten kelvollinen toiminta vaatii Shader Model 2.0 -tuen. \nGrafiikkasuositus: Intel: Vähintään Intel HD 4K vaaditaan OpenGL:ää varten, mikä tahansa yhteensopiva D3D11-näytönohjain Direct3D 11:tä varten. Täytyy tukea ainakin Shader Model 3.0 ja/tai 4.0. \nLisähuomiot: OpenGL: Intel HD 2K/3K -näytönohjaimet Windows 10:llä täytyy takaisinpalata OpenGL 1.1 -ajuriin.",
   "legal-limits": "RetroArch on vapaa, avoimeen lähdekoodiin perustuva ohjelmisto, jonka kattaa GNU GPL 3.0 -lisenssi. \nSe ei sisällä mitään kolmansien osapuolten tekijänoikeuksin suojattua materiaalia. RetroArch ei hyväksy piratismia missään muodossa."
}
