{
   "main-desc": "A RetroArch egy nyílt forráskódú, többplatformos felület/keretrendszer emulátorok, játékmotorok, videójátékok, médialejátszók és egyéb alkalmazások számára.\n\nA szoftver számos funkciója közül a legnépszerűbb a klasszikus játékok futtatása számítógépek és konzolok széles skáláján, egy letisztult grafikus felületen keresztül. A beállítások egységesek, így elegendő egyszer megadni őket.\n\nEzen felül hamarosan lehetővé válik az eredeti játéklemezek (CD-k) közvetlen futtatása a RetroArch-ban. Komolyan vesszük a videójátékok megőrzését, és szeretnénk biztosítani, hogy az egykor megvásárolt tartalmak modern számítógépeken is elérhetők legyenek.\n\nA RetroArch számos olyan fejlett funkcióval rendelkezik, mint a shaderek, internetes játék, visszatekerés, reagálás egyetlen képkocka alatt, runahead és még sok más!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nA Final Burn Neo (más néven FBNeo) a Final Burn Alpha emulátor új hivatalos ága, amely több száz árkád- és konzoljátékkal kompatibilis. Az FBNeo libretro magja a kompatibilis címek könyvtárát hozza magával a RetroArch-ba, és itt a libretro interfésszel együttműködve lehetővé teszi a RetroArch időhajlító funkcióinak, például a rollback-alapú internetes játék és a run-ahead késleltetés-csökkentés használatát. Ez magában foglalja a bemeneti beállításokat a különböző játékok gombjainak automatikus leképezéséhez, beleértve a harci játékok elrendezéseit mind a modern, mind a régi árkád vezérlőkhöz (fightstick-ekhez).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nA Genesis Plus GX a Genesis Plus emulátor házi készítésű portjaként indult, mielőtt a libretro része lett. A sebességre, a pontosságra és a hordozhatóságra összpontosítva a Genesis Plus GX már számos platformon és frontenden elérhető, és az általa lefedett konzolok egyik leginkább kompatibilis emulátoraként ismert, mivel képes cartridge és CD-ROM játékok futtatására is. Emellett kiválóan működik a RetroArch számos fejlett funkciójával, mint például a valós idejű visszatekeréssel, a run-ahead késleltetés-csökkentéssel, csalásokkal és a RetroAchievements-szel.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nA Kronos az UoYabause emulátor modern leágazása, amely pedig a tiszteletreméltó Yabause emulátor leágazása. Ez a DLC biztosítja a Kronos-libretro magot a RetroArch játék- és multimédiás interfésszel való használatra, lehetővé téve a felhasználók számára, hogy a Kronos emulátorral kompatibilis szoftvert töltsenek be.\n\nA Kronos a modern OpenGL képességeket kihasználva számos extra grafikus funkciót kínál, mint például a megnövelt belső felbontás, emiatt egy korszerű és nagy teljesítményű videókártya ajánlott.\n\nA Kronos számos formátumú játékok betöltését támogatja, beleértve az ISO, BIN/CUE és a tömörített CHD formátumot. Külső BIOS fájlokat (saturn_bios.bin és stvbios.zip) igényel a működéshez, a RetroArch \"rendszer\" mappájába vagy a célszoftver mellé helyezve a helyes működés érdekében.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nA Mesen egy rendkívül pontos, funkciókkal teli emulátor, amely a rengeteg kazettaleképező mellett (a fura, nemhivatalos kazettákat is beleértve) egyedi színpalettákat és HD forráscsomagokat is támogat. Libretro magként a Mesen számos fejlett funkcióval rendelkezik, mint például a softpatching és a trófeák (a RetroAchievements szolgáltatáson keresztül).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nA Mesen S egy rendkívül pontos, funkciókkal teli 16 bites konzol emulátor. Nagy kompatibilitással rendelkezik, a korszak számos játékában használt kiegészítő chipek támogatásával, mindeközben fenntartja a nagy teljesítményt is. Libretro magként a Mesen S számos fejlett funkcióval rendelkezik, mint például a softpatching és a trófeák (a RetroAchievements szolgáltatáson keresztül).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nAz mGBA egy gyors, pontos emulátor az egyik legnépszerűbb és legkedveltebb hordozható konzolhoz, amely kompatibilis számos kedvelt 8- és 16-bites játékkal. A gyorsaság és a hűséges reprodukció iránti elkötelezettség mellett az mGBA rengeteg nagyszerű kiegészítő funkcióval is rendelkezik, beleértve az eredetileg szürkeárnyalatos játékok egyedi palettáinak támogatását, valamint keretek megjelenítését, ha a játék azt tartalmazza.\n\nEz a DLC lehetővé teszi az mGBA RetroArch-ból történő futtatását, amely elérhetővé teszi a fejlesztéseket, valamint a funkciókat, mint például a valós idejű visszatekerést, kiterjedt utófeldolgozási effekteket és alacsony késleltetésű bemenetet, a klasszikus címek modern játékélményéért.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nA PCSX ReARMed a PCSX-Reloaded, a PCSX-df és természetesen az eredeti PCSX emulátorok hosszú sorának a része. Ezt a verziót eredetileg ARM CPU-val rendelkező eszközökhöz optimalizálták, innen ered a név is, de jó néhány dolgot kiegészítettünk azzal, hogy a tipikus PC-hardvereken is jól működjön.\n\nLibretro magként ehhez a DLC-hez a RetroArch interfész szükséges, ahová magként tölthető be a PCSX ReARMed emulátorral kompatibilis játékok és szoftverek futtatásához. Ezen mag megfelelő működéséhez a szoftver minden egyes régiójához BIOS-képfájl szükséges (nem tartozék), amelyet a RetroArch \"rendszer\" könyvtárába kell helyezni.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nA SameBoy egy rendkívül pontos emulátor, amely néhány olyan játék sikeres futtatásáról ismert, amelyek más emulátoroknak nehézséget okoz. Ezen a nagy pontosságon kívül a SameBoy néhány jó funkciót is kínál, mint például az emulálandó eszközmodell kiválasztása, függetlenül attól, hogy a játék melyik modellhez készült, a felhasználó által választható színezési paletták, a beépített HLE BIOS és a keretek betöltésének lehetősége az őket támogató játékokban.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nA Stella egy ingyenes, nyílt forráskódú emulátor az 1970-es és 80-as évek egyik legnépszerűbb és legbefolyásosabb otthoni videojáték-konzoljához. Ez az emulátor eredetileg a GNU/Linux operációs rendszeren való használatra lett kifejlesztve, de idővel számos különböző platformra átírták, beleértve a libretro-t, így a RetroArch játék- és multimédiás rendszeren keresztül játszható.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nAz elmúlt néhány évben a Stella fejlesztőcsapata nagy lépéseket tett a Stella célkonzoljának sok egyedi furcsaságának utánzásában, így kompatibilis sok nehezen emulálható játékkal, homebrew szoftverrel és demókkal.\n\nA RetroArch révén modern megjelenést kölcsönöz ennek a klasszikus emulátornak, támogatva a valós idejű visszajátszást és a RetroAchievements-t, a RetroArch kategóriájában legjobb árnyékolóit a CRT kijelző emulációhoz, és így tovább.",
   "requirements": "Processzor: Intel Pentium 4 és újabb (CPU SSE2 utasításokkal) \nAjánlott processzor: Intel Core sorozat vagy ezzel egyenértékű AMD \nGrafika: Bármilyen OpenGL 2.x vagy Direct3D11 kompatibilis videokártya. Ahhoz, hogy a shader-ek (árnyékolók) megfelelően működjenek, legalább Shader Model 2.0 támogatás szükséges. \nAjánlott grafika: Intel-hez: OpenGL-hez legalább Intel HD 4K, Direct3D 11-hez bármilyen kompatibilis D3D11 GPU. Shader Model 3.0 és/vagy 4.0 támogatás.\nTovábbi megjegyzések: OpenGL esetén: Az Intel HD 2K/3K videokártyáknak vissza kell térniük az OpenGL 1.1 illesztőprogramra Windows 10 esetén.",
   "legal-limits": "A RetroArch ingyenes/nyílt forráskódú szoftver, amely a GNU GPL 3.0 licenc alatt érhető el. \nNem tartalmaz harmadik fél által szerzői joggal védett anyagot. A RetroArch semmilyen módon nem támogatja a kalózkodást."
}
