{
   "main-desc": "RetroArch è un frontend/framework open source e cross-platform per emulatori, motori di gioco, videogiochi, media player e altre applicazioni.\n\nMentre può fare molte cose oltre a questo, è più noto per consentire di eseguire giochi classici su una vasta gamma di computer e console attraverso un'interfaccia grafica slick. Anche le impostazioni sono unificate, quindi la configurazione viene eseguita una volta per tutte.\n\nIn aggiunta a questo, si sarà presto in grado di eseguire dischi di gioco originali (CD) da RetroArch. Prendiamo seriamente la conservazione del videogame e vogliamo assicurarti di poter eseguire i tuoi contenuti originariamente acquistati sui PC moderni.\n\nRetroArch ha funzionalità avanzate come shaders, netplay, riavvolgimento, tempi di risposta del prossimo frame, run-ahead, e altro ancora!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2. ng[/img]\n\nFinal Burn Neo (aka FBNeo) è la nuova sede ufficiale dell'emulatore Final Burn Alpha, che è compatibile con centinaia di giochi arcade e console. Il nucleo libretro di FBNeo porta la sua biblioteca di titoli compatibili a RetroArch, dove la stretta integrazione del nucleo con l'API libretro gli permette di lavorare con le funzionalità avanzate di piegatura temporale di RetroArch, come la reticolatura basata su rollback e la riduzione della latenza run-head. Include preset di input per la mappatura automatica dei pulsanti per diversi giochi, compresi i layout di gioco di combattimento sia per i controlli arcade moderni e di vecchia scuola (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone). ng[/img]\n\nGenesis Plus GX è iniziato come porta homebrew dell'emulatore Genesis Plus per una console hackerata prima di essere portato su libretro. Con particolare attenzione alla velocità, precisione e portabilità, Genesis Plus GX appare ora su una varietà di piattaforme e frontend, ed è conosciuto come uno degli emulatori più capaci e compatibili per le console che copre, con supporto sia per i giochi a testina che per quelli a CD-ROM. Funziona bene anche con molte delle funzionalità avanzate di RetroArch, come il rewind in tempo reale, la riduzione della latenza run-ahead e i trucchi e RetroAchievions.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main. ng[/img]\n\nKronos è una fork moderna dell'emulatore UoYabause, che è essa stessa una fork del venerabile emulatore Yabause. Questo DLC fornisce il core Kronos-libretro per l'uso con il gaming di RetroArch e l'interfaccia multimediale, permettendo agli utenti di caricare software compatibili con l'emulatore Kronos.\n\nKronos utilizza moderne funzionalità OpenGL per fornire una varietà di funzionalità grafiche extra, come una maggiore risoluzione interna, quindi si raccomanda una GPU aggiornata e ragionevolmente potente.\n\nKronos supporta inoltre il caricamento di giochi in molti formati diversi, tra cui ISO, BIN/CUE e il formato di CHD compresso, e richiede file BIOS esterni (saturn_bios.bin e stvbios.zip) posizionati nella cartella \"system\" di RetroArch, o accanto al software di destinazione per funzionare correttamente.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2. ng[/img]\n\nMesen è un emulatore altamente accurato e pieno di funzionalità, con supporto per moltissimi mapper delle cartucce (anche quelle usate per strane, cart non autorizzate), palette con colori personalizzati e pacchetti di risorse HD. Essendo un core libretro, Mesen supporta molte funzionalità avanzate, come il softpatching e trofei (attraverso il servizio RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S è un emulatore di console a 16 bit altamente accurato e pieno di funzionalità. Ha un'elevata compatibilità, con il supporto per i chip add-on utilizzati in molti giochi dell'epoca, mantenendo al contempo alte prestazioni. Essendo un core libretro, Mesen S supporta molte funzionalità avanzate, come il softpatching e Trofei (attraverso il servizio RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA è un emulatore rapido e preciso per una delle console portatili più popolari e molto amate, e ha compatibilità con una grande libreria di giochi molto amati in stile a 8 e a 16 bit. In aggiunta all'impegno per la velocità e la riproduzione fedele, mGBA ha anche moltissime grandi caratteristiche di miglioramento, compreso il supporto per palette personalizzate per giochi originariamente in scala di grigio e la visualizzazione di bordi per giochi che li includono.\n\nQuesto DLC permette a mGBA di avviarsi attraverso RetroArch, che aggiunge tutti i suoi miglioramenti e funzionalità, tra cui rewind in tempo reale, estese shader post-elaborazione e input a bassa latenza per fornire un'esperienza di gioco moderna anche con titoli classici.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed fa parte di una lunga linea di emulatori che include PCSX-Reloaded, PCSX-df e, naturalmente, il PCSX originale. Questo particolare ramo è stato originariamente pesantemente ottimizzato per dispositivi con CPU ARM, da cui il nome, ma gli abbiamo aggiunto un bel paio di cose per farlo funzionare bene sul tipico hardware del PC.\n\nCome core libretro, questo DLC richiede l'interfaccia di RetroArch, dove può essere caricato come core per avviare giochi e software compatibili con l'emulatore PCSX ReARMed. Questo core richiede che un'immagine BIOS (non inclusa) per ogni regione del software sia posizionata nella cartella \"system\" di RetroArch, al fine di funzionare correttamente.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy è un emulatore altamente accurato noto per aver eseguito con successo alcuni giochi che causano ad altri emulatori dei problemi. Oltre alla sua elevata precisione, SameBoy ha anche alcune caratteristiche piacevoli come la capacità di scegliere quale modello di dispositivo da emulare indipendentemente da quale modello il gioco è progettato per, palette di colorazione selezionabili dall'utente, BIOS HLE integrato e la capacità di caricare bordi sui giochi che li supportano.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella è un emulatore gratuito a fonte aperta per una delle console di videogiochi casalinghe più popolari e influenti degli anni '70 e '80. Questo emulatore è stato originariamente sviluppato per l'uso sul sistema operativo GNU/Linux, ma,nel tempo, è stato portato su molte piattaforme diverse, tra cui libretro, che gli permette di giocarlo attraverso il gaming di RetroArch e nel sistema multimediale.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nNegli ultimi due anni, il team di sviluppo Stella ha fatto grandi passi avanti nell'imitare le tante stranezze della console obiettivi di Stella, renderlo compatibile con molti giochi difficili da emulare, software homebrew e demo.\n\nAttraverso RetroArch, puoi portare un tocco moderno a questo emulatore classico, con il supporto per rewind in tempo reale e RetroAchievements, così come le shader migliori di RetroArch per l'emulazione dello schermo CRT e altro ancora.",
   "requirements": "CPU: Intel Pentium 4 e superiori (è richiesta una CPU che supporta le istruzioni SSE2) \nCPU raccomandata: Intel Core series o l'equivalente AMD \nScheda grafica: Qualsiasi GPU con OpenGL 2.x o Direct3D11. Per far funzionare correttamente gli shader, si dovrebbe supportare almeno Shader Model 2.0. \nScheda grafica consigliata: Intel: Almeno Intel HD 4K richiesta per OpenGL, qualsiasi GPU conforme a D3D11 per Direct3D 11. Dovrebbe supportare almeno Shader Model 3.0 e/o 4.0. \nNote aggiuntive: Per OpenGL: Intel HD 2K/3K GPU su Windows 10 andranno in fallback con un driver OpenGL 1.1.",
   "legal-limits": "RetroArch è un software libero/open source, disponibile sotto la licenza GNU GPL 3.0. \nNon contiene materiale protetto da diritti di autore di terze parti. RetroArch non condona la pirateria di nessun tipo, modo o forma."
}
