{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, run-ahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and run-ahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nA Kronos az UoYabause emulátor modern forkja, amely maga a tiszteletreméltó Yabause emulátor forkja. Ez a DLC biztosítja a Kronos-libretro magot a RetroArch játék- és multimédiás interfésszel való használatra, lehetővé téve a felhasználók számára, hogy a Kronos emulátorral kompatibilis szoftvert töltsenek be.\n\nA Kronos a modern OpenGL képességeket kihasználva számos extra grafikus funkciót kínál, mint például a megnövekedett belső felbontás, emiatt egy korszerű és nagy teljesítményű videókártya ajánlott.\n\nA Kronos számos formátumú játékok betöltését támogatja, beleértve az ISO, BIN/CUE és a tömörített CHD formátumot, valamint külső BIOS fájlokat (saturn_bios.bin és stvbios.zip) a RetroArch \"rendszer\" mappájába vagy a célszoftver mellé helyezve a helyes működés érdekében.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nA Mesen egy rendkívül pontos, funkciókkal teli emulátor, amely a rengeteg kazettaleképező mellett (kívülálló, illetéktelen kazettákat is beleértve) egyedi színpalettákat és HD forráscsomagokat is támogat. Libretro magként a Mesen számos fejlett funkcióval rendelkezik, mint például a softpatching és a teljesítményelérés (a RetroAchievements szolgáltatáson keresztül).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nA Mesen S egy rendkívül pontos, funkciókkal teli 16 bites konzol emulátor. Nagy kompatibilitással rendelkezik, a korszak számos játékában használt kiegészítő chipek támogatásával, mindeközben fenntartja a nagy teljesítményt is. Libretro mag, a Mesen S számos fejlett funkcióval rendelkezik, mint például a softpatching és a teljesítményelérés (a RetroAchievements szolgáltatáson keresztül).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nAz mGBA egy gyors, pontos emulátor az egyik legnépszerűbb és legkedveltebb hordozható konzolhoz, amely kompatibilis számos kedvelt 8- és 16-bites játékkal. A gyorsaság és a hűséges reprodukció iránti elkötelezettség mellett az mGBA rengeteg nagyszerű kiegészítő funkcióval is rendelkezik, beleértve az eredetileg szürkeárnyalatos játékok egyedi palettáinak támogatását, valamint az azokat tartalmazó játékok határainak megjelenítését.\n\nEz a DLC lehetővé teszi az mGBA RetroArch-ból történő futtatását, amely hozzáteszi a fejlesztéseket, valamint a funkciókat, beleértve a valós idejű visszatekerést, kiterjedt utófeldolgozási effekteket és alacsony késleltetésű bemenetet a klasszikus címek modern játékélményéért.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nA PCSX ReARMed a PCSX-Reloaded, a PCSX-df és természetesen az eredeti PCSX emulátorok hosszú sorának a része. Ezt a verziót eredetileg ARM CPU-val rendelkező eszközökhöz optimalizálták, innen ered a név is, de jó néhány dolgot kiegészítettünk azzal, hogy a tipikus PC-hardvereken is jól működjön.\n\nLibretro magként ehhez a DLC-hez a RetroArch interfész szükséges, ahová magként tölthető be a PCSX ReARMed emulátorral kompatibilis játékok és szoftverek futtatásához. Ennek a magnak a megfelelő működéséhez a szoftver minden egyes régiójához BIOS-lemezkép szükséges (nem tartozék), amelyet a RetroArch \"rendszer\" könyvtárába kell helyezni.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nA SameBoy egy rendkívül pontos emulátor, amely néhány olyan játék sikeres futtatásáról ismert, amelyek más emulátoroknak nehézséget okoz. Ezen a nagy pontosságon kívül a SameBoy néhány jó funkciót is kínál, mint például az emulálandó eszközmodell kiválasztása, függetlenül attól, hogy a játék melyik modellhez készült, a felhasználó által választható színezési paletták, a beépített HLE BIOS és a keretek betöltésének lehetősége az őket támogató játékokban.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nA Stella egy ingyenes, nyílt forráskódú emulátor az 1970-es és 80-as évek egyik legnépszerűbb és legbefolyásosabb otthoni videojáték-konzoljához. Ez az emulátor eredetileg a GNU/Linux operációs rendszeren való használatra lett kifejlesztve, de idővel számos különböző platformra került, beleértve a libretro -t, amely lehetővé teszi, hogy játsszon a RetroArch játék- és multimédiás rendszeren.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nAz elmúlt néhány évben a Stella fejlesztőcsapata nagy lépéseket tett a Stella célkonzoljának sok különlegességeinek utánzásában, így kompatibilis a sok nehezen emulálható játékkal, a homebrew szoftverrel és a demókkal.\n\nA RetroArch révén modern megjelenést kölcsönöz ennek a klasszikus emulátornak, támogatva a valós idejű visszajátszást és a RetroAchievements-t, valamint a RetroArch osztályának legjobb árnyékolóit a CRT kijelző emulációhoz és így tovább.",
   "requirements": "Processzor: Intel Pentium 4 és újabb (CPU SSE2 utasításokkal).\nAjánlott processzor: Intel Core sorozat vagy AMD-vel egyenértékű.\nGrafika: Bármilyen OpenGL 2.x vagy Direct3D11 kompatibilis videokártya(GPU). Ahhoz, hogy a shader-ek (árnyékolók) megfelelően működjenek, legalább a Shader Model 2.0 szabványt kell támogatnia.\nAjánlott-grafika: Intel-hez:Legalább Intel HD 4K szükséges az OpenGL-hez, minden kompatibilis D3D11 GPU a Direct3D 11-hez. Legalább a Shader 3.0 és/vagy 4.0 szabványt kell támogatnia\nTovábbi megjegyzések: OpenGL esetén: A Windows 10 -es Intel HD 2K/3K videokártyáknak(GPU-nak) vissza kell térniük az OpenGL 1.1 illesztőprogramra.",
   "legal-limits": "A RetroArch ingyenes/nyílt forráskódú szoftver, amely a GNU GPL 3.0 licenc alatt érhető el. \nNem tartalmaz harmadik fél által szerzői joggal védett anyagot. A RetroArch semmilyen módon nem támogatja a kalózkodást."
}
