{
   "main-desc": "RetroArch は, エミュレータ, ゲームエンジン, ビデオゲーム, メディアプレイヤー, その他のアプリケーションのためのオープンソースでクロスプラットフォームなフロントエンド/フレームワークです.\n\nこれ以外にも多くのことができますが, 最も広く知られているのは, 洗練されたグラフィカルなインターフェイスを通じて, さまざまなコンピュータやコンソール上でクラシックなゲームを実行できるようにすることです. 設定も統一されているので, すべて一度で完了します.\n\nこれに加えて, RetroArchのオリジナルゲームディスク(CD)も間もなく起動できるようになります. 私たちはビデオゲームの保存に真剣に取り組んでおり, 購入したオリジナルコンテンツを現代のPCで実行できるようにしたいと考えています.\n\nRetroArchには, シェーダ, ネットプレイ, 巻き戻し, 次のフレームの応答時間, ランヘッドなどの高度な機能が搭載されています!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (別名 FBNeo) は, 何百ものアーケードゲームやコンソールゲームと互換性のある Final Burn Alpha エミュレータの新しい公式ブランチです. FBNeo の libretro コアは, 互換性のあるタイトルのライブラリを RetroArch にもたらし, コアが libretro API と緊密に統合されているため, ロールバックベースのネットプレイやランヘッドのレイテンシ削減など, RetroArch の高度なタイムベンディング機能と連携することができます. また, さまざまなゲーム用のボタンを自動的にマッピングするための入力プリセットも用意されており, 現代的なものと昔ながらのアーケード コントロール (別名ファイトスティック) 用の格闘ゲーム レイアウトなども用意されています. ",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GXは, libretroに移植される前に, ハックされたコンソール用のGenesis Plusエミュレータの自作移植として始まりました. スピード, 正確さ, 移植性を重視した Genesis Plus GX は, 現在ではさまざまなプラットフォームやフロントエンドで使用されており, カートリッジと CD-ROM ゲームの両方をサポートしており, カバーしているコンソール用の最も有能で互換性のあるエミュレータのひとつとして知られています. また, リアルタイム巻き戻し, ランヘッドレイテンシーの低減, チート, RetroAchievementsなど, RetroArchの高度な機能の多くと相性が良いです. ",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronosは, それ自体が由緒あるYabauseエミュレータのフォークであるUoYabauseエミュレータの現代的なフォークです. このDLCは, RetroArchのゲームおよびマルチメディアインターフェイスで使用するためのKronos-libretroコアを提供し, ユーザーがKronosエミュレータと互換性のあるソフトウェアをロードすることを可能にします. \n\nKronosは最新のOpenGL機能を利用して, 内部解像度の向上など, さまざまな追加のグラフィカル機能を提供します. \n\nKronosは, ISO, BIN/CUE, 圧縮されたCHDフォーマットを含む多くの異なるフォーマットからのゲームのロードをサポートしており, 正しく機能するためには, RetroArchの \"system \"フォルダ内またはターゲットソフトウェアと一緒に置かれた外部BIOSファイル（saturn_bios.binとstvbios.zip）が必要です. ",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen は高精度で機能満載のエミュレータで, 膨大な数のカートリッジマッパー (奇妙で非公認のカートに使われているものも), カスタムカラーパレットや HD アセットパックをサポートしています. Libretroのコアとして, Mesen はソフトパッチやアチーブメント (RetroAchievements サービスを通して) のような多くの高度な機能をサポートしています. ",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen Sは, 高精度で機能満載の16bitコンソールエミュレータです. 高い性能を維持しつつ, 当時の多くのゲームで使用されていたアドオンチップをサポートするなど, 高い互換性を持っています. LibretroコアであるMesen Sは, ソフトパッチやアチーブメント（RetroAchievementsサービスによる）など, 多くの高度な機能をサポートしています. ",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBAは, 最も人気があり愛されている携帯ゲーム機の1つである高速で正確なエミュレータであり, 人気の高い8ビットおよび16ビットスタイルのゲームの膨大なライブラリと互換性があります. スピードと忠実な再現性へのこだわりに加えて, mGBAは, もともとグレースケールだったゲームのカスタムパレットのサポートや, それを含むゲームのボーダー表示など, 多くの素晴らしい拡張機能を備えています. \n\nこのDLCにより, mGBAはRetroArchを介して動作し, リアルタイム巻き戻し, 広範なポスト処理シェーダー, 低レイテンシー入力など, すべての機能強化と機能が追加され, クラシックタイトルでもモダンなゲーム体験を提供することができます. ",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed は, PCSX-Reloaded, PCSX-df, そしてもちろんオリジナルの PCSX を含む長いエミュレータのラインの一部です. この特定のフォークは, もともと ARM CPU を搭載したデバイス向けに大きく最適化されていたため, その名が付いていますが, 一般的な PC ハードウェアでも動作するように, かなりの数のものを追加しました. \n\nLibretroコアとして, この DLC は RetroArch インターフェイスを必要とし, PCSX ReARMed エミュレータと互換性のあるゲームやソフトウェアを実行するためのコアとしてロードすることができます. このコアが正常に機能するためには, ソフトウェアの各リージョンに対応したBIOSイメージ(同梱されていない)をRetroArchの「システム」ディレクトリに配置する必要があります. ",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\n\nSameBoyは, 他のエミュレータがつまずく原因となるいくつかのゲームの実行に成功したことで知られている高精度エミュレータです. この高精度に加えて, SameBoyは, ゲームがどのモデル用に設計されているかに関係なくエミュレートするデバイスモデルを選択できる機能, ユーザーが選択可能なカラー化パレット, 内蔵のHLE BIOS, そしてそれらをサポートするゲームにボーダーをロードする機能など, いくつかの優れた機能を備えています. ",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStellaは, 1970年代から80年代にかけて最も人気があり, 影響力のあった家庭用ゲーム機の一つであるStella用のフリーのオープンソースエミュレータです. このエミュレータはもともと GNU/Linux オペレーティングシステム用に開発されましたが, 時を経て libretro を含む多くの異なるプラットフォームに移植され, RetroArch ゲームやマルチメディアシステムでプレイできるようになりました. \n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nここ数年, Stella開発チームはStellaのターゲットコンソールの多くの特徴を模倣し, エミュレートが困難なゲームや自作ソフトウェア, デモとの互換性を実現するために大きな進歩を遂げてきました. \n\nRetroArchを使えば, リアルタイム巻き戻しやRetroAchievements, CRTディスプレイエミュレーション用のRetroArchのクラス最高のシェーダーなどをサポートし, このクラシックなエミュレータに現代的なタッチを加えることができます. ",
   "requirements": "CPU: Intel Pentium 4以上（SSE2の指示が必要なCPU) \n推奨CPU: Intel CoreシリーズまたはAMDと同等のもの\nグラフィックス: OpenGL 2.xまたはDirect3D11に準拠したGPU. シェーダーが正しく動作するためには, 少なくともシェーダーモデル2.0をサポートしている必要があります. \n推奨グラフィックス: Intel: OpenGLには少なくともIntel HD 4Kが必要で, Direct3D 11の利用にはD3D11に準拠したGPUが必要です. シェーダーモデル3.0および/または4.0以上をサポートしている必要があります. \nその他の注意事項: OpenGLの場合：Windows 10上のIntel HD 2K/3K GPUは, OpenGL 1.1ドライバにフォールバックする必要があります. ",
   "legal-limits": "RetroArchはフリー/オープンソース・ソフトウェアで, GNU GPL 3.0ライセンスで利用可能です. \nサードパーティによる著作権で保護されたものは一切含まれていません. RetroArch は, いかなる形であれ海賊行為を容認するものではありません. "
}
