{
   "main-desc": "RetroArch er en åpen kildekode og frontend/rammeverk på tvers av plattformer for emulatorer, spillmotorer, videospill, mediespillere og andre applikasjoner.\n\nSelv om den kan gjøre mange ting i tillegg til dette, er den mest kjent for å la deg kjøre klassiske spill på et bredt spekter av datamaskiner og konsoller gjennom et flott grafisk grensesnitt. Innstillingene er også totale slik at konfigurasjonen gjøres en gang, for alle.\n\nI tillegg til dette vil du snart kunne kjøre originale spillplater (CDer) fra RetroArch. Vi tar bevaring av videospill på alvor og ønsker å sikre at du kan kjøre det opprinnelig kjøpte innholdet på moderne PC-er.\n\nRetroArch har avanserte funksjoner som skyggelegging, nettspill, tilbakespoling, responstider for neste bilde, fremkjøring og mer!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2. ng[/img]\n\nFinal Burn Neo (alias FBALIM) er den nye offisielle grenen av Final Burn Alpha emulatoren. som er kompatibel med hundrevis av arcade og konsollspill. libretro Kjernen av FBNeo gir biblioteket tilgang til kompatible titler til RetroArch, der kjernens stramme integrasjon med libretro API gjør det mulig å arbeide med RetroArchs avanserte tidsbøye-funksjoner som rollback-basert nettspill og run-ahead latens reduksjon. Den inkluderer forhåndsinnstillinger for automatisk kartlegging av knapper for forskjellige spill, inkludert slåssespill for både moderne og gamle arkade type kontrollere (alias fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone). ng[/img]\n\nGenesis Plus GX startet som en hjemmelagd utgave av Genesis Plus-emulatoren for en hacket konsoll før den ble bygd om til en libretro kjerne. Med fokus på hastighet, nøyaktighet og portabilitet kan Genesis Plus GX nå vises på ulike plattformer og frontender. den er kjent som en av de mest egnede og kompatible emulatorene for konsollene den dekker, med støtte for både kassett og CD-ROM-spill. Den arbeider også godt med mange av RetroArchs avanserte funksjoner, som for eksempel å omvind, redusere ventetid, juksing og RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main. ng[/img]\n\nKronos er en moderne gren av UoYabause-emulatoren som selv er en gren av den kjente Yabause-emulatoren. Dette nedlastbare innholder tilbyr Kronos-libretro kjernen for bruk i RetroArch-spill og multimedia-grensesnittet, gjør at brukere kan laste inn programvare som er kompatibel med Kronos-emulatoren.\n\nKronos bruker moderne OpenGL evner for å gi en rekke ekstra grafiske funksjoner, slike som økt intern oppløsning, så det anbefales et oppdatert og kraftig grafikkkort\n\nKronos støtter lasting av spill fra mange forskjellige formater, inkludert ISO, BIN/CUE og det komprimerte CHD-formatet, og den krever eksterne BIOS-filer (saturn_bios. og stvbios.zip) plassert enten i RetroArchs \"system\" mappe eller sammen med målprogramvaren for å fungere riktig.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/ekstras/mesen2. ng[/img]\n\nMesen er en svært nøyaktig og funksjonsfylt emulator med støtte for tonnevis av kasetter (også de rare uautoriserte kassettene), tilpassede fargepaletter og høydefinisjons elementpakker. Som en libretro kjerne, støtter Mesen mange avanserte funksjoner, som for eksempel softpatching og prestasjoner (ved hjelp av RetroAchievements tjenesten).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S er en svært nøyaktig og funksjonsfylt 16biters emulator. Den har høy kompatibilitet, men er også en støtte for tilleggsbrikker som brukes i mange spill av tidsalderen, samtidig som den har høy ytelse. Som en libretro kjerne, støtter Mesen S mange avanserte funksjoner, som for eksempel softpatching og prestasjoner (ved hjelp av RetroAchievements tjenesten).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/ekstras/mgba. ng[/img]\n\nmGBA er en hurtig, nøyaktig emulator for en av de mest populære og kjente håndholdte konsollene. Og den har kompatibilitet med et enormt bibliotek av elskede 8- og 16-biters spill. I tillegg til satsinga på fart og trofast reproduksjon, har mGBA et tonn med store forbedringer, inkludert støtte for egendefinerte paletter for spill som opprinnelig var gråtoner og vise rammer for spill som inkluderer dem.\n\nDenne DLC tillater mGBA å kjøre gjennom RetroArch, som legger til alle sine forbedringer og funksjoner, inkludert et sanntidsvindu, omfattende postprosesserings-skyggelegging og lav-latens kontroll for å gi en moderne spillopplevelse selv med klassiske titler.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/ekstras/PCSX. ng[/img]\n\nPCSX ReARMed er en del av en lang linje med emulatorer som inkluderer PCSX-Reloaded, PCSX-df og selvfølgelig den opprinnelige PCSX. Denne bestemte grenen ble opprinnelig sterkt optimalisert for enheter med ARM-CPU, derav navn, men vi har lagt til mange optimiseringer for typisk PC-maskinvare, i tillegg.\n\nSom libretro kjerne, krever dette nedlastbare innholdet RetroArch grensesnittet, der den kan lastes som en kjerne for å kjøre spill og programvare som er kompatible med emulatoren PCSX ReARVA. Denne kjernen krever en BIOS fil (ikke inkludert) for hvert område av programvaren som skal plasseres i RetroArch's \"system\" mappe for å kunne fungere riktig.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy er en svært nøyaktig emulator kjent for å lykkes med å kjøre spill som får andre emulatorer til å snuble. I tillegg til høy nøyaktighet har SameBoy også noen fine funksjoner, som muligheten til å velge hvilken enhets-modell som skal emuleres uavhengig av hvilken modell spillet er designet for, brukervalgte fargepaletter, en innebygd HLE BIOS og muligheten til å bruke rammer for spill som støtter dem.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/ekstras/stealla. ng[/img]\n\nStella er en gratis emulator med åpen kildekode for en av de mest populære og innflytelsesrike spillkonsollene i 1970 og 80-årene. Denne emulatoren ble opprinnelig utviklet for bruk på GNU/Linux operativsystemet, men har over tid har blitt eksportert til mange ulike plattformer, blant annet libretro, som lar den spille gjennom RetroArch og multimedia-systemet.\n\n[img]{STEAM_APP_IMAGE}/ekstras/2600. ng[/img]\n\nde siste par årene Stella development team har satt store skritt i å etterligne de mange finurlighetene på Stellas målkonsoll, for å gjøre den kompatibel med mange spill som er vanskelig å emulere, homebrew programvare og demoer.\n\nGjennom RetroArch kan du ta med deg et moderne preg til denne klassiske emulatoren, med støtte for tilbakespoling i sanntid og en av RetroArchs best i klasse komponenter for CRT-visnings modulering og mer til.",
   "requirements": "CPU: Intel Pentium 4 og opp (CPU med SSE2 instruksjoner kreves) \nCPU-anbefalt:Intel Core-serie eller AMD tilsvarende \nGrafikk: kompatibel med OpenGL 2. eller Direct3D11 Grafikk-kort. For at shadere skal fungere skikkelig, bør den støtte minst Shader Model 2.0. \nGraffikk anbefalt: Intel: Minimum Intel HD 4K trengs for OpenGL, enhver kompatibel D3D11 Grafikk-kort for Direct3D 11. Bør støtte minst Shader Model 3. og/eller 4,0. \nekstra merknader: For OpenGL: Intel HD 2K/3K vil Grafikk-kort på Windows 10 måtte falle tilbake til en OpenGL 1.1 driveren.",
   "legal-limits": "RetroArch er en fri og åpen kildekode-programvare, tilgjengelig under GNU GPL 3.0. \nDet inneholder ikke noe opphavsrett-materiale av tredjeparter. RetroArch støtter ikke brudd på opphavsrett på noen måte."
}
