{
   "main-desc": "RetroArch to program open source i wieloplatformowy frontend/framework dla emulatorów, silników gier, gier wideo, odtwarzaczy multimediów i innych aplikacji.\n\nMimo iż potrafili wiele więcej, jest on szeroko znany przede wszystkim z uruchamiania klasycznych gier na szerokiej gamie komputerów i konsol za pomocą prostego interfejsu graficznego. Ustawienia są również zunifikowane, więc konfiguracja jest wykonywana raz na zawsze.\n\nPonadto wkrótce będziesz mógł uruchamiać oryginalne dyski (płyty CD) z grami poprzez RetroArch. Poważnie podchodzimy do kwestii konserwacji gier wideo i chcemy zapewność możliwość, uruchamiania twojej oryginalnej zakupionej zawartości na współczesnych komputerach.\n\nRetroArch posiada zaawansowane funkcje, takie jak shadery, netplay, przewijanie, czas reakcji jednej klatki, run-ahead i wiele więcej!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (aka FBNeo) to nowy, oficjalny branch emulatora Final Burn Alpha, który jest kompatybilny z setkami gier na automaty i konsole. Rdzeń libretro FBNeo sprowadza bibliotekę kompatybilnych tytułów do RetroArch, gdzie ścisła integracja rdzenia z interfejsem libretro pozwala na użycie zaawansowanych, zaginających czas funkcji RetroArch, takich jak netplay i redukcja opóźnień run-ahead. Zawiera schematy sterowania dla automatycznego przypisania przycisków dla różnych gier, w tym także układy dla bijatyk, zarówno dla współczesnych kontrolerów, jak i klasycznych kontrolerów arcade (aka fightsticki).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nZanim Genesis Plus GX został przeniesiony do libretro, rozpoczął się on jako domowy port emulatora Genesis Plus dla zhakowanej konsoli. Skoncentrowany na szybkości, dokładności i przenośności, Genesis Plus GX pojawia się obecnie na różnych platformach i frontendach, i jest znany jako jeden z najwydajniejszych i najbardziej kompatybilnych emulatorów swojej konsoli, który obsługuje zarówno gry na kartridżach, jak i CD-ROM. Działa również dobrze z wieloma zaawansowanymi funkcjami RetroArcha, takimi jak: przewijanie w czasie rzeczywistym, redukcja opóźnień run-ahead, oszustwa i osiągnięcia RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos to nowoczesny fork emulatora UoYabause, który sam jest forkiem wiekowego emulatora Yabause. To DLC zawiera rdzeń Kronos-libretro, dla interfejsu gier i multimediów RetroArch, umożliwiające użytkownikom uruchamianie oprogramowania kompatybilnego z emulatorem Kronos.\n\nKronos wykorzystuje nowoczesne możliwości OpenGL, aby zapewnienić wiele dodatkowych funkcji graficznych, takich jak większa rozdzielczość wewnętrzna, dlatego zalecane jest posiadanie aktualnego i dość wydajnego GPU.\n\nKronos wspiera ładowanie gier z wielu różnych formatów, w tym ISO, BIN/CUE i skompresowanego formatu CHD oraz wymaga zewnętrznych plików BIOS (saturn_bios. w i stvbios.zip) umieszczonych w folderze „system” RetroArcha lub obok docelowego oprogramowania w celu poprawnego działania.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2. ng[/img]\n\nMesen to bardzo dokładny i pełen funkcji emulator z obsługą wielu mapowania kartridży (nawet tych używanych w dziwnych, nieautoryzowanych kartów), niestandardowych palet kolorów i pakietów zasobów HD. Jako rdzeń libretro, Mesen obsługuje wiele zaawansowanych funkcji, takich jak softpatching i osiągnięcia (za pośrednictwem usługi RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S to bardzo dokładny i pełen funkcji emulator konsoli 16-bitowej. Ma wysoką kompatybilność, obsługuje dodatkowe układy używane w wielu grach z tamtej epoki, jednocześnie zachowując wysoką wydajność. Jako rdzeń libretro, Mesen S obsługuje wiele zaawansowanych funkcji, takich jak softpatching i osiągnięcia (poprzez usługę RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA to szybki i dokładny emulator jednej z najpopularniejszych i najbardziej lubianych konsol przenośnych. Jest kompatybilny z wielką biblioteką lubianych gier 8- i 16-bitowych. Oprócz dbałości o szybkość i wierne odwzorowanie mGBA zawiera bardzo wiele nowych funkcji, takich jak wsparcie dla niestandardowych palet kolorów dla gier, które oryginalnie były monochromatyczne oraz wyświetlanie obramowań dla gier, które je posiadają.\n\nTo DLC pozwala na uruchamianie mGBA w RetroArch, udostępniając wszystkie jego ulepszenia i funkcje, w tym przewijanie w czasie rzeczywistym, obszerna biblioteka shaderów i wprowadzanie działań o niskim opóźnieniu by zapewnić współczesne doświadczenie w klasycznych grach.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX. na[/img]\nPCSX ReARMed jest częścią długiej linii emulatorów, która obejmuje PCSX-Reloaded, PCSX-df i, oczywiście, oryginalny PCSX. Ten konkretny fork był pierwotnie mocno zoptymalizowany pod kątem urządzeń z procesorami ARM, stąd nazwa, ale dodaliśmy z powrotem kilka rzeczy, aby działał dobrze również na typowym sprzęcie PC.\n\nJako rdzeń libretro, to DLC wymaga interfejsu RetroArch, w którym można go załadować jako rdzeń do uruchamiania gier i oprogramowania kompatybilnego z emulatorem PCSX ReARMed. Ten rdzeń do poprawnego działania wymaga, aby obraz BIOS-u (brak w zestawie) dla każdego regionu oprogramowania został umieszczony w katalogu „system” w plikach RetroArch, aby działał poprawnie.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).[/img]\nSameBoy to bardzo dokładny emulator znany z pomyślnego uruchamiania kilku gier, które powodują potykanie się innych emulatorów. Oprócz tej wysokiej dokładności SameBoy oferuje również kilka fajnych funkcji, takich jak możliwość wybrania modelu urządzenia do emulacji, niezależnie od tego, dla jakiego modelu jest przeznaczona gra, wybierane przez użytkownika palety kolorowania, wbudowany HLE BIOS i możliwość wczytywania obramowań w grach, które je wspierają.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.[/img]\n\nStella to darmowy i otwarty emulator jednej z najpopularniejszych i najbardziej wpływowych domowych konsol do gier wideo lat 70. i 80. Pierwotnie, Stella powstała dla systemów operacyjnych GNU/Linux, jednak z czasem, została przeniesiona na wiele różnych platform, w tym także libretro, dzięki czemu można jej używać w systemie gier i multimediów RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.[/img]\n\nW ciągu ostatnich kilku lat, zespół rozwijający Stellę poczynił duże postępy w naśladowaniu wielu dziwnych zachowań docelowej konsoli Stelli, czyniąc ją bardziej kompatybilną z trudnymi do emulowania grami, oprogramowaniem Homebrew i demami.\n\nRetroArch pozwoli ci tchnąć nowe życie w ten klasyczny emulator, dzięki wsparciu przewijania w czasie rzeczywistym i RetroAchievements oraz najlepszych w swojej klasie shaderów do emulowania wyświetlaczy CRT i wielu innych.",
   "requirements": "Procesor: Intel Pentium 4 lub nowszy (wymagany procesor z instrukcjami SSE2)\nZalecany procesor: seria Intel Core lub odpowiednik AMD\nGrafika: Dowolny zgodny z OpenGL 2.x lub Direct3D11. Aby shadery działały poprawnie, powinien obsługiwać co najmniej Shader Model 2.0.\nGrafika zalecana: Intel: co najmniej Intel HD 4K wymagany dla OpenGL, dowolny zgodny procesor graficzny D3D11 dla Direct3D 11. Powinien obsługiwać co najmniej Shader Model 3.0 i / lub 4.0.\nDodatkowe uwagi: W przypadku OpenGL: procesory graficzne Intel HD 2K / 3K w systemie Windows 10 będą musiały wrócić do sterownika OpenGL 1.1.",
   "legal-limits": "RetroArch to oprogramowanie bezpłatne / open source, dostępne na licencji GNU GPL 3.0.\nNie zawiera żadnych materiałów chronionych prawem autorskim stron trzecich. RetroArch nie toleruje piractwa w żaden sposób, w żadnym kształcie ani w żadnej formie."
}
