{
   "main-desc": "RetroArch - это открытая кросс-платформенная оболочка/фреймворк для эмуляторов, игровых движков, видеоигр, медиапроигрывателей и других приложений.\n\nХотя его возможности гораздо шире, RetroArch наиболее известен как инструмент для запуска классических игр на множестве компьютеров и приставок посредством гибкого графического интерфейса, а унифицированная система настроек обеспечивает простоту конфигурации.\n\nВ дополнение к этому, вскоре вы сможете запускать в RetroArch оригинальные игровые диски. Мы серьёзно относимся к делу сохранения наследия видеоигр и хотим, чтобы вы имели возможность играть в купленный вами оригинальный контент на современных ПК.\n\nRetroArch предлагает широкий выбор возможностей, включая шейдеры, сетевой мультиплеер, перемотку геймплея, отклик на следующем кадре, снижение задержки ввода и многое другое!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (aka FBNeo) - это новое официальное ответвление эмулятора Final Burn Alpha, совместимое с сотнями аркадных и консольных игр. Ядро FBNeo для libretro расширяет доступную библиотеку игр RetroArch, а тесная интеграция с libretro API позволяет ядру использовать такие продвинутые возможности RetroArch как основанный на откате сетевой мультиплеер или обгон для уменьшения задержки ввода. В ядро добавлены профили ввода для автоматической настройки управления во многих играх, включая раскладки для файтингов, использующих современные и классические аркадные контроллеры (файтстики).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nДо портирования в libretro, Genesis Plus GX развивался как homebrew-порт эмулятора Genesis Plus на взломанной консоли. С упором на скорость, точность и портативность, в настоящее время Genesis Plus GX доступен для множества платформ и фронтендов, являясь одним из самых продвинутых и совместимых эмуляторов с поддержкой игр на картриджах и компакт-дисках. Он также успешно взаимодействует с дополнительными функциями RetroArch, такими как обратная перемотка в реальном времени, снижение задержки ввода, читы и трофеи RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos - это современный форк эмулятора uoYabause, который, в свою очередь, является ответвлением известного эмулятора Yabause. Данный DLC обеспечивает взаимодействие ядра Kronos для libretro с мультимедийно-игровым интерфейсом RetroArch, позволяя пользователям запускать совместимое с Kronos программное обеспечение.\n\nKronos использует потенциал OpenGL для реализации расширенных графических возможностей, таких как повышение внутреннего разрешения, требуя наличия достаточно мощного современного GPU.\n\nKronos поддерживает загрузку игр в различных форматах, включая ISO, BIN/CUE и формат сжатия CHD. Для правильной работы ядра необходимо наличие дополнительных файлов BIOS (saturn_bios.bin и stvbios.zip) в папке RetroArch \"system\" или в одной папке с запускаемым программным обеспечением.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen - высокоточный многофункциональный эмулятор с поддержкой множества мапперов (включая от нестандартных неофициальных картриджей), пользовательских цветовых палитр и загрузкой HD-текстур. В качестве ядра libretro Mesen поддерживает ряд продвинутых функций, таких как софтпатчинг и достижения (с помощью сервиса RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen - высокоточный многофункциональный эмулятор 16-битной приставки. Обладает высокой совместимостью с классическими играми, включая эмуляцию чипов расширений, в то же время сохраняя хорошую производительность. В качестве ядра libretro Mesen поддерживает множество продвинутых функций, таких как софтпатчинг и достижения (посредством сервиса RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA - быстрый и точный эмулятор одной из самых популярных консолей, совместимый с множеством известных 8- и 16-битных игр. Наряду с высокой точностью и скоростью эмуляции, mGBA обладает массой улучшений, среди которых загрузка пользовательских палитр для игр с оригинальным изображением в оттенках серого и отображение рамок в играх с их поддержкой.\n\nДанный DLC позволяет mGBA работать в RetroArch и использовать все его возможности, включая перемотку в реальном времени, шейдеры постобработки и уменьшение задержки ввода для придания современного облика даже классическим играм.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed является частью обширной линейки эмуляторов, включающей в себя PCSX-Reloaded, PCSX-df и оригинальный PCSX. Как следует из названия, данный форк изначально был оптимизирован для устройств с процессорами ARM, но позднее получил ряд изменений для работы на обычных ПК.\n\nВ качестве ядра libretro данному DLC необходим интерфейс RetroArch, который позволяет загрузить ядро и использовать его для запуска игр и программ, совместимых с эмулятором PCSX ReARMed. Для правильной работы ядра требуются образы BIOS каждого региона (не включены в приложение), скопированные в системный каталог RetroArch.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy - это высокоточный эмулятор, успешно запускающий даже те игры, перед которыми пасуют все прочие эмуляторы. Помимо высокой точности, SameBoy имеет ряд приятных особенностей, таких как выбор эмулируемой модели устройства независимо от типа игры, цветовые палитры по выбору пользователя, встроенный HLE BIOS, а также возможность загрузки рамок для игр с их поддержкой.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella - это бесплатный open source эмулятор одной из самых популярных и знаковых игровых консолей 1970-х и 80-х. Изначально разработанный для операционных систем GNU/Linux, эмулятор со временем был портирован на множество других платформ, включая libretro, который запускает его посредством игровой мультимедийной системы RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nЗа последние годы разработчики Stella добились значительных успехов в имитации многих особенностей поддерживаемых Stella консолей, обеспечив совместимость с массой трудноэмулируемых игр, homebrew программ и демок.\n\nRetroArch позволит придать этому классическому эмулятору современный облик с помощью перемотки в реальном времени, RetroAchievements, лучших в своём классе шейдеров для эмуляции ЭЛТ-дисплеев и других возможностей.",
   "requirements": "Процессор: Intel Pentium 4 или выше (с обязательной поддержкой SSE2). \nПроцессор (рекомендовано): Intel Core или эквивалентный AMD. \nГрафика: любой GPU с поддержкой OpenGL 2.x или Direct3D11. Поддержка Shader Model не ниже версии 2.0 для корректной работы шейдеров. \nГрафика (рекомендовано): Intel: не ниже Intel HD 4K для OpenGL, любой GPU, совместимый с D3D11 для Direct3D 11. Поддержка Shader Model не ниже 3.0 и/или 4.0. \nПримечание: для OpenGL: на Windows 10 графические чипы Intel HD 2K/3K будут использовать драйвер OpenGL 1.1.",
   "legal-limits": "RetroArch является бесплатным программным обеспечением с открытым исходным кодом, распространяемым по лицензии GNU GPL 3.0. \nНе содержит материалы третьих лиц, защищённые авторским правом. RetroArch не поощряет любые проявления пиратства."
}
