{
   "main-desc": "RetroArch é un frontend/framework de código aberto e multiplataforma para emuladores, motores de xogos, videoxogos, reprodutores multimedia e outras aplicacións.\n\nAínda que pode facer moitas cousas ademais diso, é máis coñecido por permitirche executar xogos clásicos nunha ampla gama de ordenadores e consolas a través dunha interface gráfica elegante. As configuracións tamén están unificadas, polo que a configuración realízase dunha vez por todas.\n\nAdemais disto, en breve poderás executar discos de xogos orixinais (CD) de RetroArch. Tómonos en serio a preservación dos videoxogos e queremos asegurarnos de que poidas executar o contido que compraches orixinalmente nos ordenadores modernos.\n\nRetroArch ten funcións avanzadas como sombreadores, netplay, rebobinado, tempos de resposta ao seguinte fotograma, anticipación e moito máis!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (tamén coñecido como FBNeo) é a nova rama oficial do emulador Final Burn Alpha, que é compatible con centos de xogos de arcade e consola. O núcleo libretro de FBNeo trae a súa biblioteca de títulos compatibles a RetroArch, onde a estreita integración do núcleo coa API libretro permítelle traballar coas funcións avanzadas de flexión do tempo de RetroArch, como a reprodución en rede baseada en retroceso e a redución da latencia anticipada. Inclúe axustes preestablecidos de entrada para a asignación automática de botóns para diferentes xogos, incluíndo deseños de xogos de loita para controis de arcade modernos e antigos (tamén coñecidos como fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX comezou como un porto homebrew do emulador Genesis Plus para unha consola pirateada antes de ser portado a libretro. Con foco na velocidade, precisión e portabilidade, Genesis Plus GX agora aparece nunha variedade de plataformas e frontends, e é coñecido como un dos emuladores máis capaces e compatibles para as consolas que cobre, con soporte tanto para cartuchos como para CD-ROM. xogos. Tamén funciona ben con moitas das funcións avanzadas de RetroArch, como rebobinado en tempo real, redución da latencia anticipada, trucos e RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos é unha bifurcación moderna do emulador UoYabause, que é á súa vez unha bifurcación do venerable emulador Yabause. Este contido descargable ofrece o núcleo Kronos-libretro para o uso ca interface de xogos e multimedia RetroArch, permitindo aos usuarios cargar software compatible co emulador Kronos. \n\nKronos utiliza as últimas prestacións de OpenGL para dar unha chea de características gráficas adicionais, como unha maior resolución interna, así que se recomenda ter un procesador gráfico moderno e de certa potencia. \n\nKronos pode cargar xogos a partir de diversos formatos, que inclúen ISO, BIN/CUE e o formato comprimido CHD, e precisa ter arquivos adicionais dos BIOS (saturn_bios.bin e stvbios.zip) situados no cartafol \"system\" de RetroArch ou xunto ao software a executar para poder funcionar.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen é un emulador moi preciso e cheo de funcións con soporte para toneladas de cartucheiros (mesmo os usados para carros estraños e non autorizados), paletas de cores personalizadas e paquetes de recursos HD. Como núcleo libretro, Mesen admite moitas funcións avanzadas, como parches de software e logros (a través do servizo RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S é un emulador de consola de 16 bits moi preciso e cheo de funcións. Ten unha alta compatibilidade, con soporte para os chips complementarios usados en moitos xogos da época, mantendo tamén un alto rendemento. Como núcleo libretro, Mesen S admite moitas funcións avanzadas, como parches de software e logros (a través do servizo RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA é un emulador rápido e preciso para unha das consolas portátiles máis populares e queridas, e ten compatibilidade coa enorme biblioteca de xogos de estilo de 8 e 16 bits. Ademais do compromiso coa velocidade e a reprodución fiel, mGBA tamén ten un montón de funcións de mellora excelentes, incluíndo soporte para paletas personalizadas para xogos que orixinalmente eran en escala de grises e amosando bordos para xogos que as inclúen.\n\nEste DLC permite que mGBA funcione a través de RetroArch, que engade todas as súas melloras e funcións, incluíndo o rebobinado en tempo real, amplos sombreadores de post-procesamento e entrada de baixa latencia para ofrecer unha experiencia de xogo moderna mesmo con títulos clásicos.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed forma parte dunha longa liña de emuladores que inclúe PCSX-Reloaded, PCSX-df e, por suposto, o PCSX orixinal. Este fork en particular foi moi optimizado orixinalmente para dispositivos con CPU ARM, de aí o nome, pero engadimos moitas cousas para que funcione ben no hardware típico de PC tamén.\n\nComo núcleo libretro, este DLC require a interface RetroArch, onde se pode cargar como núcleo para executar xogos e software compatibles co emulador PCSX ReARMed. Este núcleo require que unha imaxe da BIOS (non incluída) para cada rexión do software se coloque no directorio \"sistema\" de RetroArch para que funcione correctamente.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy é un emulador moi preciso coñecido por executar con éxito algúns xogos que provocan que outros emuladores tropezen. Ademais desta alta precisión, SameBoy tamén ten algunhas características interesantes como a capacidade de escoller que modelo de dispositivo quere emular independentemente do modelo para o que estea deseñado o xogo, paletas de coloración seleccionables polo usuario, BIOS HLE incorporada e a capacidade de cargar bordos. sobre os xogos que os apoian.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella é un emulador gratuíto de código aberto para unha das consolas de videoxogos domésticos máis populares e influentes das décadas de 1970 e 80. Este emulador foi desenvolvido orixinalmente para o seu uso no sistema operativo GNU/Linux pero, co paso do tempo, portouse a moitas plataformas diferentes, incluíndo libretro, que lle permite xogar a través do sistema de xogos e multimedia RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nDurante os últimos dous anos, o equipo de desenvolvemento de Stella fixo grandes avances imitando as moitas peculiaridades da consola de destino de Stella, facéndoa compatible con moitos xogos difíciles de emular, software homebrew e demostracións.\n\nA través de RetroArch, podes aportar un toque moderno a este emulador clásico, con compatibilidade para rebobinar en tempo real e RetroAchievements, así como os mellores sombreadores de RetroArch para a emulación de pantallas CRT e moito máis.",
   "requirements": "CPU: Intel Pentium 4 ou superior (requírese unha CPU con instrucións SSE2)\nRecomendado por CPU: serie Intel Core ou equivalente AMD\nGráficos: calquera GPU compatible con OpenGL 2.x ou Direct3D11. Para que os sombreadores funcionen correctamente, debería admitir polo menos Shader Model 2.0.\nGráficos recomendados: Intel: é necesario polo menos Intel HD 4K para OpenGL, calquera GPU compatible con D3D11 para Direct3D 11. Debe admitir polo menos Shader Model 3.0 e/ou 4.0.\nNotas adicionais: para OpenGL: as GPU Intel HD 2K/3K en Windows 10 terán que recurrir a un controlador OpenGL 1.1.",
   "legal-limits": "RetroArch é un software gratuíto/de código aberto, dispoñible baixo a licenza GNU GPL 3.0.\nNon contén ningún material protexido por dereitos de autor de terceiros. RetroArch non tolera a piratería de ningún xeito, forma ou forma."
}
