{
   "main-desc": "RetroArch är en öppen källkod- och kross-plattform frontend/ram för emulatorer, spelmotorer, videospel, mediaspelare och andra program.\n\nÄven om det kan göra många saker förutom detta, är det mest känt för att du kan köra klassiska spel på ett brett utbud av datorer och konsoler genom ett smidigt grafiskt gränssnitt. Inställningarna är också enhetliga så konfigurationen görs en gång för alla.\n\nUtöver detta kommer du snart att kunna köra original spelskivor (CDs) från RetroArch. Vi tar bevarande av videospel på allvar och vill se till att du kan köra ditt ursprungligt köpta innehåll på moderna datorer.\n\nRetroArch har avancerade funktioner som shaders, nätspel, tillbakaspolning, nästa-ram svarstider, runahead, och mycket mer!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.[/img]\n\nFinal Burn Neo (alias FBNeo) är den nya officiella grenen av Final Burn Alpha emulatorn, som är kompatibel med hundratals arkad- och konsolspel. FBNeos libretro kärna tar sitt bibliotek med kompatibla titlar till RetroArch, där kärnans täta integration med libretros API gör det möjligt att arbeta med RetroArchs avancerade tidsböjande funktioner som rollback-baserade nätspel och runahead latens minskning. Den innehåller ingångsförinställningar för automatisk mappning av knappar för olika spel, inklusive fightingspel layouter för både moderna och gamla skolans arkadkontroller (s.k fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(hone). ng[/img]\n\nGenesis Plus GX började som en homebrew-port för Genesis Plus-emulatorn för en hackad konsol innan den portades till libretro. Med fokus på hastighet, noggrannhet och portabilitet, Genesis Plus GX visas nu på en mängd olika plattformar och fronter, och är känd som en av de mest kapabla och kompatibla emulatorer för konsoler den täcker, med stöd för både patron och CD-ROM-spel. Det fungerar också bra med många av RetroArchs avancerade funktioner, såsom realtids-spolning, runahead-latensreducering, fusk och RetroPrestationer.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img] \n\nKronos är en modern avgrening av UoYabause-emulatorn, vilken i sig är en förgrening av den ansedda Yabause-emulatorn. Denna DLC tillhandahåller Kronos-libretro-kärnan för användning med RetroArchs spelande och multimediala gränssnitt, vilket gör det möjligt för användare att ladda mjukvara som är kompatibel med Kronos-emulatorn.\n\nKronos använder moderna OpenGL-funktioner för att ge olika extra grafiska funktioner, såsom ökad intern upplösning, vilket gör att en uppdaterad och tillräckligt kraftfull GPU rekommenderas.\n\nKronos stödjer att läsa in spel från många olika format, inklusive ISO, BIN/CUE och det komprimerade CHD-formatet, och den kräver externa BIOS-filer (saturn_bios.bin och stvbios.zip) som placeras antingen i RetroArchs \"system\"-mapp eller bredvid målmjukvaran för att fungera korrekt.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen är en mycket noggrann och funktionsspäckad emulator med stöd för massor av kassettmapper (även de som används för udda, oauktoriserade kassetter), anpassade färgpaletter och HD-tillgångspaket. Som en libretro-kärna stödjer Mesen många avancerade funktioner, som mjukpatchning och prestationer (genom RetroAchievements-tjänsten).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S är en mycket noggrann och funktionsspackad 16-bitars konsollemulator. Den har hög kompatibilitet med stöd för tilläggschips som används i många spel från eran, samtidigt som den bibehåller hög prestanda. Som en libretro-kärna stödjer Mesen S många avancerade funktioner, såsom mjukpatchning och prestationer (genom RetroAchievements-tjänsten).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA är en snabb och träffsäker emulator för en av de mest populära och älskade handhållna spelkonsolerna, och den har kompatibilitet med ett stort bibliotek av älskade spel i 8- och 16-bitarsstil. Förutom fokus på hastighet och trogen återgivning har mGBA också en mängd fantastiska förbättringsfunktioner, inklusive stöd för anpassade färgpaletter för spel som ursprungligen var gråskaliga, samt visning av ramar för spel som inkluderar dessa.\n\nDenna DLC möjliggör att mGBA körs genom RetroArch, vilket tillför alla dess förbättringar och funktioner, inklusive realtidsåterställning, omfattande efterbehandlings-shaders och låglatensinmatning för att ge en modern spelupplevelse även med klassiska titlar.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed är en del av en lång rad emulators som inkluderar PCSX-Reloaded, PCSX-df och, självklart, den ursprungliga PCSX. Denna särskilda avgrening var ursprungligen kraftigt optimerad för enheter med ARM-processorer, därav namnet, men vi har lagt tillbaka en hel del funktioner för att göra den väl fungerande även på vanlig PC-hårdvara.\n\nSom en libretro-kärna kräver denna DLC RetroArch-gränssnittet, där den kan laddas som en kärna för att köra spel och mjukvara som är kompatibel med PCSX ReARMed-emulatorn. Denna kärna kräver en BIOS-bild (ej inkluderad) för varje region av mjukvaran, som ska placeras i RetroArchs \"system\"-mapp för att fungera korrekt.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy är en mycket exakt emulator som är känd för att framgångsrikt köra några spel som får andra emulatorer att snubbla. Förutom denna höga noggrannhet har SameBoy också några trevliga funktioner som möjligheten att välja vilken enhetsmodell som ska emuleras oavsett vilken modell spelet är utformat för, användarvalbara färgpaletter, inbyggd HLE BIOS och möjligheten att ladda gränser på de spel som stöder dem.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella är en gratis, öppen källkodsemulator för en av de mest populära och inflytelserika hemmavideospelkonsolerna från 1970- och 80-talet. Denna emulator utvecklades ursprungligen för användning på GNU/Linux-operativsystemet men har med tiden portats till många olika plattformar, inklusive libretro, vilket gör det möjligt att spela genom RetroArch-spel- och multimediasystemet.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nUnder de senaste åren har Stella-utvecklingsteamet gjort stora framsteg med att efterlikna många egenskaper hos Stellas målkonsol, vilket gör den kompatibel med många svåråtergivna spel, homebrew programvaror och demo-versioner.\n\nGenom RetroArch kan du ge en modern touch till denna klassiska emulator med stöd för realtids-återställning och RetroAchievements, samt RetroArchs bästa shaders för att efterlikna CRT-skärmar och mer.",
   "requirements": "CPU: Intel Pentium 4 och uppåt (CPU med SSE2 instruktioner krävs) \nRekommenderad CPU: Intel Core-serien eller AMD ekvivalent \nGrafik: Alla kompatibla OpenGL 2.x eller Direct3D11 GPU. För att shaders ska fungera korrekt, bör det stödja minst Shader Modell 2.0. \nRekommenderad Grafik: Intel: Minst Intel HD 4K krävs för OpenGL, alla kompatibla D3D11 GPU för Direct3D 11. Bör stödja minst Shader Modell 3.0 och/eller 4.0. \nYtterligare anteckningar: För OpenGL: Intel HD 2K/3K GPU:er på Windows 10 måste falla tillbaka till en OpenGL 1.1 drivrutin.",
   "legal-limits": "RetroArch är fri programvara med öppen källkod tillgänglig under GNU GPL 3.0-licensen. \nDen innehåller inte något upphovsrättsskyddat material från tredje part. RetroArch tolererar inte piratkopiering på något sätt eller form."
}
