{
   "main-desc": "RetroArch, emülatörler, oyun motorları, video oyunları, medya oynatıcılar ve diğer uygulamalar için açık kaynaklı ve çapraz platform arabirimidir.\n\nBunun yanı sıra birçok şey yapabilmesine rağmen, hızlı grafik arayüzü ile çok çeşitli bilgisayarlarda ve konsollarda klasik oyunları çalıştırmanıza izin verdiği için bilinir. Ayarlar da birleşik tutulur, böylece yapılandırmalar bir kez yapılır.\n\nBuna ek olarak, yakın zamanda RetroArch içinden orijinal oyun disklerini (CD'ler) çalıştırabileceksiniz. Video oyunu korumasını ciddiye alıyoruz ve ilk satın aldığınız içeriği modern PC'lerde çalıştırabilmenizi istiyoruz.\n\nRetroArch, gölgelendiriciler, ağ üzeri oyun, geri sarma, sonraki kare yanıt süreleri, ön koşucu ve daha fazlası gibi gelişmiş özelliklere sahiptir!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Nero (bilinen adıyla Fbneo), yüzlerce arcade ve konsol oyunuyla uyumlu olan Final Burn Alpha emülatörünün yeni resmi şubesidir. FBNeo'nun libretro çekirdeği, uyumlu başlık kitaplığını RetroArch'a getiriyor; burada çekirdeğin libretro API ile sıkı bütünleşmesi, RetroArch'ın geri alma tabanlı netplay ve ön koşucu gecikme azaltımı gibi gelişmiş zaman bükme özellikleriyle çalışmasına izin veriyor. Hem modern hem de eski okul arcade kontrolleri (bilinen adıyla Dövüş çubuğu) için dövüş oyunu düzenleri de dahil olmak üzere farklı oyunlar için düğmelerin otomatik haritalanması için giriş ön ayarlarını içerir.",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX, Libretro'ya taşınmadan önce konsol için Genesis Plus emülatörünün ön ucu olarak başladı. Hız, doğruluk ve taşınabilirliğe odaklanan Genesis Plus GX şimdi çeşitli platformlarda ve ön uçlarda görünüyor ve hem kartuş hem de CD-ROM desteği ile kapsadığı konsollar için en yetenekli ve uyumlu emülatörlerden biri olarak biliniyor. Ayrıca, RetroArch'ın gerçek zamanlı geri sarma, ön koşucu gecikme azaltımı, hileler ve RetroAchievements gibi gelişmiş özelliklerinin çoğuyla iyi çalışır.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos, saygıdeğer Yabause emülatörünün bir çatalı olan UoYabause emülatörünün modern bir çataldır. Bu DLC, RetroArch oyun ve çoklu ortam arayüzü ile kullanım için Kronos-libretro çekirdeğini sağlar ve kullanıcıların Kronos emülatörüyle uyumlu yazılım yüklemelerine izin verir.\n\nKronos, artırılmış dahili çözünürlük gibi çeşitli fazladan grafik özellikler sağlamak için modern OpenGL yeteneklerini kullanır, bu nedenle güncel ve makul derecede güçlü bir GPU önerilir.\n\nKronos, ISO, BIN/CUE ve sıkıştırılmış CHD biçimi dahil olmak üzere birçok farklı biçimden oyun kurulumunu destekler ve RetroArch'ın \"sistem\" klasörüne veya hedef yazılımın yanına yerleştirilmiş harici BIOS dosyaları (saturn_bios.bin ve stvbios.zip) gerektirir. düzgün çalışması için.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen, tonlarca kartuş haritalayıcı (garip, yetkisiz kartlar için kullanılanlar bile), özel renk paletleri ve HD varlık paketleri için desteği olan son derece hassas ve özellik dolu bir emülatördür. Bir libretro çekirdeği olarak Mesen, yumuşak eşleştirme ve başarılar (RetroAchievements servisi aracılığıyla) gibi birçok gelişmiş özelliği destekler.",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S, son derece hassas ve özellik dolu bir 16bit konsol emülatörüdür. Dönemin birçok oyunda kullanılan eklenti yongaları ile yüksek uyumluluk sağlarken, aynı zamanda yüksek performansı da korur. Bir libretro çekirdek olarak Mesen S, yumuşak eşleştirme ve başarılar (RetroAchievements hizmeti aracılığıyla) gibi birçok gelişmiş özelliği destekler.",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA, en bilinen ve sevilen el konsollarından biri için hızlı, doğru bir emülatördür ve sevdiğimiz 8 ve 16 bit şeklindeki oyunların büyük kütüphanesiyle uyumluluğa sahiptir. Hız ve sadık reprodüksiyon taahhüdünün yanı sıra, mGBA ayrıca orijinal olarak gri tonlamalı oyunlar için özel paletler için destek ve bunları içeren oyunlar için sınırlar görüntüleme de dahil olmak üzere bir ton harika geliştirme özelliğine sahiptir.\n\nBu DLC, mGBA'nın, klasik başlıklarla bile modern bir oyun deneyimi sağlamak için gerçek zamanlı geri sarma, kapsamlı işlem sonrası gölgelendiriciler ve düşük gecikme girişi dahil olmak üzere tüm geliştirmelerini ve özelliklerini ekleyen RetroArch ile çalışmasına izin verir.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed, PCSX-Reloaded, PCSX-df ve tabii ki orijinal PCSX'i içeren uzun bir emülatör serisinin bir parçasıdır. Bu özel çatal aslında ARM CPU'lu cihazlar için yoğun bir şekilde uyumluluğu sağlandı, ve tipik PC donanımında da iyi çalışması için birkaç şey ekledik.\n\nBir libretro çekirdeği olarak, bu DLC, PCSX ReARMed emülatörüyle uyumlu oyunları ve yazılımı çalıştırmak için bir çekirdek olarak yüklenebileceği RetroArch arabirimini gerektirir. Bu çekirdek, düzgün çalışması için yazılımın her bölgesi için RetroArch'ın \"sistem\" dizinine yerleştirilmek üzere bir BIOS görüntüsü (dahil değildir) gerektirir.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\n\nSameBoy, diğer emülatörlerin tökezlemesine neden olan birkaç oyunu başarıyla çalıştırdığı bilinen son derece hassas bir emülatördür. Bu yüksek doğruluğa ek olarak SameBoy, oyunun hangi model için tasarlandığına bakılmaksızın hangi cihaz modelini taklit edeceğini seçme yeteneği, kullanıcı tarafından seçilebilir renklendirme paletleri, dahili HLE BIOS'u ve sınırları yükleme yeteneği gibi bazı güzel özelliklere de sahiptir, bu özellikleri destekleyen oyunlarda iyi bir iş çıkarır.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella, 1970'lerin ve 80'lerin en bilinen ve etkili ev video oyun konsollarından biri için ücretsiz, açık kaynaklı bir emülatördür. Bu emülatör başlangıçta GNU/Linux işletim sisteminde kullanılmak üzere geliştirildi, ancak zaman içinde RetroArch oyun ve çoklu ortam sistemi üzerinden oynamasına izin veren libretro da dahil olmak üzere birçok farklı platforma taşındı.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nSon birkaç yıl içinde, Stella geliştirme ekibi, Stella'nın hedef konsolunun birçok tuhaflığını taklit etmek için büyük adımlar attı ve bu da taklit edilmesi zor birçok oyun, ev tipi yazılımı ve tanıtımlarla uyumlu hale geldi.\n\nRetroArch ile, gerçek zamanlı geri sarma ve RetroAchievements desteğinin yanı sıra RetroArch'ın CRT ekran emülasyonu ve daha fazlası için sınıfının en iyi gölgelendiricileri ile bu klasik emülatöre modern bir dokunuş getirebilirsiniz.",
   "requirements": "İşlemci: Intel Pentium 4 ve üzeri (SSE2 komut setini destekleyen işlemci gereklidir) \nÖnerilen işlemci: Intel Core serisi veya AMD eşdeğeri \nGörüntü işlemcisi: OpenGL 2.x veya Direct3D11 uyumlu herhangi bir görüntü işlemcisi. Gölgelendiricilerin düzgün çalışması için, en düşük Shader Model 2.0 desteklemeli. \nÖnerilen görüntü işlemcisi: Intel: OpenGL için en az Intel HD 4K gereklidir, Direct3D 11 için herhangi uyumlu bir D3D11 görüntü işlemcisi. En düşük Shader Model 3.0 yada 4.0 desteklemeli. \nEk notlar: OpenGL için: Windows 10'da Intel HD 2K/3K görüntü işlemcileri OpenGL 1.1 sürücüsüne düşmek zorundalar.",
   "legal-limits": "RetroArch, GNU GPL 3.0 lisansı altında bulunan ücretsiz/açık kaynaklı bir yazılımdır. \nÜçüncü taraflarca telif hakkıyla korunan materyal içermez. RetroArch korsanlığı hiçbir yolla, şekilde veya biçimde desteklemez."
}
