{
   "main-desc": "RetroArch is een open source en platformoverschrijdend frontend/framework voor emulators, game engines, games, media spelers en andere applicaties.\n\nHoewel het nog vele andere dingen kan, is RetroArch vooral bekend om de mogelijkheid om klassieke games van allerlei computers en consoles te spelen via een strakke grafische interface. Bovendien zijn al jouw instellingen verenigd, waardoor je maar één keer iets hoeft te configureren zodat het overal werkt.\n\nBinnenkort wordt het ook mogelijk om originele gamedisks (cd's) af te spelen in RetroArch. We nemen het behoud van games serieus en willen garanderen dat je jouw originele gekochte content kunt spelen op hedendaagse PC's. \n\nRetroArch biedt vooruitstrevende functionaliteiten zoals shaders, netplay, een terugspoelfunctie, onmiddellijke responstijden, ongeëvenaarde latentiereductie en meer!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and runahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, runahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\r\n\r\nKronos is a modern fork of the UoYabause emulator, which is itself a fork of the venerable Yabause emulator. This DLC provides the Kronos-libretro core for use with the RetroArch gaming and multimedia interface, allowing users to load software that is compatible with the Kronos emulator.\r\n\r\nKronos utilizes modern OpenGL capabilities to provide a variety of extra graphical features, such as increased internal resolution, so an up-to-date and reasonably powerful GPU is recommended.\r\n\r\nKronos supports loading games from many different formats, including ISO, BIN/CUE and the compressed CHD format, and it requires external BIOS files (saturn_bios.bin and stvbios.zip) placed either in RetroArch's \"system\" folder or alongside the target software in order to function correctly.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\r\n\r\nMesen is a highly accurate and feature-filled emulator with support for tons of cartridge mappers (even ones used for weird, unauthorized carts), custom color palettes and HD asset packs. As a libretro core, Mesen supports many advanced features, like softpatching and achievements (through the RetroAchievements service).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\r\n\r\nMesen S is a highly accurate and feature-filled 16bit console emulator. It has high compatibility, with support for the add-on chips used in many games of the era, while also maintaining high performance. As a libretro core, Mesen S supports many advanced features, like softpatching and achievements (through the RetroAchievements service).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\r\n\r\nmGBA is a fast, accurate emulator for one of the most popular and well-loved handheld consoles, and it has compatibility with huge library of beloved 8- and 16-bit style games. On top of the commitment to speed and faithful reproduction, mGBA also has a ton of great enhancement features, including support for custom palettes for games that were originally grayscale and displaying borders for games that include them.\r\n\r\nThis DLC allows mGBA to run through RetroArch, which adds all of its enhancements and features, including real-time rewind, extensive post-processing shaders and low-latency input to provide a modern gaming experience even with classic titles.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\r\n\r\nPCSX ReARMed is part of a long line of emulators that includes PCSX-Reloaded, PCSX-df and, of course, the original PCSX. This particular fork was originally heavily optimized for devices with ARM CPUs, hence the name, but we've added back in quite a few things to make it work well on typical PC hardware, as well.\r\n\r\nAs a libretro core, this DLC requires the RetroArch interface, where it can be loaded as a core to run games and software that are compatible with the PCSX ReARMed emulator. This core requires a BIOS image (not included) for each region of the software to be placed in RetroArch's \"system\" directory in order to function properly.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\r\nSameBoy is a highly accurate emulator known for successfully running a few games that cause other emulators to stumble. In addition to this high accuracy, SameBoy also sports some nice features like the ability to pick which device model to emulate regardless of what model the game is designed for, user-selectable colorization palettes, built-in HLE BIOS and the ability to load borders on the games that support them.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\r\n\r\nStella is a free, open-source emulator for one of the most popular and influential home video game consoles of the 1970s and '80s. This emulator was originally developed for use on the GNU/Linux operating system but has, over time, been ported to many different platforms, including libretro, which allows it to play through the RetroArch gaming and multimedia system.\r\n\r\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\r\n\r\nOver the past couple of years, the Stella development team has made great strides in mimicking the many quirks of Stella's target console, making it compatible with many difficult-to-emulate games, homebrew software and demos.\r\n\r\nThrough RetroArch, you can bring a modern touch to this classic emulator, with support for real-time rewind and RetroAchievements, as well as RetroArch's best-in-class shaders for CRT display emulation and more.",
   "requirements": "CPU: Intel Pentium 4 and up (CPU with SSE2 instructions required) \nCPU-recommended:Intel Core series or AMD equivalent \nGraphics: Any compliant OpenGL 2.x or Direct3D11 GPU. For shaders to work properly, should support at least Shader Model 2.0. \nGraphics-recommended: Intel: At least Intel HD 4K required for OpenGL, any compliant D3D11 GPU for Direct3D 11. Should support at least Shader Model 3.0 and/or 4.0. \nAdditional notes: For OpenGL: Intel HD 2K/3K GPUs on Windows 10 will have to fall back to an OpenGL 1.1 driver.",
   "legal-limits": "RetroArch is gratis/open source software, beschikbaar onder de GNU GPL 3.0 licentie. \nHet bevat geen auteursrechtelijk materiaal van derden. RetroArch accepteert op geen enkele manier piraterij."
}
