{
   "main-desc": "RetroArch là một front-end/framework mã nguồn mở và đa nền tảng dành cho trình giả lập, công cụ trò chơi, trò chơi điện tử, trình phát đa phương tiện và các ứng dụng khác.\n\nMặc dù có thể làm được nhiều việc khác, nhưng RetroArch nổi tiếng nhất với việc cho phép bạn chạy các trò chơi cổ điển trên nhiều loại máy tính và máy chơi game thông qua giao diện đồ họa mượt mà. Các thiết lập cũng được thống nhất để việc cấu hình được thực hiện một lần và mãi mãi.\n\nNgoài ra, bạn sẽ sớm có thể chạy đĩa trò chơi gốc (CD) từ RetroArch. Chúng tôi rất coi trọng việc bảo quản trò chơi điện tử và muốn đảm bảo bạn có thể chạy nội dung đã mua ban đầu trên các máy tính hiện đại.\n\nRetroArch có các tính năng nâng cao như shader, netplay, tua lại, thời gian phản hồi khung hình tiếp theo, chạy trước, và nhiều hơn nữa!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (hay còn gọi là FBNeo) là nhánh chính thức mới của trình giả lập Final Burn Alpha, tương thích với hàng trăm trò chơi arcade và console. Lõi libretro của FBNeo mang thư viện các tựa game tương thích đến RetroArch, nơi lõi tích hợp chặt chẽ với API libretro cho phép nó hoạt động với các tính năng bẻ cong thời gian tiên tiến của RetroArch như chơi mạng dựa trên rollback và giảm độ trễ chạy trước. Nó bao gồm các cài đặt đầu vào để tự động ánh xạ các nút cho các trò chơi khác nhau, bao gồm cả bố cục trò chơi đối kháng cho cả điều khiển arcade hiện đại và cổ điển (hay còn gọi là fightstick).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX ban đầu là một bản port homebrew của trình giả lập Genesis Plus cho một máy chơi game đã bị hack trước khi được chuyển sang libretro. Tập trung vào tốc độ, độ chính xác và tính di động, Genesis Plus GX hiện đã xuất hiện trên nhiều nền tảng và giao diện người dùng khác nhau, và được biết đến là một trong những trình giả lập mạnh mẽ và tương thích nhất cho các máy chơi game mà nó hỗ trợ, với khả năng hỗ trợ cả trò chơi băng và CD-ROM. Nó cũng hoạt động tốt với nhiều tính năng nâng cao của RetroArch, chẳng hạn như tua lại theo thời gian thực, giảm độ trễ khi chạy trước, gian lận và RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos là một nhánh hiện đại của trình giả lập UoYabause, vốn cũng là một nhánh của trình giả lập Yabause nổi tiếng. DLC này cung cấp lõi Kronos-libretro để sử dụng với giao diện chơi game và đa phương tiện RetroArch, cho phép người dùng tải phần mềm tương thích với trình giả lập Kronos.\n\nKronos sử dụng các tính năng OpenGL hiện đại để cung cấp nhiều tính năng đồ họa bổ sung, chẳng hạn như tăng độ phân giải nội bộ, do đó, nên sử dụng GPU mới nhất và đủ mạnh.\n\nKronos hỗ trợ tải trò chơi từ nhiều định dạng khác nhau, bao gồm ISO, BIN/CUE và định dạng CHD nén, và yêu cầu các tệp BIOS bên ngoài (saturn_bios.bin và stvbios.zip) được đặt trong thư mục \"hệ thống\" của RetroArch hoặc bên cạnh phần mềm đích để hoạt động chính xác.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen là một trình giả lập cực kỳ chính xác và đầy đủ tính năng, hỗ trợ hàng loạt trình ánh xạ hộp mực (kể cả những trình được sử dụng cho các hộp mực lạ, không được cấp phép), bảng màu tùy chỉnh và gói tài nguyên HD. Là một phần cốt lõi của libretro, Mesen hỗ trợ nhiều tính năng nâng cao, chẳng hạn như softpatch và thành tích (thông qua dịch vụ RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S là trình giả lập console 16bit có độ chính xác cao và đầy đủ tính năng. Nó có khả năng tương thích cao, hỗ trợ các chip bổ sung được sử dụng trong nhiều trò chơi cùng thời, đồng thời vẫn duy trì hiệu suất cao. Là một lõi libretro, Mesen S hỗ trợ nhiều tính năng nâng cao, chẳng hạn như vá mềm và thành tích (thông qua dịch vụ RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA là trình giả lập nhanh chóng, chính xác cho một trong những máy chơi game cầm tay phổ biến và được yêu thích nhất, và nó tương thích với thư viện khổng lồ các trò chơi 8-bit và 16-bit được yêu thích. Bên cạnh cam kết về tốc độ và khả năng tái tạo hình ảnh trung thực, mGBA còn sở hữu hàng loạt tính năng nâng cao tuyệt vời, bao gồm hỗ trợ bảng màu tùy chỉnh cho các trò chơi ban đầu ở chế độ xám và hiển thị đường viền cho các trò chơi có sử dụng chúng.\n\nBản DLC này cho phép mGBA chạy trên RetroArch, bổ sung tất cả các tính năng và cải tiến của nó, bao gồm tua lại thời gian thực, trình đổ bóng hậu kỳ mở rộng và đầu vào độ trễ thấp để mang đến trải nghiệm chơi game hiện đại ngay cả với các tựa game kinh điển.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed là một phần của dòng trình giả lập lâu đời, bao gồm PCSX-Reloaded, PCSX-df và dĩ nhiên là cả PCSX gốc. Bản fork đặc biệt này ban đầu được tối ưu hóa mạnh mẽ cho các thiết bị sử dụng CPU ARM, do đó có tên như vậy, nhưng chúng tôi đã bổ sung thêm một số tính năng để nó hoạt động tốt trên cả phần cứng PC thông thường.\n\nLà một lõi libretro, DLC này yêu cầu giao diện RetroArch, nơi nó có thể được tải như một lõi để chạy các trò chơi và phần mềm tương thích với trình giả lập PCSX ReARMed. Lõi này yêu cầu một ảnh BIOS (không bao gồm) cho mỗi vùng của phần mềm được đặt trong thư mục \"hệ thống\" của RetroArch để hoạt động bình thường.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy là một trình giả lập có độ chính xác cao, nổi tiếng với khả năng chạy thành công một số trò chơi khiến các trình giả lập khác phải khựng lại. Bên cạnh độ chính xác cao này, SameBoy còn sở hữu một số tính năng tuyệt vời như khả năng chọn model thiết bị để giả lập bất kể game được thiết kế cho model nào, bảng màu tùy chỉnh theo ý người dùng, BIOS HLE tích hợp và khả năng tải viền cho các trò chơi hỗ trợ chúng.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella là một trình giả lập miễn phí và mã nguồn mở cho một trong những hệ máy chơi game gia đình nổi tiếng và có ảnh hưởng nhất trong những năm 1970 và 1980. Trình giả lập này ban đầu được phát triển để sử dụng trên hệ điều hành GNU/Linux, nhưng sau đó đã được chuyển sang nhiều nền tảng khác nhau, bao gồm libretro, cho phép nó chơi qua hệ thống chơi game và đa phương tiện RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nTrong những năm gần đây, nhóm phát triển Stella đã có những tiến bộ đáng kể trong việc mô phỏng những đặc điểm độc đáo của hệ máy chơi game Stella, làm cho nó tương thích với nhiều trò chơi, hmoebrew và bản demo hơn.\n\nVới RetroArch, bạn có thể mang trình giả lập cổ điển này lên những máy hiện đại, với tính năng tua lại thời gian thực, RetroAchievements, cũng như các shader hàng đầu của RetroArch cho mô phỏng hiển thị CRT và nhiều tính năng khác.",
   "requirements": "CPU: Intel Pentium 4 trở lên (CPU hỗ trợ kiến trúc SSE2) \nCPU khuyến nghị: series Intel Core hoặc AMD tương đương \nCard đồ họa: Bất kỳ GPU nào hỗ trợ OpenGL 2.x hoặc Direct3D11. Để shaders hoạt động bình thường, nên hỗ trợ thấp nhất là Shader Model 2.0. \nCard đồ họa khuyến nghị: Intel: Tối thiểu là Intel HD 4K cho OpenGL, bất kỳ GPU D3D11 nào cho Direct3D 11. Nên hỗ trợ thấp nhất là Shader Model 3.0 và/hoặc 4.0. \nGhi chú bổ sung: Đối với OpenGL: GPU Intel HD 2K / 3K trên Windows 10 sẽ phải quay trở lại driver OpenGL 1.1.",
   "legal-limits": "RetroArch là phần mềm mã nguồn miễn phí / mở, có sẵn theo giấy phép GNU GPL 3.0.\nNó không chứa bất kỳ tài liệu có bản quyền của bên thứ ba. RetroArch không chấp nhận việc vi phạm bản quyền dưới bất kỳ hình thức nào."
}
