{
   "main-desc": "RetroArch je otevřený zdroj a multiplatformní frontend/framework pro emulátory, herní enginy, videohry, přehrávače médií a další aplikace.\n\nAčkoli kromě toho umí mnoho dalších věcí, je nejznámější tím, že umožňuje spouštět klasické hry na široké škále počítačů a konzolí prostřednictvím svižného grafického rozhraní. Nastavení je navíc sjednoceno, takže konfigurace probíhá jednou provždy.\n\nKromě toho bude brzy možné z RetroArchu spouštět i originální disky s hrami (CD). Uchovávání videoher bereme vážně a chceme zajistit, abyste mohli svůj původně zakoupený obsah spustit na moderních počítačích.\n\nRetroArch má pokročilé funkce, jako jsou shadery, netplay, přetáčení, doba odezvy dalšího snímku, run-ahead a další!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (alias FBNeo) je nová oficiální odnož emulátoru Final Burn Alpha, která je kompatibilní se stovkami arkádových a konzolových her. Jádro libretro FBNeo přináší svou knihovnu kompatibilních titulů do aplikace RetroArch, kde jádro díky těsné integraci s rozhraním API libretro umožňuje pracovat s pokročilými funkcemi aplikace RetroArch pro ohýbání času, jako je síťová hra založená na zpětném přehrávání a snižování latence při běhu. Obsahuje vstupní předvolby pro automatické mapování tlačítek pro různé hry, včetně rozložení bojových her pro moderní i oldschoolové arkádové ovládání (tzv. fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone). ng[/img]\n\nGenesis Plus GX vznikl jako homebrew port emulátoru Genesis Plus pro hacknutou konzoli a poté byl portován na libretro. Díky důrazu na rychlost, přesnost a přenositelnost se nyní Genesis Plus GX objevuje na různých platformách a frontendech a je známý jako jeden z nejschopnějších a nejkompatibilnějších emulátorů pro konzole, které pokrývá, s podporou her z kazet i CD-ROM. Dobře také spolupracuje s mnoha pokročilými funkcemi aplikace RetroArch, jako je přetáčení v reálném čase, redukce latence při běhu, cheaty a RetroÚspěchy.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos je moderní odnož emulátoru UoYabause, který je sám odnoží uznávaného emulátoru Yabause. Toto DLC poskytuje jádro Kronos-libretro pro použití s herním a multimediálním rozhraním RetroArch, které uživatelům umožňuje načítat software kompatibilní s emulátorem Kronos.\n\nKronos využívá moderní možnosti OpenGL, které poskytují řadu dalších grafických funkcí, jako je například zvýšené vnitřní rozlišení, takže je doporučen aktuální a přiměřeně výkonný grafický procesor.\n\nKronos podporuje načítání her z mnoha různých formátů, včetně ISO, BIN/CUE a komprimovaného formátu CHD, a pro správnou funkci vyžaduje externí soubory BIOS (saturn_bios.bin a stvbios.zip) umístěné buď v \"systémové\" složce aplikace RetroArch, nebo vedle cílového softwaru.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen je velmi přesný a funkcemi nabitý emulátor s podporou spousty mapovačů kazet (dokonce i těch, které se používají pro podivné, neautorizované kazety), vlastních barevných palet a balíčků HD aktiv. Jako jádro libretro podporuje Mesen mnoho pokročilých funkcí, například softpatching a achievementy (prostřednictvím služby RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S je velmi přesný a funkcemi nabitý emulátor 16bitových konzolí. Vyznačuje se vysokou kompatibilitou s podporou přídavných čipů používaných v mnoha hrách té doby a zároveň si zachovává vysoký výkon. Jako jádro libretro podporuje Mesen S mnoho pokročilých funkcí, například softpatching a achievementy (prostřednictvím služby RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA je rychlý a přesný emulátor jedné z nejoblíbenějších a nejoblíbenějších kapesních konzolí, který je kompatibilní s obrovskou knihovnou oblíbených 8 a 16bitových her. Kromě snahy o rychlost a věrnou reprodukci má mGBA také spoustu skvělých funkcí pro vylepšení, včetně podpory vlastních palet pro hry, které byly původně ve stupních šedi, a zobrazování okrajů u her, které je obsahují.\n\nToto DLC umožňuje spustit mGBA prostřednictvím aplikace RetroArch, která přidává všechna její vylepšení a funkce, včetně přetáčení v reálném čase, rozsáhlého postprocessingu shaderů a vstupu s nízkou latencí, aby poskytla moderní herní zážitek i u klasických titulů.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed je součástí dlouhé řady emulátorů, která zahrnuje PCSX-Reloaded, PCSX-df a samozřejmě původní PCSX. Tento konkrétní fork byl původně silně optimalizován pro zařízení s procesory ARM, odtud název, ale přidali jsme zpět poměrně dost věcí, aby dobře fungoval i na typickém hardwaru PC.\n\nJako jádro libretro vyžaduje toto DLC rozhraní RetroArch, kde může být načteno jako jádro pro spouštění her a softwaru, které jsou kompatibilní s emulátorem PCSX ReARMed. Toto jádro vyžaduje, aby byl obraz BIOSu (není součástí dodávky) pro každou oblast softwaru umístěn do adresáře \"system\" aplikace RetroArch, aby správně fungoval.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\n\nSameBoy je velmi přesný emulátor, který je známý tím, že úspěšně spouští několik her, které ostatním emulátorům způsobují potíže. Kromě této vysoké přesnosti má SameBoy také několik příjemných funkcí, jako je možnost vybrat si model zařízení, který se má emulovat, bez ohledu na to, pro jaký model je hra určena, palety barev, které si může zvolit uživatel, vestavěný HLE BIOS a možnost načítat okraje u her, které je podporují.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella je bezplatný emulátor s otevřeným zdrojovým kódem pro jednu z nejoblíbenějších a nejvlivnějších domácích herních konzolí 70. a 80. let. Tento emulátor byl původně vyvinut pro použití v operačním systému GNU/Linux, ale postupem času byl portován na mnoho různých platforem, včetně libretro, které umožňuje přehrávání prostřednictvím herního a multimediálního systému RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nBěhem posledních několika let udělal vývojový tým Stelly velký pokrok v napodobování mnoha zvláštností cílové konzole Stella, díky čemuž je kompatibilní s mnoha obtížně emulovatelnými hrami, homebrew softwarem a demoverzemi.\n\nProstřednictvím aplikace RetroArch můžete do tohoto klasického emulátoru vnést moderní nádech, a to díky podpoře přetáčení v reálném čase a RetroAchievements, stejně jako díky ve své třídě nejlepším shaderům RetroArch pro emulaci CRT displeje a dalším funkcím.",
   "requirements": "CPU: Intel Pentium 4 a vyšší (vyžadován procesor s instrukcemi SSE2) \nDoporučený procesor: Intel Core series nebo ekvivalentní procesor AMD \n Grafický procesor: libovolný kompatibilní s OpenGL 2.x nebo Direct3D11. Pro správnou funkci shaderů by měla podporovat alespoň Shader Model 2.0. \nDoporučené grafické rozhraní: 1: Intel: Pro OpenGL je vyžadován alespoň Intel HD 4K, pro Direct3D 11 jakýkoli GPU kompatibilní s D3D11. Měla by podporovat alespoň Shader Model 3.0 a/nebo 4.0. \nDalší poznámky: Pro OpenGL: Grafické procesory Intel HD 2K/3K v systému Windows 10 se budou muset vrátit k ovladači OpenGL 1.1.",
   "legal-limits": "RetroArch je svobodný/otevřený software, který je k dispozici pod licencí GNU GPL 3.0. \nNeobsahuje žádný materiál chráněný autorskými právy třetích stran. RetroArch v žádném případě neschvaluje pirátství."
}
