{
   "main-desc": "RetroArch jest programem open source i wieloplatformowym frontendem/frameworkiem dla emulatorów, silników gier, gier wideo, odtwarzaczy multimediów i innych aplikacji.\n\nUmożliwia on przede wszystkim granie w klasyczne gry na komputerze i szerokiej gamie konsol za pomocą prostego interfejsu graficznego. Ustawienia są również zunifikowane, więc konfiguracja jest wykonywana raz na zawsze.\n\nPonadto wkrótce będziesz mógł uruchomić oryginalne dyski (płyty CD) poprzez RetroArch. Poważnie podchodzimy do kwestii ochrony gier wideo i chcemy mieć pewność, że możesz uruchamiać oryginalnie zakupioną zawartość na współczesnych komputerach.\n\nRetroArch posiada zaawansowane funkcje, takie jak shadery, gra sieciowa, przewijanie i wiele więcej!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (alias FBNeo) to nowa, oficjalna gałąź emulatora Final Burn Alpha, która jest kompatybilna z setkami gier arcade i na konsole. Rdzeń libretro FBNeo umożliwie uruchamianie kompatybilnych tytułów na RetroArch, gdzie ścisła integracja rdzenia z interfejsem libretro pozwala na użycie zaawansowanych funkcji RetroArch, takich jak gra sieciowa i redukcja opóźnień. Zawiera schematy sterowania z automatycznym przypisaniem przycisków dla różnych gier, łącznie z układami dla bijatyk, zarówno dla współczesnych kontrolerów, jak i klasycznych kontrolerów arcade.",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX rozpoczął się jako homebrew port emulatora Genesis Plus dla hakowanej konsoli przed przeniesieniem do libretro. Ze względu na szybkość, dokładność i możliwość przenoszenia Genesis Plus GX pojawia się obecnie na różnych platformach i frontach, i jest znana jako jeden z najbardziej zdolnych i kompatybilnych emulatorów dla konsol, które pokrywa, ze wsparciem zarówno dla gier na kartridżach, jak i CD-ROM. Działa ona również dobrze z wieloma zaawansowanymi funkcjami RetroArch, takimi jak wiatr w czasie rzeczywistym, redukcja opóźnień, oszustwa i osiągnięcia RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos jest nowoczesnym forkiem emulatora UoYabause, który sam jest forkiem generowalnego emulatora Yabause. Ta DLC dostarcza rdzeń Kronos-libretro do użycia z interfejsem RetroArch i multimedialnym, umożliwienie użytkownikom załadowania oprogramowania kompatybilnego z emulatorem Kronos.\n\nKronos wykorzystuje nowoczesne możliwości OpenGL do zapewnienia wielu dodatkowych funkcji graficznych, takie jak większa rozdzielczość wewnętrzna, dlatego zaleca się stosowanie aktualnego i dość wydajnego GPU.\n\nKronos obsługuje ładowanie gier z wielu różnych formatów, w tym ISO, BIN/CUE i skompresowany format CHD i wymaga zewnętrznych plików BIOS (saturn_bios. w i stvbios.zip) umieszczone w folderze „system” RetroArch'a lub obok docelowego oprogramowania w celu poprawnego funkcjonowania.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2. ng[/img]\n\nMesen to bardzo dokładny i pełen funkcji emulator z obsługą wielu mapowania kartridży (nawet tych używanych w dziwnych, nieautoryzowanych kartów), niestandardowych palet kolorów i pakietów zasobów HD. Jako rdzeń libretro, Mesen obsługuje wiele zaawansowanych funkcji, takich jak softpatching i osiągnięcia (za pośrednictwem usługi RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S to bardzo dokładny i pełen funkcji emulator konsoli 16-bitowej. Ma wysoką kompatybilność, obsługuje dodatkowe układy używane w wielu grach z tamtej epoki, jednocześnie zachowując wysoką wydajność. Jako rdzeń libretro, Mesen S obsługuje wiele zaawansowanych funkcji, takich jak softpatching i osiągnięcia (poprzez usługę RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA jest szybkim, dokładnym emulatorem dla jednej z najpopularniejszych i najbardziej lubionych konsoli ręcznych, i ma kompatybilność z wielką biblioteką kochanych gier w stylu 8- i 16-bitowym. Oprócz zaangażowania na rzecz szybkości i wiernego rozmnażania mGBA ma również bardzo wiele ulepszeń, w tym wsparcie dla niestandardowych palet dla gier, które były początkowo szarości i wyświetlały obramowania dla gier, które je zawierają.\n\nTa DLC pozwala mGBA na działanie RetroArch, co dodaje wszystkie jego ulepszenia i funkcje, w tym wiatr w czasie rzeczywistym, rozbudowanych cieniarzy po przetwarzaniu i danych wejściowych o niskim opóźnieniu, aby zapewnić nowoczesne doświadczenie w grze, nawet z klasycznymi tytułami.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX. na[/img]\nPCSX ReARMed jest częścią długiej linii emulatorów, która obejmuje PCSX-Reloaded, PCSX-df i, oczywiście, oryginalny PCSX. Ten konkretny fork był pierwotnie mocno zoptymalizowany pod kątem urządzeń z procesorami ARM, stąd nazwa, ale dodaliśmy z powrotem kilka rzeczy, aby działał dobrze również na typowym sprzęcie PC.\n\nJako rdzeń libretro, to DLC wymaga interfejsu RetroArch, w którym można go załadować jako rdzeń do uruchamiania gier i oprogramowania kompatybilnego z emulatorem PCSX ReARMed. Ten rdzeń do poprawnego działania wymaga, aby obraz BIOS-u (brak w zestawie) dla każdego regionu oprogramowania został umieszczony w katalogu „systemowym” RetroArch, aby działał poprawnie.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).[/img]\nSameBoy to bardzo dokładny emulator znany z pomyślnego uruchamiania kilku gier, które powodują potykanie się innych emulatorów. Oprócz tej wysokiej dokładności SameBoy oferuje również kilka fajnych funkcji, takich jak możliwość wybrania modelu urządzenia do emulacji, niezależnie od tego, dla jakiego modelu jest przeznaczona gra, wybierane przez użytkownika palety kolorowania, wbudowany HLE BIOS i możliwość wczytywania obramowań w grach, które je wspierają.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.[/img]\n\nStella jest darmowa, Emulator open-source dla jednej z najbardziej popularnych i wpływowych domowych konsoli do gier wideo z lat 70. i 80. Emulator ten został pierwotnie opracowany do użytku w systemie operacyjnym GNU/Linux, ale z czasem już posiada, zostały przewiezione na wiele różnych platform, w tym libretro, które umożliwiają granie przez system gry RetroArch i multimediów.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.[/img]\n\nW ciągu ostatnich kilku lat, zespół ds. rozwoju Stella wykonał wspaniałe kroki w łagodzeniu wielu zapytań docelowej konsoli Stelli, dostosowanie go do wielu trudnych do naśladowania gier, oprogramowania homebrajskiego i demo.\n\nPrzez RetroArch możesz wnieść nowoczesny kontakt do tego klasycznego emulatora, ze wsparciem dla rewijania i wstecznych osiągnięć w czasie rzeczywistym, jak również z najlepszymi w klasie kontrasystentami RetroArcha do emulacji wyświetlaczy CRT i innych.",
   "requirements": "Procesor: Intel Pentium 4 lub nowszy (wymagany procesor z instrukcjami SSE2)\nZalecany procesor: seria Intel Core lub odpowiednik AMD\nGrafika: Dowolny zgodny z OpenGL 2.x lub Direct3D11. Aby shadery działały poprawnie, powinien obsługiwać co najmniej Shader Model 2.0.\nGrafika zalecana: Intel: co najmniej Intel HD 4K wymagany dla OpenGL, dowolny zgodny procesor graficzny D3D11 dla Direct3D 11. Powinien obsługiwać co najmniej Shader Model 3.0 i / lub 4.0.\nDodatkowe uwagi: W przypadku OpenGL: procesory graficzne Intel HD 2K / 3K w systemie Windows 10 będą musiały wrócić do sterownika OpenGL 1.1.",
   "legal-limits": "RetroArch to oprogramowanie bezpłatne / open source, dostępne na licencji GNU GPL 3.0.\nNie zawiera żadnych materiałów chronionych prawem autorskim stron trzecich. RetroArch nie toleruje piractwa w żaden sposób, w żadnym kształcie ani w żadnej formie."
}
