{
   "main-desc": "RetroArch est une interface/structure open source et multi-plateforme pour des émulateurs, moteurs de jeux, jeux vidéo, lecteurs multimédia et autres applications.\n\nBien qu'il puisse faire beaucoup de choses en plus de cela, il est le plus connu pour vous permettre de faire tourner des jeux classiques sur une large gamme d'ordinateurs et de consoles à travers une interface graphique astucieuse. Les paramètres sont également unifiés de sorte que la configuration est faite une fois pour toutes.\n\nEn plus de cela, vous pourrez bientôt exécuter des disques de jeu originaux (CDs) depuis RetroArch. Nous prenons la préservation des jeux vidéo au sérieux et voulons vous assurer de pouvoir exécuter votre contenu acheté d'origine sur des PC modernes.\n\nRetroArch a des fonctionnalités avancées telles que les shaders, le jeu en réseau, le rembobinage, un temps de réponse immédiat, l'éxécution en avance, et plus encore !",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\n\nFinal Burn Neo (alias FBNeo) est la nouvelle branche officielle de l'émulateur Final Burn Alpha, qui est compatible avec des centaines de jeux d'arcade et de console. Le cœur libretro de FBNeo apporte sa bibliothèque de titres compatibles à RetroArch, où l'intégration étroite du cœur avec l'API de libretro lui permet de fonctionner avec les fonctions de précision avancées de RetroArch, telles que le jeu en réseau basé sur le rembobinage et l'exécution en avance pour la réduction de latence. Il comprend des préréglages de manettes pour le mappage automatique des touches pour différents jeux, incluant des dispositions pour les jeux de combat avec les manettes modernes et les sticks d'arcade à l'ancienne (alias fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\n\nGenesis Plus GX a débuté en tant que portage homebrew de l'émulateur Genesis Plus pour une console piratée avant d'être porté sur libretro. En se concentrant sur la vitesse, la précision et la portabilité, Genesis Plus GX apparaît maintenant sur une variété de plates-formes et interfaces, et est connu comme l'un des émulateurs les plus capables et compatibles pour les consoles qu'il supporte, avec une prise en charge des jeux sur cartouches et CD-ROM. Il fonctionne également bien avec de nombreuses fonctionnalités avancées de RetroArch, telles que le rembobinage en temps réel, la réduction de la latence par éxécution en avance, les cheats et les RetroSuccès (RetroAchievements).",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos est une fork moderne de l'émulateur uoYabause, qui est elle-même une fork du vénérable émulateur Yabause. Ce DLC fournit le cœur Kronos-libretro à utiliser avec l'interface de jeu et multimédia RetroArch, permettant aux utilisateurs de charger des logiciels compatibles avec l'émulateur Kronos.\n\nKronos utilise des capacités modernes d'OpenGL pour fournir une variété de fonctionnalités graphiques supplémentaires, comme une résolution interne accrue, il est donc recommandé de disposer d'un processeur graphique récent et raisonnablement puissant.\n\nKronos supporte le chargement de jeux à partir de différents formats, y compris ISO, BIN/CUE et le format CHD compressé, et il nécessite des fichiers BIOS externes (saturn_bios.bin et stvbios.zip) placés soit dans le dossier \"system\" de RetroArch, soit avec le logiciel cible afin de fonctionner correctement.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen est un émulateur très précis et rempli de fonctionnalités avec le support d'une tonne de mappers cartouche (même ceux utilisés par des jeux étranges et non autorisés), des palettes de couleurs personnalisées et des packs de ressources HD. En tant que cœur de libretro, Mesen prend en charge de nombreuses fonctionnalités avancées, telles que le patching logiciel et les succès (grâce au service RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S est un émulateur de console 16bit très précis et rempli de fonctionnalités. Il a une grande compatibilité, avec le support des processeurs additionnels utilisés dans de nombreux jeux de l'époque, tout en maintenant également des performances élevées. En tant que cœur libretro, Mesen S prend en charge de nombreuses fonctionnalités avancées, telles que le patching logiciel et les succès (grâce au service RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA est un émulateur rapide et précis pour l'une des consoles de poche les plus populaires et les plus appréciées, et il est compatible avec une grande bibliothèque de jeux du style 8 et 16 bits. En plus de l'engagement en faveur de la vitesse et de la reproduction fidèle, mGBA a également une tonne de fonctionnalités d'amélioration y compris le support de palettes personnalisées pour les jeux qui étaient à l'origine en niveaux de gris et l'affichage de bordures pour les jeux qui les incluent.\n\nCe DLC permet à mGBA de passer par RetroArch, qui ajoute toutes ses améliorations et fonctionnalités, y compris le rembobinage en temps réel, des shaders de post-traitement et une faible latence des entrées de touches pour fournir une expérience de jeu moderne, même avec des titres classiques.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed fait partie d'une longue lignée d'émulateurs qui inclut PCSX-Reloaded, PCSX-df et, bien sûr, le PCSX original. Ce fork particulier a été initialement fortement optimisé pour les périphériques avec des processeurs ARM, d'où le nom, mais nous avons rajouté un bon nombre de choses pour le faire fonctionner correctement sur du matériel PC typique.\n\nEn tant que cœur libretro, ce DLC nécessite l'interface de RetroArch, où il peut être chargé en tant que cœur pour exécuter des jeux et logiciels compatibles avec l'émulateur PCSX ReARMed. Ce cœur nécessite une image BIOS (non incluse) pour chaque région du logiciel à placer dans le répertoire \"system\" de RetroArch afin de fonctionner correctement.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\n\nSameBoy est un émulateur très précis connu pour avoir réussi à faire tourner quelques jeux qui posent problème à d'autres émulateurs. En plus de cette haute précision, SameBoy a également quelques belles fonctionnalités comme la possibilité de choisir le modèle de l'appareil à émuler, quel que soit le modèle pour lequel le jeu est conçu, des palettes de colorisation sélectionnables par l'utilisateur, un BIOS HLE intégré et la possibilité de charger les bordures des jeux qui les supportent.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella est un émulateur gratuit et open-source pour l'une des consoles de jeux vidéo les plus populaires et influentes des années 70 et 80. Cet émulateur a été développé à l'origine pour être utilisé sur le système d'exploitation GNU/Linux, mais a au fil du temps a été porté sur de nombreuses plates-formes, y compris libretro, ce qui lui permet d'être joué au travers du système de jeu et multimédia RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nAu cours des quelques dernières années, l'équipe de développement de Stella a fait de grands progrès en imitant les nombreuses bizarreries de la console cible de Stella, le rendant compatible avec de nombreux jeux difficiles à émuler, des logiciels homebrew et des démos.\n\nGrâce à RetroArch, vous pouvez apporter une touche moderne à cet émulateur classique, avec le support du rembobinage en temps réel et des RetroSuccès (RetroAchievements), ainsi que des meilleurs shaders de la classe pour l'émulation d'un écran à tube cathodique (CRT) et plus encore.",
   "requirements": "Processeur : Intel Pentium 4 et supérieur (CPU avec les instructions SSE2 requis) \nProcesseur recommandé : Intel Core series ou équivalent AMD \nCarte graphique : N'importe quel GPU compatible OpenGL 2.x ou Direct3D11. Pour que les shaders fonctionnent correctement, le GPU devrait prendre en charge au moins le Shader Model 2.0. \nCarte graphique recommandée : Intel : Au moins Intel HD 4K requis pour OpenGL, tout GPU conforme D3D11 pour Direct3D 11. Doit supporter au moins le Shader Model 3.0 et/ou 4.0. \nRemarques supplémentaires : Pour OpenGL : les GPU Intel HD 2K/3K sous Windows 10 devront avoir recourt à un pilote OpenGL 1.1.",
   "legal-limits": "RetroArch est un logiciel libre/open source, disponible sous la licence GNU GPL 3.0. \nIl ne contient aucun matériel protégé par des tiers. RetroArch n'autorise en aucun cas le piratage de quelque manière que ce soit."
}
