{
   "main-desc": "RetroArch is an open source and cross platform frontend/framework for emulators, game engines, video games, media players and other applications.\n\nWhile it can do many things besides this, it is most widely known for enabling you to run classic games on a wide range of computers and consoles through a slick graphical interface. Settings are also unified so configuration is done once and for all.\n\nIn addition to this, you will soon be able to run original game discs (CDs) from RetroArch. We take videogame preservation seriously and want to ensure you can run your originally bought content on modern day PCs.\n\nRetroArch has advanced features like shaders, netplay, rewinding, next-frame response times, run-ahead, and more!",
   "final-burn-neo-desc": "[img]{STEAM_APP_IMAGE}/extras/FBN_a2.png[/img]\r\n\r\nFinal Burn Neo (aka FBNeo) is the new official branch of the Final Burn Alpha emulator, which is compatible with hundreds of arcade and console games. The libretro core of FBNeo brings its library of compatible titles to RetroArch, where the core's tight integration with the libretro API allows it to work with RetroArch's advanced time-bending features like rollback-based netplay and run-ahead latency reduction. It includes input presets for automatic mapping of buttons for different games, including fighting game layouts for both modern and old-school arcade controls (aka fightsticks).",
   "genesis-plus-gx-desc": "[img]{STEAM_APP_IMAGE}/extras/Genesis_Plus_GX_(Phone).png[/img]\r\n\r\nGenesis Plus GX began as a homebrew port of the Genesis Plus emulator for a hacked console before being ported to libretro. With a focus on speed, accuracy and portability, Genesis Plus GX now appears on a variety of platforms and frontends, and is known as one of the most capable and compatible emulators for the consoles it covers, with support for both cartridge and CD-ROM games. It also works well with many of RetroArch's advanced features, such as real-time rewind, run-ahead latency reduction, cheats and RetroAchievements.",
   "kronos-desc": "[img]{STEAM_APP_IMAGE}/extras/main.png[/img]\n\nKronos es una bifurcación moderna del emulador UoYabause, que es a su vez una bifurcación del venerable emulador Yabause. Este contenido descargable ofrece el núcleo Kronos-libretro para la interfaz de juegos y multimedia RetroArch, permitiendo a los usuarios cargar software compatible con el emulador Kronos.\n\nKronos utiliza las últimas prestaciones de OpenGL para dar una miríada de características gráficas adicionales, como una mayor resolución interna, así que se recomienda tener una GPU moderna y de cierta potencia.\n\nKronos puede cargar juegos a partir de diversos formatos, que incluyen ISO, BIN/CUE y el formato comprimido CHD, y necesita archivos adicionales de la BIOS (saturn_bios.bin y stvbios.zip) en la carpeta «system» de RetroArch o junto al software objetivo para poder funcionar.",
   "mesen-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img]\n\nMesen es un emulador muy preciso y completo compatible con todo tipo de asignadores de cartuchos (incluso los que se utilizan en los cartuchos más raros y sin autorización), paletas de color personalizadas y paquetes de contenidos en HD. Como núcleo libretro, Mesen es compatible con muchas características avanzadas, como el parcheado al vuelo y los logros (a través del servicio RetroAchievements).",
   "mesen-s-desc": "[img]{STEAM_APP_IMAGE}/extras/mesen2.png[/img][img]{STEAM_APP_IMAGE}/extras/-S2.png[/img]\n\nMesen S es un emulador de consolas de 16 bits muy preciso y completo. Tiene un alto nivel de compatibilidad y rendimiento, y es compatible con los chips adicionales utilizados en muchos juegos de la época. Como núcleo libretro, Mesen S es compatible con muchas características avanzadas, como el parcheado al vuelo y los logros (a través del servicio RetroAchievements).",
   "mgba-desc": "[img]{STEAM_APP_IMAGE}/extras/mgba.png[/img]\n\nmGBA es un emulador rápido y preciso de una de las consolas portátiles más populares y queridas, compatible con un enorme catálogo de juegos de 8 y 16 bits. Además de estar pensado para ser rápido y fiel, mGBA también tiene muchas grandes mejoras, como el soporte de paletas personalizadas para juegos que originalmente se mostraban en escala de grises y la compatibilidad con los bordes que incluyen ciertos juegos.\n\nEste contenido descargable permite ejecutar mGBA a través de RetroArch, que añade todas sus características y mejoras, incluyendo el rebobinado en tiempo real, shaders de posprocesado extensos y una entrada de baja latencia para dar una experiencia moderna de juego hasta en los títulos más clásicos.",
   "pcsx-rearmed-desc": "[img]{STEAM_APP_IMAGE}/extras/PCSX.png[/img]\n\nPCSX ReARMed forma parte de un largo linaje de emuladores que incluye a PCSX-Reloaded, PCSX-df y, por supuesto, el PCSX original. Esta bifurcación en concreto fue optimizada originalmente para dispositivos con CPUs ARM y de ahí viene su nombre, pero hemos recuperado bastantes cosas para que también pueda funcionar bien en el hardware habitual de un ordenador.\n\nComo núcleo libretro, este contenido descargable necesita la interfaz RetroArch, donde podrá ser cargado como un núcleo capaz de ejecutar juegos y software compatible con el emulador PCSX ReARMed. Este núcleo necesita que haya una imagen de la BIOS (no incluida) de cada región de software dentro de la carpeta «system» de RetroArch para poder funcionar.",
   "sameboy-desc": "[img]{STEAM_APP_IMAGE}/extras/SAMEBOY_(Phone).png[/img]\nSameBoy es un emulador muy preciso conocido por poder ejecutar ciertos juegos que dan problemas en otros emuladores. Además de esta precisión, SameBoy también presenta otras características interesantes, como la posibilidad de elegir el modelo de sistema a emular sin importar el modelo para el que estuviera designado el juego, paletas de color a gusto del usuario, una BIOS HLE integrada y la capacidad de mostrar bordes en juegos compatibles con los mismos.",
   "stella-desc": "[img]{STEAM_APP_IMAGE}/extras/stealla.png[/img]\n\nStella es un emulador gratuito y de código abierto para una de las consolas domésticas más populares e influyentes de las décadas de 1970 y 1980. Este emulador fue diseñado originalmente para el sistema operativo GNU/Linux, pero con el tiempo ha sido convertido a muchas plataformas, entre ellas libretro, que permite jugar mediante el sistema de juegos y multimedia RetroArch.\n\n[img]{STEAM_APP_IMAGE}/extras/2600.png[/img]\n\nEn los últimos años, el equipo de desarrollo de Stella ha hecho grandes avances para replicar las diversas peculiaridades de la consola objetivo de Stella, haciendo que sea compatible con muchos juegos, aplicaciones caseras y demos difíciles de emular.\n\nGracias a RetroArch, podrás darle un toque moderno a este emulador clásico con el soporte para rebobinado en tiempo real, logros RetroAchievements, los mejores shaders de RetroArch para emular monitores CRT, y mucho más.",
   "requirements": "CPU: Intel Pentium 4 o superior (es necesaria una CPU con instrucciones SSE2) \nCPU-recommended:Serie Core de Intel o equivalente de AMD \nGraphics: Cualquier GPU compatible con OpenGL 2.x o Direct3D11. Es necesaria la compatibilidad con el Shader Model 2.0 para que los shaders funcionen con normalidad. \nGraphics-recommended: Intel: Intel HD 4K mínimo para OpenGL, cualquier GPU compatible con D3D11 para Direct3D 11. Deberían ser compatibles con el Shader Model 3.0 o 4.0 mínimo. \nAdditional notes: Para OpenGL: Las GPU Intel HD 2K/3K en Windows 10 tendrán que utilizar un controlador OpenGL 1.1.",
   "legal-limits": "RetroArch es un software gratuito y de código abierto publicado bajo la licencia GPL 3.0 del GNU. \nNo contiene ningún material con derechos de autor de terceros. RetroArch está en contra de la piratería en todas sus formas."
}
